var ensembleData = {
  "time": "2026-09-05 21:32:32",
  "issue": "2026248",
  "code": "43,26,49,39,14,27,20",
  "zodiac": "鼠,蛇,马,龙,蛇,龙,猪",
  "wave": "green,blue,green,green,blue,green,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026249",
  "ninePool": [
    "蛇",
    "鼠",
    "虎",
    "兔",
    "羊",
    "猴",
    "猪",
    "马",
    "鸡"
  ],
  "sixPool": [
    "蛇",
    "鼠",
    "虎",
    "兔",
    "羊",
    "猴"
  ],
  "killZodiacs": [
    "虎",
    "猪"
  ],
  "numbers": [
    31,
    41,
    11,
    2,
    12,
    43,
    23,
    14,
    4,
    24,
    26,
    16,
    36,
    7,
    17,
    47
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "鼠",
      "蛇",
      "虎"
    ],
    "4": [
      "鼠",
      "蛇",
      "虎",
      "兔"
    ],
    "5": [
      "鼠",
      "蛇",
      "虎",
      "兔",
      "羊"
    ],
    "7": [
      "蛇",
      "鼠",
      "虎",
      "兔",
      "羊",
      "猴",
      "猪"
    ],
    "8": [
      "蛇",
      "鼠",
      "虎",
      "兔",
      "羊",
      "猴",
      "猪",
      "马"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 62.0,
  "votes": {
    "蛇": 4.5,
    "马": 2.0,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 2.0,
    "狗": 1.0,
    "猪": 3.0,
    "鼠": 4.5,
    "牛": 2.0,
    "虎": 3.5,
    "兔": 3.5,
    "龙": 1.0
  }
};