var ensembleData = {
  "time": "2026-05-26 21:32:32",
  "issue": "2026146",
  "code": "11,30,20,19,05,16,42",
  "zodiac": "猴,牛,猪,鼠,虎,兔,牛",
  "wave": "green,red,blue,red,green,green,blue",
  "teSx": "牛",
  "teWei": 2,
  "nextIssue": "2026147",
  "ninePool": [
    "龙",
    "鸡",
    "马",
    "狗",
    "猴",
    "羊",
    "兔",
    "蛇",
    "鼠"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "羊",
    "兔",
    "马",
    "鼠"
  ],
  "killZodiacs": [
    "狗",
    "牛"
  ],
  "rangeZodiacs": [
    "龙",
    "鸡",
    "马",
    "狗",
    "猴",
    "羊",
    "兔",
    "蛇",
    "鼠"
  ],
  "numbers": [
    27,
    10,
    12,
    40,
    1,
    7,
    31,
    22,
    37,
    15,
    25,
    48
  ],
  "zodiacNumMap": {
    "龙": [
      27,
      15
    ],
    "鸡": [
      10,
      22
    ],
    "羊": [
      12,
      48
    ],
    "兔": [
      40
    ],
    "马": [
      1,
      37,
      25
    ],
    "鼠": [
      7,
      31
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    7,
    5,
    8,
    9
  ],
  "votes9": {
    "鸡": 4,
    "龙": 4,
    "兔": 3,
    "蛇": 3,
    "马": 4,
    "羊": 3,
    "虎": 1,
    "猴": 4,
    "狗": 4,
    "猪": 2,
    "鼠": 2,
    "牛": 2
  },
  "votes6": {
    "鸡": 3,
    "龙": 4,
    "兔": 3,
    "蛇": 2,
    "马": 2,
    "羊": 3,
    "狗": 2,
    "猪": 1,
    "鼠": 2,
    "牛": 2
  }
};