var ensembleData = {
  "time": "2026-10-28 21:32:32",
  "issue": "2026301",
  "code": "27,41,23,11,02,43,17",
  "zodiac": "龙,虎,猴,猴,蛇,鼠,虎",
  "wave": "green,blue,red,green,red,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026302",
  "ninePool": [
    "狗",
    "鸡",
    "龙",
    "蛇",
    "兔",
    "羊",
    "鼠",
    "猴",
    "马"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "龙",
    "蛇",
    "兔",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "虎"
  ],
  "numbers": [
    21,
    34,
    14,
    4,
    24,
    45,
    15,
    46,
    26,
    16,
    36,
    27,
    38,
    28,
    48,
    9
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "狗",
      "鸡",
      "龙"
    ],
    "4": [
      "狗",
      "鸡",
      "龙",
      "兔"
    ],
    "5": [
      "狗",
      "鸡",
      "龙",
      "兔",
      "蛇"
    ],
    "7": [
      "狗",
      "鸡",
      "龙",
      "蛇",
      "兔",
      "羊",
      "鼠"
    ],
    "8": [
      "狗",
      "鸡",
      "龙",
      "蛇",
      "兔",
      "羊",
      "鼠",
      "猴"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 44.0,
  "votes": {
    "蛇": 3.5,
    "马": 2.0,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 4.5,
    "猪": 1.0,
    "鼠": 3.0,
    "牛": 2.0,
    "龙": 3.5,
    "兔": 3.5,
    "虎": 1.0
  }
};