var ensembleData = {
  "time": "2026-10-14 21:32:32",
  "issue": "2026287",
  "code": "19,47,38,35,06,17,08",
  "zodiac": "鼠,猴,蛇,猴,牛,虎,猪",
  "wave": "red,blue,green,red,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026288",
  "ninePool": [
    "马",
    "蛇",
    "羊",
    "虎",
    "牛",
    "猪",
    "兔",
    "鸡",
    "猴"
  ],
  "sixPool": [
    "马",
    "蛇",
    "羊",
    "虎",
    "牛",
    "猪"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "numbers": [
    1,
    41,
    2,
    12,
    42,
    32,
    14,
    24,
    44,
    25,
    5,
    26,
    36,
    6,
    38,
    48
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "马",
      "蛇",
      "羊"
    ],
    "4": [
      "马",
      "蛇",
      "羊",
      "虎"
    ],
    "5": [
      "马",
      "蛇",
      "羊",
      "虎",
      "牛"
    ],
    "7": [
      "马",
      "蛇",
      "羊",
      "虎",
      "牛",
      "猪",
      "兔"
    ],
    "8": [
      "马",
      "蛇",
      "羊",
      "虎",
      "牛",
      "猪",
      "兔",
      "鸡"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 48.0,
  "votes": {
    "牛": 3.5,
    "虎": 3.5,
    "兔": 3.0,
    "龙": 2.0,
    "蛇": 4.5,
    "马": 4.5,
    "羊": 4.5,
    "猴": 3.0,
    "鸡": 3.0,
    "猪": 3.5,
    "狗": 1.0
  }
};