var ensembleData = {
  "time": "2026-08-26 21:32:32",
  "issue": "2026238",
  "code": "35,44,23,04,07,21,17",
  "zodiac": "猴,猪,猴,兔,鼠,狗,虎",
  "wave": "red,green,red,blue,red,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026239",
  "ninePool": [
    "龙",
    "马",
    "羊",
    "狗",
    "蛇",
    "虎",
    "兔",
    "鼠",
    "牛"
  ],
  "sixPool": [
    "龙",
    "马",
    "羊",
    "狗",
    "蛇",
    "虎"
  ],
  "killZodiacs": [
    "猴",
    "虎"
  ],
  "numbers": [
    1,
    21,
    41,
    3,
    13,
    33,
    24,
    14,
    15,
    25,
    45,
    5,
    36,
    26,
    27,
    37
  ],
  "supplement": [],
  "optTails": [
    1,
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "马",
      "羊"
    ],
    "4": [
      "龙",
      "马",
      "羊",
      "狗"
    ],
    "5": [
      "龙",
      "马",
      "羊",
      "狗",
      "兔"
    ],
    "7": [
      "龙",
      "马",
      "羊",
      "狗",
      "蛇",
      "虎",
      "兔"
    ],
    "8": [
      "龙",
      "马",
      "羊",
      "狗",
      "蛇",
      "虎",
      "兔",
      "鼠"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0,
  "votes": {
    "鼠": 2.0,
    "牛": 2.0,
    "虎": 3.0,
    "兔": 3.0,
    "龙": 4.5,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 4.5,
    "猴": 2.0,
    "狗": 3.5,
    "鸡": 1.0
  }
};