var ensembleData = {
  "time": "2026-07-05 21:32:32",
  "issue": "2026186",
  "code": "17,29,22,01,05,38,23",
  "zodiac": "虎,虎,鸡,马,虎,蛇,猴",
  "wave": "green,red,green,red,green,green,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026187",
  "ninePool": [
    "龙",
    "兔",
    "马",
    "蛇",
    "虎",
    "牛",
    "羊",
    "狗",
    "鼠"
  ],
  "sixPool": [
    "龙",
    "兔",
    "马",
    "蛇",
    "虎",
    "牛"
  ],
  "killZodiacs": [
    "猪",
    "猴"
  ],
  "numbers": [
    3,
    4,
    6,
    39,
    40,
    42,
    15,
    16,
    18,
    27,
    28,
    30,
    38,
    25,
    17,
    5
  ],
  "pools": {
    "3": [
      "兔",
      "龙",
      "牛"
    ],
    "4": [
      "龙",
      "兔",
      "马",
      "蛇"
    ],
    "5": [
      "龙",
      "兔",
      "马",
      "蛇",
      "虎"
    ],
    "7": [
      "龙",
      "兔",
      "马",
      "蛇",
      "虎",
      "牛",
      "羊"
    ],
    "8": [
      "龙",
      "兔",
      "马",
      "蛇",
      "虎",
      "牛",
      "羊",
      "狗"
    ]
  },
  "dynamicRate9": 79.48717948717949,
  "dynamicRate6": 64.1025641025641,
  "votes": {
    "猪": 1,
    "虎": 3,
    "龙": 4,
    "蛇": 3,
    "马": 3,
    "狗": 2,
    "兔": 4,
    "鸡": 2,
    "羊": 3,
    "鼠": 2,
    "牛": 3,
    "猴": 1
  }
};