var ensembleData = {
  "time": "2026-08-22 21:32:32",
  "issue": "2026234",
  "code": "25,30,37,19,07,17,39",
  "zodiac": "马,牛,马,鼠,鼠,虎,龙",
  "wave": "blue,red,blue,red,red,green,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026235",
  "ninePool": [
    "虎",
    "鼠",
    "猪",
    "猴",
    "羊",
    "马",
    "蛇",
    "鸡",
    "牛"
  ],
  "sixPool": [
    "虎",
    "鼠",
    "猪",
    "猴",
    "羊",
    "马"
  ],
  "killZodiacs": [
    "狗",
    "龙"
  ],
  "numbers": [
    20,
    41,
    31,
    11,
    1,
    43,
    23,
    13,
    5,
    35,
    25,
    36,
    17,
    7,
    47,
    37
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "鼠",
      "虎",
      "猪"
    ],
    "4": [
      "鼠",
      "虎",
      "猪",
      "猴"
    ],
    "5": [
      "鼠",
      "虎",
      "猪",
      "猴",
      "羊"
    ],
    "7": [
      "虎",
      "鼠",
      "猪",
      "猴",
      "羊",
      "马",
      "蛇"
    ],
    "8": [
      "虎",
      "鼠",
      "猪",
      "猴",
      "羊",
      "马",
      "蛇",
      "鸡"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "鼠": 4.5,
    "牛": 2.0,
    "虎": 4.5,
    "兔": 1.0,
    "龙": 1.0,
    "蛇": 3.0,
    "马": 3.0,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 2.0,
    "猪": 3.5,
    "狗": 1.0
  }
};