var ensembleData = {
  "time": "2026-08-23 21:32:32",
  "issue": "2026235",
  "code": "27,26,35,17,44,21,32",
  "zodiac": "龙,蛇,猴,虎,猪,狗,猪",
  "wave": "green,blue,red,green,green,green,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026236",
  "ninePool": [
    "蛇",
    "兔",
    "羊",
    "猴",
    "龙",
    "马",
    "鸡",
    "虎",
    "牛"
  ],
  "sixPool": [
    "蛇",
    "兔",
    "羊",
    "猴",
    "龙",
    "马"
  ],
  "killZodiacs": [
    "虎",
    "猪"
  ],
  "numbers": [
    11,
    1,
    2,
    12,
    23,
    3,
    13,
    14,
    4,
    24,
    26,
    16,
    36,
    47,
    27,
    37
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "兔",
      "猴"
    ],
    "4": [
      "蛇",
      "兔",
      "猴",
      "龙"
    ],
    "5": [
      "蛇",
      "兔",
      "猴",
      "龙",
      "马"
    ],
    "7": [
      "蛇",
      "兔",
      "羊",
      "猴",
      "龙",
      "马",
      "鸡"
    ],
    "8": [
      "蛇",
      "兔",
      "羊",
      "猴",
      "龙",
      "马",
      "鸡",
      "虎"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0,
  "votes": {
    "鼠": 2.0,
    "牛": 2.0,
    "虎": 2.0,
    "兔": 3.5,
    "龙": 3.0,
    "蛇": 4.5,
    "马": 3.0,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 2.0,
    "狗": 1.0,
    "猪": 1.0
  }
};