var ensembleData = {
  "time": "2026-08-16 21:32:32",
  "issue": "2026228",
  "code": "38,26,08,06,29,18,23",
  "zodiac": "蛇,蛇,猪,牛,虎,牛,猴",
  "wave": "green,blue,red,green,red,red,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026229",
  "ninePool": [
    "蛇",
    "鸡",
    "牛",
    "狗",
    "龙",
    "马",
    "虎",
    "兔",
    "鼠"
  ],
  "sixPool": [
    "蛇",
    "鸡",
    "牛",
    "狗",
    "龙",
    "马"
  ],
  "killZodiacs": [
    "虎",
    "猴"
  ],
  "numbers": [
    21,
    1,
    2,
    22,
    42,
    33,
    3,
    13,
    14,
    34,
    26,
    46,
    6,
    27,
    37,
    38
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "鸡",
      "牛"
    ],
    "4": [
      "蛇",
      "鸡",
      "牛",
      "狗"
    ],
    "5": [
      "蛇",
      "鸡",
      "牛",
      "狗",
      "龙"
    ],
    "7": [
      "蛇",
      "鸡",
      "牛",
      "狗",
      "龙",
      "马",
      "虎"
    ],
    "8": [
      "蛇",
      "鸡",
      "牛",
      "狗",
      "龙",
      "马",
      "虎",
      "兔"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "虎": 2.0,
    "兔": 2.0,
    "龙": 3.0,
    "蛇": 4.5,
    "马": 3.0,
    "羊": 1.0,
    "猴": 2.0,
    "鸡": 4.5,
    "狗": 3.5,
    "牛": 3.5,
    "猪": 2.0,
    "鼠": 2.0
  }
};