var ensembleData = {
  "time": "2026-10-22 21:32:32",
  "issue": "2026295",
  "code": "22,28,33,17,13,47,25",
  "zodiac": "鸡,兔,狗,虎,马,猴,马",
  "wave": "green,green,green,green,red,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026296",
  "ninePool": [
    "虎",
    "龙",
    "狗",
    "猴",
    "鼠",
    "羊",
    "鸡",
    "牛",
    "猪"
  ],
  "sixPool": [
    "虎",
    "龙",
    "狗",
    "猴",
    "鼠",
    "羊"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "numbers": [
    41,
    3,
    21,
    33,
    11,
    23,
    31,
    43,
    12,
    24,
    36,
    48,
    5,
    17,
    29,
    15
  ],
  "supplement": [
    5,
    17,
    29,
    15
  ],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "龙",
      "牛"
    ],
    "4": [
      "虎",
      "龙",
      "牛",
      "鼠"
    ],
    "5": [
      "虎",
      "龙",
      "牛",
      "鼠",
      "羊"
    ],
    "7": [
      "虎",
      "龙",
      "狗",
      "猴",
      "鼠",
      "羊",
      "鸡"
    ],
    "8": [
      "虎",
      "龙",
      "狗",
      "猴",
      "鼠",
      "羊",
      "鸡",
      "牛"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 42.0,
  "votes": {
    "马": 1.0,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 3.0,
    "虎": 4.5,
    "龙": 3.5
  }
};