var ensembleData = {
  "time": "2026-05-27 21:32:32",
  "issue": "2026147",
  "code": "29,40,06,18,31,10,13",
  "zodiac": "虎,兔,牛,牛,鼠,鸡,马",
  "wave": "red,red,green,red,blue,blue,red",
  "teSx": "马",
  "teWei": 3,
  "nextIssue": "2026148",
  "ninePool": [
    "龙",
    "鸡",
    "鼠",
    "羊",
    "猴",
    "牛",
    "狗",
    "虎",
    "猪"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "羊",
    "猴",
    "牛",
    "虎"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "rangeZodiacs": [
    "龙",
    "鸡",
    "鼠",
    "羊",
    "猴",
    "牛",
    "狗",
    "虎",
    "猪"
  ],
  "numbers": [
    27,
    10,
    48,
    11,
    18,
    17,
    30,
    41,
    47,
    22,
    12,
    42
  ],
  "zodiacNumMap": {
    "龙": [
      27
    ],
    "鸡": [
      10,
      22
    ],
    "羊": [
      48,
      12
    ],
    "猴": [
      11,
      47
    ],
    "牛": [
      18,
      30,
      42
    ],
    "虎": [
      17,
      41
    ]
  },
  "top7Tails": [
    0,
    1,
    7,
    8,
    2,
    5,
    9
  ],
  "votes9": {
    "龙": 4,
    "鸡": 4,
    "鼠": 4,
    "牛": 4,
    "虎": 3,
    "羊": 4,
    "猴": 4,
    "蛇": 2,
    "兔": 2,
    "狗": 3,
    "猪": 2
  },
  "votes6": {
    "龙": 4,
    "鸡": 3,
    "鼠": 2,
    "牛": 3,
    "虎": 3,
    "羊": 3,
    "猴": 3,
    "兔": 1,
    "狗": 1,
    "猪": 1
  }
};