var ensembleData = {
  "time": "2026-09-22 21:32:32",
  "issue": "2026265",
  "code": "05,46,40,23,26,44,49",
  "zodiac": "虎,鸡,兔,猴,蛇,猪,马",
  "wave": "green,red,red,red,blue,green,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026266",
  "ninePool": [
    "蛇",
    "虎",
    "狗",
    "猴",
    "鸡",
    "鼠",
    "羊",
    "马",
    "龙"
  ],
  "sixPool": [
    "蛇",
    "虎",
    "狗",
    "猴",
    "鸡",
    "鼠"
  ],
  "killZodiacs": [
    "马",
    "马"
  ],
  "numbers": [
    2,
    14,
    26,
    38,
    29,
    9,
    33,
    23,
    10,
    22,
    34,
    46,
    19,
    43,
    5,
    17
  ],
  "supplement": [
    5,
    17
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "蛇",
      "虎",
      "狗"
    ],
    "4": [
      "蛇",
      "虎",
      "狗",
      "鼠"
    ],
    "5": [
      "蛇",
      "虎",
      "狗",
      "鼠",
      "猴"
    ],
    "7": [
      "蛇",
      "虎",
      "狗",
      "猴",
      "鸡",
      "鼠",
      "羊"
    ],
    "8": [
      "蛇",
      "虎",
      "狗",
      "猴",
      "鸡",
      "鼠",
      "羊",
      "马"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 60.0,
  "votes": {
    "蛇": 4.5,
    "马": 2.0,
    "羊": 2.0,
    "猴": 3.0,
    "鸡": 3.0,
    "狗": 3.5,
    "猪": 2.0,
    "鼠": 3.0,
    "牛": 2.0,
    "虎": 3.5,
    "龙": 2.0,
    "兔": 1.0
  }
};