var ensembleData = {
  "time": "2026-06-22 21:32:32",
  "issue": "2026173",
  "code": "39,06,16,40,13,19,26",
  "zodiac": "龙,牛,兔,兔,马,鼠,蛇",
  "wave": "green,green,green,red,red,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026174",
  "ninePool": [
    "猴",
    "马",
    "鼠",
    "鸡",
    "牛",
    "羊",
    "狗",
    "虎",
    "兔"
  ],
  "sixPool": [
    "猴",
    "马",
    "鼠",
    "鸡",
    "牛",
    "羊"
  ],
  "killZodiacs": [
    "狗",
    "蛇"
  ],
  "numbers": [
    37,
    19,
    6,
    24,
    47,
    35,
    11,
    23,
    25,
    13,
    1,
    43,
    31,
    7,
    34,
    10
  ],
  "supplement": [],
  "optTails": [
    6,
    1,
    8,
    5,
    3,
    7,
    0
  ],
  "pools": {
    "3": [
      "猴",
      "马",
      "鼠"
    ],
    "4": [
      "猴",
      "马",
      "鼠",
      "鸡"
    ],
    "5": [
      "猴",
      "马",
      "鼠",
      "鸡",
      "牛"
    ],
    "7": [
      "猴",
      "马",
      "鼠",
      "鸡",
      "牛",
      "羊",
      "狗"
    ],
    "8": [
      "猴",
      "马",
      "鼠",
      "鸡",
      "牛",
      "羊",
      "狗",
      "虎"
    ]
  },
  "dynamicRate9": 73.07692307692307,
  "dynamicRate6": 61.53846153846154,
  "votes": {
    "马": 4,
    "羊": 3,
    "猴": 4,
    "鸡": 3,
    "狗": 3,
    "猪": 2,
    "鼠": 4,
    "牛": 3,
    "虎": 2,
    "龙": 2,
    "兔": 2,
    "蛇": 1
  }
};