var ensembleData = {
  "time": "2026-09-09 21:32:32",
  "issue": "2026252",
  "code": "33,41,43,13,06,48,22",
  "zodiac": "狗,虎,鼠,马,牛,羊,鸡",
  "wave": "green,blue,green,red,green,blue,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026253",
  "ninePool": [
    "龙",
    "兔",
    "羊",
    "牛",
    "狗",
    "虎",
    "蛇",
    "马",
    "鸡"
  ],
  "sixPool": [
    "龙",
    "兔",
    "羊",
    "牛",
    "狗",
    "虎"
  ],
  "killZodiacs": [
    "猪",
    "鸡"
  ],
  "numbers": [
    21,
    41,
    4,
    24,
    15,
    45,
    5,
    16,
    36,
    6,
    27,
    17,
    28,
    48,
    18,
    39
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "兔",
      "龙"
    ],
    "4": [
      "羊",
      "兔",
      "龙",
      "牛"
    ],
    "5": [
      "羊",
      "兔",
      "龙",
      "牛",
      "狗"
    ],
    "7": [
      "龙",
      "兔",
      "羊",
      "牛",
      "狗",
      "虎",
      "蛇"
    ],
    "8": [
      "龙",
      "兔",
      "羊",
      "牛",
      "狗",
      "虎",
      "蛇",
      "马"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0,
  "votes": {
    "牛": 4.5,
    "虎": 3.0,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 2.0,
    "羊": 4.5,
    "猴": 2.0,
    "鸡": 2.0,
    "猪": 1.0,
    "狗": 3.5,
    "鼠": 1.0
  }
};