var ensembleData = {
  "time": "2026-07-22 21:32:32",
  "issue": "2026203",
  "code": "12,11,31,03,44,37,25",
  "zodiac": "羊,猴,鼠,龙,猪,马,马",
  "wave": "red,green,blue,blue,green,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026204",
  "ninePool": [
    "虎",
    "龙",
    "牛",
    "猴",
    "鼠",
    "鸡",
    "狗",
    "羊",
    "蛇"
  ],
  "sixPool": [
    "虎",
    "龙",
    "牛",
    "猴",
    "鼠",
    "鸡"
  ],
  "killZodiacs": [
    "蛇",
    "马"
  ],
  "numbers": [
    5,
    29,
    41,
    15,
    39,
    6,
    18,
    42,
    11,
    35,
    19,
    31,
    22,
    34,
    46,
    17
  ],
  "supplement": [
    17
  ],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "牛"
    ],
    "4": [
      "龙",
      "虎",
      "牛",
      "猴"
    ],
    "5": [
      "龙",
      "虎",
      "牛",
      "猴",
      "鸡"
    ],
    "7": [
      "虎",
      "龙",
      "牛",
      "猴",
      "鼠",
      "鸡",
      "狗"
    ],
    "8": [
      "虎",
      "龙",
      "牛",
      "猴",
      "鼠",
      "鸡",
      "狗",
      "羊"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "鼠": 2.0,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 2.0,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 2.0,
    "羊": 2.0,
    "猴": 3.0,
    "狗": 2.0,
    "鸡": 2.0,
    "猪": 1.0
  }
};