var ensembleData = {
  "time": "2026-10-17 21:32:32",
  "issue": "2026290",
  "code": "08,09,17,15,07,02,40",
  "zodiac": "猪,狗,虎,龙,鼠,蛇,兔",
  "wave": "red,blue,green,blue,red,red,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026291",
  "ninePool": [
    "羊",
    "兔",
    "狗",
    "牛",
    "鼠",
    "蛇",
    "龙",
    "虎",
    "猴"
  ],
  "sixPool": [
    "羊",
    "兔",
    "狗",
    "牛",
    "鼠",
    "蛇"
  ],
  "killZodiacs": [
    "羊",
    "兔"
  ],
  "numbers": [
    12,
    36,
    16,
    40,
    21,
    33,
    45,
    6,
    30,
    42,
    7,
    31,
    43,
    2,
    26,
    24
  ],
  "supplement": [
    24
  ],
  "optTails": [
    0,
    1,
    2,
    3,
    5,
    6,
    7
  ],
  "pools": {
    "3": [
      "羊",
      "兔",
      "狗"
    ],
    "4": [
      "羊",
      "兔",
      "狗",
      "牛"
    ],
    "5": [
      "羊",
      "兔",
      "狗",
      "牛",
      "鼠"
    ],
    "7": [
      "羊",
      "兔",
      "狗",
      "牛",
      "鼠",
      "蛇",
      "龙"
    ],
    "8": [
      "羊",
      "兔",
      "狗",
      "牛",
      "鼠",
      "蛇",
      "龙",
      "虎"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 46.0,
  "votes": {
    "鼠": 3.0,
    "牛": 3.0,
    "虎": 2.0,
    "兔": 4.5,
    "龙": 3.0,
    "蛇": 3.0,
    "马": 2.0,
    "羊": 4.5,
    "猴": 2.0,
    "狗": 3.5,
    "猪": 1.0
  }
};