var ensembleData = {
  "time": "2026-09-04 21:32:32",
  "issue": "2026247",
  "code": "03,09,43,29,46,04,40",
  "zodiac": "龙,狗,鼠,虎,鸡,兔,兔",
  "wave": "blue,blue,green,red,red,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026248",
  "ninePool": [
    "猪",
    "鼠",
    "狗",
    "龙",
    "兔",
    "马",
    "蛇",
    "牛",
    "鸡"
  ],
  "sixPool": [
    "猪",
    "鼠",
    "狗",
    "龙",
    "兔",
    "马"
  ],
  "killZodiacs": [
    "羊",
    "兔"
  ],
  "numbers": [
    20,
    40,
    31,
    21,
    1,
    32,
    43,
    33,
    3,
    13,
    45,
    15,
    25,
    16,
    7,
    27
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    5,
    6,
    7
  ],
  "pools": {
    "3": [
      "鼠",
      "狗",
      "兔"
    ],
    "4": [
      "鼠",
      "狗",
      "兔",
      "猪"
    ],
    "5": [
      "鼠",
      "狗",
      "兔",
      "猪",
      "龙"
    ],
    "7": [
      "猪",
      "鼠",
      "狗",
      "龙",
      "兔",
      "马",
      "蛇"
    ],
    "8": [
      "猪",
      "鼠",
      "狗",
      "龙",
      "兔",
      "马",
      "蛇",
      "牛"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 62.0,
  "votes": {
    "狗": 4.5,
    "猪": 4.5,
    "鼠": 4.5,
    "牛": 3.0,
    "虎": 1.0,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 3.0,
    "马": 3.5,
    "鸡": 2.0,
    "猴": 1.0
  }
};