var ensembleData = {
  "time": "2026-09-19 21:32:32",
  "issue": "2026262",
  "code": "38,22,33,47,36,07,30",
  "zodiac": "蛇,鸡,狗,猴,羊,鼠,牛",
  "wave": "green,green,green,blue,blue,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026263",
  "ninePool": [
    "猪",
    "兔",
    "虎",
    "牛",
    "猴",
    "狗",
    "鼠",
    "鸡",
    "羊"
  ],
  "sixPool": [
    "猪",
    "虎",
    "兔",
    "牛",
    "猴",
    "狗"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "numbers": [
    20,
    40,
    30,
    32,
    42,
    23,
    33,
    44,
    4,
    16,
    6,
    8,
    28,
    18,
    29,
    9
  ],
  "supplement": [],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "虎",
      "兔",
      "猪"
    ],
    "4": [
      "虎",
      "兔",
      "猪",
      "牛"
    ],
    "5": [
      "虎",
      "兔",
      "猪",
      "牛",
      "狗"
    ],
    "7": [
      "猪",
      "兔",
      "虎",
      "牛",
      "猴",
      "狗",
      "鼠"
    ],
    "8": [
      "猪",
      "兔",
      "虎",
      "牛",
      "猴",
      "狗",
      "鼠",
      "鸡"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 60.0,
  "votes": {
    "羊": 2.0,
    "猴": 3.0,
    "鸡": 2.0,
    "狗": 3.0,
    "猪": 4.5,
    "鼠": 3.0,
    "牛": 4.5,
    "虎": 4.5,
    "兔": 4.5,
    "蛇": 1.0,
    "龙": 1.0
  }
};