var ensembleData = {
  "time": "2026-05-29 21:32:32",
  "issue": "2026149",
  "code": "28,30,44,45,04,20,27",
  "zodiac": "兔,牛,猪,狗,兔,猪,龙",
  "wave": "green,red,green,red,blue,blue,green",
  "teSx": "龙",
  "teWei": 7,
  "nextIssue": "2026150",
  "ninePool": [
    "鸡",
    "蛇",
    "鼠",
    "兔",
    "狗",
    "猴",
    "猪",
    "马",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "兔",
    "狗",
    "鼠",
    "马"
  ],
  "killZodiacs": [
    "狗",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "蛇",
    "鼠",
    "兔",
    "狗",
    "猴",
    "猪",
    "马",
    "羊"
  ],
  "numbers": [
    10,
    2,
    40,
    9,
    7,
    1,
    21,
    31,
    37,
    19,
    22,
    45
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "蛇": [
      2
    ],
    "兔": [
      40
    ],
    "狗": [
      9,
      21,
      45
    ],
    "鼠": [
      7,
      31,
      19
    ],
    "马": [
      1,
      37
    ]
  },
  "top7Tails": [
    0,
    1,
    7,
    9,
    2,
    5,
    6
  ],
  "votes9": {
    "鸡": 4,
    "兔": 4,
    "鼠": 4,
    "马": 2,
    "猴": 4,
    "狗": 4,
    "蛇": 4,
    "羊": 2,
    "猪": 3,
    "虎": 2,
    "牛": 2,
    "龙": 1
  },
  "votes6": {
    "鸡": 4,
    "兔": 3,
    "鼠": 2,
    "马": 2,
    "猴": 2,
    "狗": 3,
    "蛇": 3,
    "虎": 2,
    "羊": 1,
    "猪": 1,
    "牛": 1
  }
};