var ensembleData = {
  "time": "2026-09-27 21:32:32",
  "issue": "2026270",
  "code": "39,34,20,24,17,06,19",
  "zodiac": "龙,鸡,猪,羊,虎,牛,鼠",
  "wave": "green,red,blue,red,green,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026271",
  "ninePool": [
    "虎",
    "龙",
    "蛇",
    "兔",
    "狗",
    "牛",
    "马",
    "鸡",
    "猴"
  ],
  "sixPool": [
    "虎",
    "龙",
    "蛇",
    "兔",
    "狗",
    "牛"
  ],
  "killZodiacs": [
    "马",
    "鼠"
  ],
  "numbers": [
    40,
    30,
    2,
    42,
    3,
    33,
    14,
    4,
    26,
    16,
    6,
    38,
    28,
    18,
    29,
    39
  ],
  "supplement": [],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "狗",
      "虎"
    ],
    "4": [
      "龙",
      "狗",
      "虎",
      "蛇"
    ],
    "5": [
      "龙",
      "狗",
      "虎",
      "蛇",
      "兔"
    ],
    "7": [
      "虎",
      "龙",
      "蛇",
      "兔",
      "狗",
      "牛",
      "马"
    ],
    "8": [
      "虎",
      "龙",
      "蛇",
      "兔",
      "狗",
      "牛",
      "马",
      "鸡"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 60.0,
  "votes": {
    "虎": 4.5,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 4.5,
    "马": 3.5,
    "羊": 1.0,
    "猴": 2.0,
    "鸡": 3.0,
    "狗": 4.5,
    "牛": 3.5,
    "猪": 1.0,
    "鼠": 1.0
  }
};