var ensembleData = {
  "time": "2026-06-07 21:32:32",
  "issue": "2026158",
  "code": "43,48,03,01,12,23,16",
  "zodiac": "鼠,羊,龙,马,羊,猴,兔",
  "wave": "green,blue,blue,red,red,red,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026159",
  "ninePool": [
    "鸡",
    "牛",
    "猴",
    "猪",
    "羊",
    "龙",
    "狗",
    "兔",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猴",
    "猪",
    "羊",
    "龙"
  ],
  "killZodiacs": [
    "蛇",
    "兔"
  ],
  "numbers": [
    11,
    22,
    42,
    32,
    12,
    23,
    3,
    34,
    44,
    24,
    46,
    6,
    36,
    47,
    27,
    18
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "鸡",
      "牛",
      "猴"
    ],
    "4": [
      "鸡",
      "牛",
      "猴",
      "猪"
    ],
    "5": [
      "鸡",
      "牛",
      "猴",
      "猪",
      "羊"
    ],
    "7": [
      "鸡",
      "牛",
      "猴",
      "猪",
      "羊",
      "龙",
      "狗"
    ],
    "8": [
      "鸡",
      "牛",
      "猴",
      "猪",
      "羊",
      "龙",
      "狗",
      "兔"
    ]
  },
  "dynamicRate9": 72.72727272727273,
  "dynamicRate6": 63.63636363636363,
  "votes": {
    "羊": 3,
    "猴": 3,
    "鸡": 4,
    "狗": 3,
    "猪": 3,
    "鼠": 2,
    "牛": 4,
    "虎": 3,
    "兔": 3,
    "蛇": 2,
    "龙": 3,
    "马": 1
  }
};