var ensembleData = {
  "time": "2026-08-24 21:32:32",
  "issue": "2026236",
  "code": "26,35,42,09,14,17,11",
  "zodiac": "蛇,猴,牛,狗,蛇,虎,猴",
  "wave": "blue,red,blue,blue,blue,green,green",
  "teSx": "猴",
  "teWei": 1,
  "nextIssue": "2026237",
  "ninePool": [
    "羊",
    "狗",
    "马",
    "蛇",
    "鸡",
    "鼠",
    "猪",
    "猴",
    "牛"
  ],
  "sixPool": [
    "羊",
    "狗",
    "蛇",
    "马",
    "鸡",
    "鼠"
  ],
  "killZodiacs": [
    "蛇",
    "猴"
  ],
  "numbers": [
    21,
    1,
    31,
    12,
    2,
    22,
    24,
    14,
    34,
    45,
    25,
    36,
    26,
    46,
    48,
    38
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "狗",
      "蛇"
    ],
    "4": [
      "羊",
      "狗",
      "蛇",
      "鸡"
    ],
    "5": [
      "羊",
      "狗",
      "蛇",
      "鸡",
      "鼠"
    ],
    "7": [
      "羊",
      "狗",
      "马",
      "蛇",
      "鸡",
      "鼠",
      "猪"
    ],
    "8": [
      "羊",
      "狗",
      "马",
      "蛇",
      "鸡",
      "鼠",
      "猪",
      "猴"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0,
  "votes": {
    "蛇": 3.0,
    "马": 3.0,
    "羊": 4.5,
    "猴": 2.0,
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 2.0,
    "虎": 1.0,
    "龙": 1.0
  }
};