var ensembleData = {
  "time": "2026-06-02 21:32:32",
  "issue": "2026153",
  "code": "01,38,33,28,06,40,41",
  "zodiac": "马,蛇,狗,兔,牛,兔,虎",
  "wave": "red,green,green,green,green,red,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026154",
  "ninePool": [
    "鸡",
    "蛇",
    "兔",
    "龙",
    "马",
    "猪",
    "猴",
    "羊",
    "狗"
  ],
  "sixPool": [
    "马",
    "鸡",
    "蛇",
    "兔",
    "猪",
    "龙"
  ],
  "killZodiacs": [
    "虎",
    "虎"
  ],
  "rangeZodiacs": [
    "鸡",
    "蛇",
    "兔",
    "龙",
    "马",
    "猪",
    "猴",
    "羊",
    "狗"
  ],
  "numbers": [
    1,
    10,
    26,
    16,
    20,
    27,
    40,
    46,
    22,
    2,
    32,
    34
  ],
  "zodiacNumMap": {
    "马": [
      1
    ],
    "鸡": [
      10,
      46,
      22,
      34
    ],
    "蛇": [
      26,
      2
    ],
    "兔": [
      16,
      40
    ],
    "猪": [
      20,
      32
    ],
    "龙": [
      27
    ]
  },
  "top7Tails": [
    0,
    6,
    1,
    2,
    4,
    7,
    8
  ],
  "votes9": {
    "鸡": 4,
    "猪": 3,
    "蛇": 4,
    "猴": 3,
    "龙": 4,
    "马": 4,
    "兔": 4,
    "牛": 2,
    "羊": 3,
    "狗": 2,
    "虎": 2,
    "鼠": 1
  },
  "votes6": {
    "鸡": 3,
    "猪": 3,
    "蛇": 3,
    "猴": 3,
    "龙": 3,
    "马": 4,
    "兔": 3,
    "虎": 1,
    "狗": 1
  }
};