var ensembleData = {
  "time": "2026-06-23 21:32:32",
  "issue": "2026174",
  "code": "15,08,34,13,28,21,41",
  "zodiac": "龙,猪,鸡,马,兔,狗,虎",
  "wave": "blue,red,red,red,green,green,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026175",
  "ninePool": [
    "鸡",
    "马",
    "狗",
    "猴",
    "龙",
    "蛇",
    "羊",
    "兔",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "马",
    "狗",
    "猴",
    "龙",
    "蛇"
  ],
  "killZodiacs": [
    "猴",
    "虎"
  ],
  "numbers": [
    3,
    21,
    15,
    26,
    34,
    10,
    22,
    46,
    25,
    13,
    1,
    37,
    33,
    9,
    45,
    47
  ],
  "supplement": [],
  "optTails": [
    6,
    1,
    4,
    8,
    5,
    3,
    7
  ],
  "pools": {
    "3": [
      "鸡",
      "马",
      "狗"
    ],
    "4": [
      "鸡",
      "马",
      "狗",
      "猴"
    ],
    "5": [
      "鸡",
      "马",
      "狗",
      "猴",
      "龙"
    ],
    "7": [
      "鸡",
      "马",
      "狗",
      "猴",
      "龙",
      "蛇",
      "羊"
    ],
    "8": [
      "鸡",
      "马",
      "狗",
      "猴",
      "龙",
      "蛇",
      "羊",
      "兔"
    ]
  },
  "dynamicRate9": 74.07407407407408,
  "dynamicRate6": 62.96296296296296,
  "votes": {
    "兔": 3,
    "龙": 3,
    "蛇": 3,
    "马": 4,
    "羊": 3,
    "猴": 3,
    "鸡": 4,
    "狗": 4,
    "猪": 2,
    "牛": 1,
    "鼠": 1
  }
};