var ensembleData = {
  "time": "2026-09-11 21:32:32",
  "issue": "2026254",
  "code": "26,44,35,06,16,10,02",
  "zodiac": "蛇,猪,猴,牛,兔,鸡,蛇",
  "wave": "blue,green,red,green,green,blue,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026255",
  "ninePool": [
    "马",
    "猴",
    "狗",
    "鸡",
    "鼠",
    "猪",
    "羊",
    "虎",
    "蛇"
  ],
  "sixPool": [
    "马",
    "猴",
    "狗",
    "鸡",
    "鼠",
    "猪"
  ],
  "killZodiacs": [
    "猴",
    "蛇"
  ],
  "numbers": [
    1,
    11,
    21,
    31,
    13,
    23,
    33,
    43,
    34,
    44,
    25,
    35,
    45,
    46,
    37,
    47
  ],
  "supplement": [],
  "optTails": [
    1,
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "鸡",
      "马"
    ],
    "4": [
      "猴",
      "鸡",
      "马",
      "狗"
    ],
    "5": [
      "猴",
      "鸡",
      "马",
      "狗",
      "鼠"
    ],
    "7": [
      "马",
      "猴",
      "狗",
      "鸡",
      "鼠",
      "猪",
      "羊"
    ],
    "8": [
      "马",
      "猴",
      "狗",
      "鸡",
      "鼠",
      "猪",
      "羊",
      "虎"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 66.0,
  "votes": {
    "兔": 1.0,
    "龙": 2.0,
    "蛇": 2.0,
    "马": 4.5,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 4.5,
    "狗": 4.5,
    "猪": 3.5,
    "虎": 2.5,
    "鼠": 3.5,
    "牛": 2.0
  }
};