var ensembleData = {
  "time": "2026-09-13 21:32:32",
  "issue": "2026256",
  "code": "40,15,09,37,07,03,01",
  "zodiac": "兔,龙,狗,马,鼠,龙,马",
  "wave": "red,blue,blue,blue,red,blue,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026257",
  "ninePool": [
    "龙",
    "蛇",
    "牛",
    "兔",
    "鼠",
    "虎",
    "猴",
    "羊",
    "马"
  ],
  "sixPool": [
    "龙",
    "蛇",
    "牛",
    "兔",
    "鼠",
    "猴"
  ],
  "killZodiacs": [
    "牛",
    "马"
  ],
  "numbers": [
    30,
    40,
    31,
    11,
    2,
    42,
    3,
    43,
    23,
    14,
    4,
    15,
    35,
    26,
    6,
    16
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    5,
    6
  ],
  "pools": {
    "3": [
      "龙",
      "蛇",
      "牛"
    ],
    "4": [
      "龙",
      "蛇",
      "牛",
      "兔"
    ],
    "5": [
      "龙",
      "蛇",
      "牛",
      "兔",
      "羊"
    ],
    "7": [
      "龙",
      "蛇",
      "牛",
      "兔",
      "鼠",
      "虎",
      "猴"
    ],
    "8": [
      "龙",
      "蛇",
      "牛",
      "兔",
      "鼠",
      "虎",
      "猴",
      "羊"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 66.0,
  "votes": {
    "鼠": 3.0,
    "牛": 3.5,
    "虎": 3.0,
    "兔": 3.5,
    "龙": 4.5,
    "蛇": 4.5,
    "马": 2.0,
    "羊": 3.0,
    "猴": 3.0,
    "猪": 1.0,
    "狗": 1.0,
    "鸡": 1.0
  }
};