var ensembleData = {
  "time": "2026-08-14 21:32:32",
  "issue": "2026226",
  "code": "01,11,29,38,04,33,17",
  "zodiac": "马,猴,虎,蛇,兔,狗,虎",
  "wave": "red,green,red,green,blue,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026227",
  "ninePool": [
    "龙",
    "兔",
    "鸡",
    "蛇",
    "狗",
    "马",
    "猴",
    "羊",
    "猪"
  ],
  "sixPool": [
    "龙",
    "兔",
    "鸡",
    "蛇",
    "狗",
    "马"
  ],
  "killZodiacs": [
    "蛇",
    "虎"
  ],
  "numbers": [
    21,
    1,
    22,
    2,
    4,
    34,
    14,
    15,
    45,
    25,
    16,
    46,
    26,
    28,
    38,
    39
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "兔",
      "狗"
    ],
    "4": [
      "龙",
      "兔",
      "狗",
      "鸡"
    ],
    "5": [
      "龙",
      "兔",
      "狗",
      "鸡",
      "蛇"
    ],
    "7": [
      "龙",
      "兔",
      "鸡",
      "蛇",
      "狗",
      "马",
      "猴"
    ],
    "8": [
      "龙",
      "兔",
      "鸡",
      "蛇",
      "狗",
      "马",
      "猴",
      "羊"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 4.5,
    "马": 3.0,
    "羊": 2.0,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 4.5,
    "猪": 2.0,
    "虎": 2.0
  }
};