var ensembleData = {
  "time": "2026-07-16 21:32:32",
  "issue": "2026197",
  "code": "40,19,30,48,44,28,08",
  "zodiac": "兔,鼠,牛,羊,猪,兔,猪",
  "wave": "red,red,red,blue,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026198",
  "ninePool": [
    "牛",
    "兔",
    "龙",
    "鼠",
    "猴",
    "羊",
    "蛇",
    "鸡",
    "虎"
  ],
  "sixPool": [
    "牛",
    "兔",
    "龙",
    "鼠",
    "猴",
    "羊"
  ],
  "killZodiacs": [
    "鸡",
    "猪"
  ],
  "numbers": [
    30,
    40,
    31,
    11,
    3,
    43,
    23,
    4,
    24,
    6,
    16,
    36,
    27,
    7,
    47,
    39
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "牛",
      "兔",
      "龙"
    ],
    "4": [
      "牛",
      "兔",
      "龙",
      "鼠"
    ],
    "5": [
      "牛",
      "兔",
      "龙",
      "鼠",
      "猴"
    ],
    "7": [
      "牛",
      "兔",
      "龙",
      "鼠",
      "猴",
      "羊",
      "蛇"
    ],
    "8": [
      "牛",
      "兔",
      "龙",
      "鼠",
      "猴",
      "羊",
      "蛇",
      "鸡"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0,
  "votes": {
    "鼠": 3,
    "牛": 4,
    "虎": 2,
    "兔": 4,
    "龙": 3,
    "蛇": 3,
    "马": 2,
    "羊": 3,
    "猴": 3,
    "鸡": 2,
    "狗": 1
  }
};