var ensembleData = {
  "time": "2026-06-13 21:32:32",
  "issue": "2026164",
  "code": "46,04,38,12,03,02,21",
  "zodiac": "鸡,兔,蛇,羊,龙,蛇,狗",
  "wave": "red,blue,green,red,blue,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026165",
  "ninePool": [
    "鸡",
    "羊",
    "龙",
    "牛",
    "蛇",
    "猴",
    "鼠",
    "马",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "龙",
    "牛",
    "蛇",
    "猴"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "numbers": [
    39,
    2,
    34,
    10,
    22,
    46,
    36,
    12,
    24,
    48,
    15,
    3,
    27,
    18,
    6,
    30
  ],
  "supplement": [],
  "optTails": [
    6,
    1,
    4,
    8,
    3,
    2,
    0
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "龙"
    ],
    "4": [
      "鸡",
      "羊",
      "龙",
      "牛"
    ],
    "5": [
      "鸡",
      "羊",
      "龙",
      "牛",
      "蛇"
    ],
    "7": [
      "鸡",
      "羊",
      "龙",
      "牛",
      "蛇",
      "猴",
      "鼠"
    ],
    "8": [
      "鸡",
      "羊",
      "龙",
      "牛",
      "蛇",
      "猴",
      "鼠",
      "马"
    ]
  },
  "dynamicRate9": 76.47058823529412,
  "dynamicRate6": 64.70588235294117,
  "votes": {
    "龙": 3,
    "蛇": 3,
    "马": 2,
    "羊": 4,
    "猴": 3,
    "鸡": 4,
    "狗": 2,
    "猪": 2,
    "鼠": 3,
    "牛": 3,
    "虎": 2,
    "兔": 2
  }
};