var ensembleData = {
  "time": "2026-06-26 21:32:32",
  "issue": "2026177",
  "code": "19,21,05,01,02,44,14",
  "zodiac": "鼠,狗,虎,马,蛇,猪,蛇",
  "wave": "red,green,green,red,red,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026178",
  "ninePool": [
    "牛",
    "马",
    "猴",
    "羊",
    "狗",
    "蛇",
    "兔",
    "鸡",
    "鼠"
  ],
  "sixPool": [
    "牛",
    "马",
    "猴",
    "羊",
    "狗",
    "蛇"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "numbers": [
    30,
    1,
    11,
    21,
    42,
    12,
    2,
    13,
    23,
    33,
    25,
    35,
    45,
    6,
    36,
    26
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    5,
    6,
    7
  ],
  "pools": {
    "3": [
      "牛",
      "马",
      "猴"
    ],
    "4": [
      "牛",
      "马",
      "猴",
      "羊"
    ],
    "5": [
      "牛",
      "马",
      "猴",
      "羊",
      "狗"
    ],
    "7": [
      "牛",
      "马",
      "猴",
      "羊",
      "狗",
      "蛇",
      "兔"
    ],
    "8": [
      "牛",
      "马",
      "猴",
      "羊",
      "狗",
      "蛇",
      "兔",
      "鸡"
    ]
  },
  "dynamicRate9": 76.66666666666667,
  "dynamicRate6": 63.33333333333333,
  "votes": {
    "蛇": 2,
    "马": 3,
    "羊": 3,
    "猴": 3,
    "鸡": 2,
    "狗": 3,
    "猪": 2,
    "鼠": 2,
    "牛": 4,
    "龙": 2,
    "兔": 2,
    "虎": 1
  }
};