var ensembleData = {
  "time": "2026-10-02 21:32:32",
  "issue": "2026275",
  "code": "42,49,04,47,14,43,17",
  "zodiac": "牛,马,兔,猴,蛇,鼠,虎",
  "wave": "blue,green,blue,blue,blue,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026276",
  "ninePool": [
    "羊",
    "蛇",
    "狗",
    "猪",
    "猴",
    "马",
    "鸡",
    "龙",
    "鼠"
  ],
  "sixPool": [
    "羊",
    "蛇",
    "狗",
    "猪",
    "猴",
    "鸡"
  ],
  "killZodiacs": [
    "龙",
    "虎"
  ],
  "numbers": [
    20,
    10,
    21,
    11,
    12,
    2,
    32,
    22,
    33,
    23,
    24,
    14,
    44,
    34,
    47,
    48
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "狗",
      "羊"
    ],
    "4": [
      "蛇",
      "狗",
      "羊",
      "猪"
    ],
    "5": [
      "蛇",
      "狗",
      "羊",
      "猪",
      "鸡"
    ],
    "7": [
      "羊",
      "蛇",
      "狗",
      "猪",
      "猴",
      "马",
      "鸡"
    ],
    "8": [
      "羊",
      "蛇",
      "狗",
      "猪",
      "猴",
      "马",
      "鸡",
      "龙"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 60.0,
  "votes": {
    "蛇": 4.5,
    "马": 3.0,
    "羊": 4.5,
    "猴": 3.0,
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 4.5,
    "鼠": 1.0,
    "牛": 1.0,
    "龙": 2.0,
    "兔": 1.0,
    "虎": 1.0
  }
};