var ensembleData = {
  "time": "2026-07-20 21:32:32",
  "issue": "2026201",
  "code": "46,28,19,38,31,25,32",
  "zodiac": "鸡,兔,鼠,蛇,鼠,马,猪",
  "wave": "red,green,red,green,blue,blue,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026202",
  "ninePool": [
    "虎",
    "猴",
    "鼠",
    "鸡",
    "牛",
    "蛇",
    "兔",
    "马",
    "龙"
  ],
  "sixPool": [
    "虎",
    "猴",
    "鼠",
    "鸡",
    "牛",
    "蛇"
  ],
  "killZodiacs": [
    "鼠",
    "猪"
  ],
  "numbers": [
    10,
    30,
    41,
    11,
    31,
    22,
    42,
    2,
    23,
    43,
    34,
    14,
    46,
    6,
    26,
    18
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "虎",
      "鼠"
    ],
    "4": [
      "猴",
      "虎",
      "鼠",
      "鸡"
    ],
    "5": [
      "猴",
      "虎",
      "鼠",
      "鸡",
      "牛"
    ],
    "7": [
      "虎",
      "猴",
      "鼠",
      "鸡",
      "牛",
      "蛇",
      "兔"
    ],
    "8": [
      "虎",
      "猴",
      "鼠",
      "鸡",
      "牛",
      "蛇",
      "兔",
      "马"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "鼠": 4.5,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 3.0,
    "龙": 2.0,
    "蛇": 3.0,
    "马": 3.0,
    "羊": 2.0,
    "猴": 4.5,
    "鸡": 3.5
  }
};