var ensembleData = {
  "time": "2026-06-15 21:32:32",
  "issue": "2026166",
  "code": "20,15,01,04,21,28,06",
  "zodiac": "猪,龙,马,兔,狗,兔,牛",
  "wave": "blue,blue,red,blue,green,green,green",
  "teSx": "牛",
  "teWei": 6,
  "nextIssue": "2026167",
  "ninePool": [
    "鼠",
    "猪",
    "马",
    "羊",
    "兔",
    "虎",
    "蛇",
    "鸡",
    "猴"
  ],
  "sixPool": [
    "鼠",
    "猪",
    "马",
    "羊",
    "兔",
    "虎"
  ],
  "killZodiacs": [
    "牛",
    "牛"
  ],
  "numbers": [
    8,
    32,
    1,
    37,
    40,
    16,
    19,
    43,
    31,
    7,
    20,
    44,
    25,
    13,
    36,
    12
  ],
  "supplement": [],
  "optTails": [
    6,
    1,
    4,
    5,
    3,
    2,
    0
  ],
  "pools": {
    "3": [
      "鼠",
      "猪",
      "马"
    ],
    "4": [
      "鼠",
      "猪",
      "马",
      "羊"
    ],
    "5": [
      "鼠",
      "猪",
      "马",
      "羊",
      "兔"
    ],
    "7": [
      "鼠",
      "猪",
      "马",
      "羊",
      "兔",
      "虎",
      "蛇"
    ],
    "8": [
      "鼠",
      "猪",
      "马",
      "羊",
      "兔",
      "虎",
      "蛇",
      "鸡"
    ]
  },
  "dynamicRate9": 73.68421052631578,
  "dynamicRate6": 63.1578947368421,
  "votes": {
    "狗": 2,
    "猪": 4,
    "鼠": 4,
    "牛": 1,
    "虎": 3,
    "兔": 3,
    "龙": 1,
    "蛇": 3,
    "马": 4,
    "鸡": 2,
    "猴": 2,
    "羊": 3
  }
};