var ensembleData = {
  "time": "2026-09-26 21:32:32",
  "issue": "2026269",
  "code": "19,40,36,05,38,16,22",
  "zodiac": "鼠,兔,羊,虎,蛇,兔,鸡",
  "wave": "red,red,blue,green,green,green,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026270",
  "ninePool": [
    "狗",
    "马",
    "鸡",
    "牛",
    "羊",
    "猴",
    "猪",
    "蛇",
    "龙"
  ],
  "sixPool": [
    "狗",
    "马",
    "鸡",
    "牛",
    "羊",
    "猴"
  ],
  "killZodiacs": [
    "鼠",
    "鸡"
  ],
  "numbers": [
    10,
    30,
    21,
    1,
    11,
    22,
    42,
    12,
    33,
    13,
    23,
    34,
    24,
    46,
    6,
    36
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "狗",
      "马",
      "鸡"
    ],
    "4": [
      "狗",
      "马",
      "鸡",
      "牛"
    ],
    "5": [
      "狗",
      "马",
      "鸡",
      "牛",
      "猴"
    ],
    "7": [
      "狗",
      "马",
      "鸡",
      "牛",
      "羊",
      "猴",
      "猪"
    ],
    "8": [
      "狗",
      "马",
      "鸡",
      "牛",
      "羊",
      "猴",
      "猪",
      "蛇"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 60.0,
  "votes": {
    "蛇": 2.0,
    "马": 4.5,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 4.5,
    "猪": 3.0,
    "鼠": 2.0,
    "牛": 3.5,
    "龙": 2.0,
    "虎": 1.0
  }
};