var ensembleData = {
  "time": "2026-08-21 21:32:32",
  "issue": "2026233",
  "code": "18,41,05,49,04,34,07",
  "zodiac": "牛,虎,虎,马,兔,鸡,鼠",
  "wave": "red,blue,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026234",
  "ninePool": [
    "龙",
    "鸡",
    "马",
    "狗",
    "蛇",
    "羊",
    "猴",
    "虎",
    "兔"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "马",
    "狗",
    "蛇",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "numbers": [
    1,
    21,
    34,
    14,
    24,
    15,
    25,
    45,
    46,
    26,
    36,
    27,
    37,
    38,
    48,
    39
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "狗",
      "马"
    ],
    "4": [
      "龙",
      "狗",
      "马",
      "鸡"
    ],
    "5": [
      "龙",
      "狗",
      "马",
      "鸡",
      "羊"
    ],
    "7": [
      "龙",
      "鸡",
      "马",
      "狗",
      "蛇",
      "羊",
      "猴"
    ],
    "8": [
      "龙",
      "鸡",
      "马",
      "狗",
      "蛇",
      "羊",
      "猴",
      "虎"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "兔": 2.0,
    "龙": 4.5,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 4.5,
    "猪": 1.0,
    "牛": 1.0,
    "虎": 2.0
  }
};