var ensembleData = {
  "time": "2026-09-06 21:32:32",
  "issue": "2026249",
  "code": "41,22,13,36,26,29,23",
  "zodiac": "虎,鸡,马,羊,蛇,虎,猴",
  "wave": "blue,green,red,blue,blue,red,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026250",
  "ninePool": [
    "猴",
    "龙",
    "蛇",
    "马",
    "狗",
    "猪",
    "鼠",
    "兔",
    "羊"
  ],
  "sixPool": [
    "猴",
    "龙",
    "蛇",
    "马",
    "狗",
    "猪"
  ],
  "killZodiacs": [
    "马",
    "猴"
  ],
  "numbers": [
    23,
    3,
    39,
    2,
    14,
    26,
    38,
    13,
    9,
    33,
    8,
    20,
    32,
    44,
    11,
    35
  ],
  "supplement": [
    11,
    35
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "猴",
      "龙",
      "狗"
    ],
    "4": [
      "猴",
      "龙",
      "狗",
      "猪"
    ],
    "5": [
      "猴",
      "龙",
      "狗",
      "猪",
      "鼠"
    ],
    "7": [
      "猴",
      "龙",
      "蛇",
      "马",
      "狗",
      "猪",
      "鼠"
    ],
    "8": [
      "猴",
      "龙",
      "蛇",
      "马",
      "狗",
      "猪",
      "鼠",
      "兔"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0,
  "votes": {
    "蛇": 3.0,
    "马": 3.0,
    "羊": 2.0,
    "猴": 4.5,
    "鸡": 2.0,
    "狗": 3.0,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 2.0,
    "龙": 3.5,
    "兔": 2.5
  }
};