var ensembleData = {
  "time": "2026-09-14 21:32:32",
  "issue": "2026257",
  "code": "08,46,47,39,27,45,07",
  "zodiac": "猪,鸡,猴,龙,龙,狗,鼠",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026258",
  "ninePool": [
    "狗",
    "蛇",
    "马",
    "牛",
    "兔",
    "龙",
    "鼠",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "狗",
    "蛇",
    "马",
    "牛",
    "兔",
    "龙"
  ],
  "killZodiacs": [
    "马",
    "鼠"
  ],
  "numbers": [
    30,
    40,
    2,
    42,
    33,
    13,
    3,
    14,
    4,
    26,
    6,
    16,
    38,
    18,
    28,
    9
  ],
  "supplement": [],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "狗",
      "蛇",
      "马"
    ],
    "4": [
      "狗",
      "蛇",
      "马",
      "牛"
    ],
    "5": [
      "狗",
      "蛇",
      "马",
      "牛",
      "兔"
    ],
    "7": [
      "狗",
      "蛇",
      "马",
      "牛",
      "兔",
      "龙",
      "鼠"
    ],
    "8": [
      "狗",
      "蛇",
      "马",
      "牛",
      "兔",
      "龙",
      "鼠",
      "鸡"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 64.0,
  "votes": {
    "龙": 3.0,
    "蛇": 4.5,
    "马": 3.5,
    "羊": 1.0,
    "猴": 2.0,
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 2.0,
    "鼠": 3.0,
    "兔": 3.5,
    "牛": 3.5,
    "虎": 1.0
  }
};