var ensembleData = {
  "time": "2026-09-17 21:32:32",
  "issue": "2026260",
  "code": "25,26,44,32,06,48,20",
  "zodiac": "马,蛇,猪,猪,牛,羊,猪",
  "wave": "blue,blue,green,green,green,blue,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026261",
  "ninePool": [
    "虎",
    "猴",
    "鸡",
    "狗",
    "蛇",
    "牛",
    "羊",
    "猪",
    "龙"
  ],
  "sixPool": [
    "猴",
    "虎",
    "鸡",
    "狗",
    "蛇",
    "牛"
  ],
  "killZodiacs": [
    "虎",
    "猪"
  ],
  "numbers": [
    11,
    41,
    21,
    22,
    2,
    42,
    23,
    33,
    34,
    14,
    46,
    26,
    6,
    47,
    17,
    38
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "鸡",
      "猴"
    ],
    "4": [
      "虎",
      "鸡",
      "猴",
      "狗"
    ],
    "5": [
      "虎",
      "鸡",
      "猴",
      "狗",
      "蛇"
    ],
    "7": [
      "虎",
      "猴",
      "鸡",
      "狗",
      "蛇",
      "牛",
      "羊"
    ],
    "8": [
      "虎",
      "猴",
      "鸡",
      "狗",
      "蛇",
      "牛",
      "羊",
      "猪"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 64.0,
  "votes": {
    "牛": 3.0,
    "虎": 4.5,
    "兔": 1.0,
    "龙": 2.0,
    "蛇": 3.5,
    "马": 2.0,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 4.5,
    "狗": 3.5,
    "猪": 2.0,
    "鼠": 1.0
  }
};