var ensembleData = {
  "time": "2026-07-23 21:32:32",
  "issue": "2026204",
  "code": "11,12,17,26,10,07,05",
  "zodiac": "猴,羊,虎,蛇,鸡,鼠,虎",
  "wave": "green,red,green,blue,blue,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026205",
  "ninePool": [
    "狗",
    "龙",
    "兔",
    "虎",
    "鸡",
    "蛇",
    "马",
    "猴",
    "牛"
  ],
  "sixPool": [
    "狗",
    "龙",
    "兔",
    "虎",
    "鸡",
    "蛇"
  ],
  "killZodiacs": [
    "龙",
    "虎"
  ],
  "numbers": [
    21,
    41,
    22,
    2,
    33,
    3,
    4,
    34,
    14,
    16,
    46,
    26,
    27,
    17,
    28,
    38
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "狗",
      "龙",
      "兔"
    ],
    "4": [
      "狗",
      "龙",
      "兔",
      "虎"
    ],
    "5": [
      "狗",
      "龙",
      "兔",
      "虎",
      "蛇"
    ],
    "7": [
      "狗",
      "龙",
      "兔",
      "虎",
      "鸡",
      "蛇",
      "马"
    ],
    "8": [
      "狗",
      "龙",
      "兔",
      "虎",
      "鸡",
      "蛇",
      "马",
      "猴"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 1.0,
    "鼠": 1.0,
    "牛": 2.0,
    "虎": 4.5,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 3.0,
    "马": 2.0,
    "猴": 2.0,
    "羊": 1.0
  }
};