var ensembleData = {
  "time": "2026-10-19 21:32:32",
  "issue": "2026292",
  "code": "39,10,18,23,16,04,36",
  "zodiac": "龙,鸡,牛,猴,兔,兔,羊",
  "wave": "green,blue,red,red,green,blue,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026293",
  "ninePool": [
    "猴",
    "兔",
    "牛",
    "鼠",
    "羊",
    "龙",
    "蛇",
    "鸡",
    "马"
  ],
  "sixPool": [
    "猴",
    "兔",
    "牛",
    "鼠",
    "羊",
    "龙"
  ],
  "killZodiacs": [
    "马",
    "羊"
  ],
  "numbers": [
    40,
    30,
    42,
    12,
    23,
    43,
    3,
    4,
    24,
    16,
    6,
    36,
    28,
    18,
    48,
    19
  ],
  "supplement": [],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "猴",
      "兔",
      "牛"
    ],
    "4": [
      "猴",
      "兔",
      "牛",
      "鼠"
    ],
    "5": [
      "猴",
      "兔",
      "牛",
      "鼠",
      "羊"
    ],
    "7": [
      "猴",
      "兔",
      "牛",
      "鼠",
      "羊",
      "龙",
      "蛇"
    ],
    "8": [
      "猴",
      "兔",
      "牛",
      "鼠",
      "羊",
      "龙",
      "蛇",
      "鸡"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 46.0,
  "votes": {
    "兔": 4.5,
    "龙": 3.0,
    "蛇": 3.0,
    "马": 2.0,
    "羊": 3.5,
    "猴": 4.5,
    "鸡": 2.0,
    "狗": 2.0,
    "猪": 2.0,
    "牛": 3.5,
    "鼠": 3.5,
    "虎": 1.0
  }
};