var ensembleData = {
  "time": "2026-10-11 21:32:32",
  "issue": "2026284",
  "code": "04,35,22,48,03,18,32",
  "zodiac": "兔,猴,鸡,羊,龙,牛,猪",
  "wave": "blue,red,green,blue,blue,red,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026285",
  "ninePool": [
    "羊",
    "马",
    "蛇",
    "猴",
    "鸡",
    "狗",
    "鼠",
    "牛",
    "兔"
  ],
  "sixPool": [
    "羊",
    "马",
    "蛇",
    "猴",
    "鸡",
    "狗"
  ],
  "killZodiacs": [
    "蛇",
    "猪"
  ],
  "numbers": [
    1,
    11,
    21,
    12,
    2,
    22,
    24,
    14,
    34,
    25,
    35,
    45,
    36,
    26,
    46,
    48
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "马",
      "蛇"
    ],
    "4": [
      "羊",
      "马",
      "蛇",
      "猴"
    ],
    "5": [
      "羊",
      "马",
      "蛇",
      "猴",
      "狗"
    ],
    "7": [
      "羊",
      "马",
      "蛇",
      "猴",
      "鸡",
      "狗",
      "鼠"
    ],
    "8": [
      "羊",
      "马",
      "蛇",
      "猴",
      "鸡",
      "狗",
      "鼠",
      "牛"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 52.0,
  "votes": {
    "龙": 1.0,
    "蛇": 4.5,
    "马": 4.5,
    "羊": 4.5,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 2.0,
    "鼠": 3.0,
    "兔": 2.0,
    "牛": 2.5
  }
};