var ensembleData = {
  "time": "2026-08-18 21:32:32",
  "issue": "2026230",
  "code": "28,26,47,14,49,10,16",
  "zodiac": "兔,蛇,猴,蛇,马,鸡,兔",
  "wave": "green,blue,blue,blue,green,blue,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026231",
  "ninePool": [
    "蛇",
    "鸡",
    "猪",
    "羊",
    "狗",
    "牛",
    "鼠",
    "猴",
    "兔"
  ],
  "sixPool": [
    "蛇",
    "鸡",
    "猪",
    "羊",
    "狗",
    "牛"
  ],
  "killZodiacs": [
    "虎",
    "兔"
  ],
  "numbers": [
    21,
    2,
    22,
    32,
    12,
    42,
    33,
    14,
    34,
    44,
    24,
    26,
    46,
    36,
    6,
    38
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "鸡",
      "猪"
    ],
    "4": [
      "蛇",
      "鸡",
      "猪",
      "牛"
    ],
    "5": [
      "蛇",
      "鸡",
      "猪",
      "牛",
      "狗"
    ],
    "7": [
      "蛇",
      "鸡",
      "猪",
      "羊",
      "狗",
      "牛",
      "鼠"
    ],
    "8": [
      "蛇",
      "鸡",
      "猪",
      "羊",
      "狗",
      "牛",
      "鼠",
      "猴"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "羊": 3.0,
    "猴": 2.0,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 3.0,
    "鼠": 2.0,
    "牛": 3.0,
    "虎": 1.0,
    "兔": 2.0,
    "龙": 1.0,
    "马": 2.0,
    "蛇": 3.5
  }
};