var ensembleData = {
  "time": "2026-07-25 21:32:32",
  "issue": "2026206",
  "code": "09,49,37,03,40,35,47",
  "zodiac": "狗,马,马,龙,兔,猴,猴",
  "wave": "blue,green,blue,blue,red,red,blue",
  "teSx": "猴",
  "teWei": 7,
  "nextIssue": "2026207",
  "ninePool": [
    "兔",
    "龙",
    "蛇",
    "猴",
    "狗",
    "鸡",
    "猪",
    "牛",
    "鼠"
  ],
  "sixPool": [
    "兔",
    "龙",
    "蛇",
    "猴",
    "鸡",
    "狗"
  ],
  "killZodiacs": [
    "龙",
    "猴"
  ],
  "numbers": [
    40,
    10,
    11,
    21,
    2,
    22,
    3,
    23,
    33,
    4,
    14,
    34,
    27,
    47,
    28,
    38
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "兔",
      "龙",
      "蛇"
    ],
    "4": [
      "兔",
      "龙",
      "蛇",
      "猴"
    ],
    "5": [
      "兔",
      "龙",
      "蛇",
      "猴",
      "鸡"
    ],
    "7": [
      "兔",
      "龙",
      "蛇",
      "猴",
      "狗",
      "鸡",
      "猪"
    ],
    "8": [
      "兔",
      "龙",
      "蛇",
      "猴",
      "狗",
      "鸡",
      "猪",
      "牛"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 62.0,
  "votes": {
    "兔": 4.5,
    "龙": 3.5,
    "蛇": 3.0,
    "马": 2.0,
    "羊": 2.0,
    "猴": 3.0,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 3.0,
    "牛": 2.5,
    "鼠": 2.0
  }
};