var ensembleData = {
  "time": "2026-09-03 21:32:32",
  "issue": "2026246",
  "code": "22,24,19,10,20,01,30",
  "zodiac": "鸡,羊,鼠,鸡,猪,马,牛",
  "wave": "green,red,red,blue,blue,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026247",
  "ninePool": [
    "猪",
    "鼠",
    "虎",
    "兔",
    "马",
    "牛",
    "猴",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "猪",
    "虎",
    "鼠",
    "兔",
    "马",
    "牛"
  ],
  "killZodiacs": [
    "龙",
    "牛"
  ],
  "numbers": [
    41,
    31,
    1,
    32,
    42,
    43,
    13,
    44,
    4,
    16,
    6,
    17,
    7,
    37,
    8,
    28
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "猪",
      "兔",
      "虎"
    ],
    "4": [
      "猪",
      "兔",
      "虎",
      "鼠"
    ],
    "5": [
      "猪",
      "兔",
      "虎",
      "鼠",
      "马"
    ],
    "7": [
      "猪",
      "鼠",
      "虎",
      "兔",
      "马",
      "牛",
      "猴"
    ],
    "8": [
      "猪",
      "鼠",
      "虎",
      "兔",
      "马",
      "牛",
      "猴",
      "龙"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 62.0,
  "votes": {
    "猪": 4.5,
    "鼠": 3.0,
    "牛": 2.0,
    "虎": 3.0,
    "兔": 3.0,
    "龙": 2.0,
    "蛇": 2.0,
    "马": 3.0,
    "羊": 2.0,
    "猴": 2.0,
    "狗": 1.0,
    "鸡": 1.0
  }
};