var ensembleData = {
  "time": "2026-06-12 21:32:32",
  "issue": "2026163",
  "code": "39,08,10,33,07,41,37",
  "zodiac": "龙,猪,鸡,狗,鼠,虎,马",
  "wave": "green,red,blue,green,red,blue,blue",
  "teSx": "马",
  "teWei": 7,
  "nextIssue": "2026164",
  "ninePool": [
    "猴",
    "羊",
    "龙",
    "虎",
    "兔",
    "马",
    "牛",
    "鸡",
    "鼠"
  ],
  "sixPool": [
    "猴",
    "羊",
    "龙",
    "虎",
    "兔",
    "马"
  ],
  "killZodiacs": [
    "猴",
    "马"
  ],
  "numbers": [
    41,
    39,
    40,
    16,
    1,
    47,
    35,
    11,
    23,
    36,
    12,
    24,
    48,
    15,
    3,
    27
  ],
  "supplement": [],
  "optTails": [
    6,
    1,
    4,
    8,
    5,
    3,
    7
  ],
  "pools": {
    "3": [
      "猴",
      "羊",
      "龙"
    ],
    "4": [
      "猴",
      "羊",
      "龙",
      "虎"
    ],
    "5": [
      "猴",
      "羊",
      "龙",
      "虎",
      "兔"
    ],
    "7": [
      "猴",
      "羊",
      "龙",
      "虎",
      "兔",
      "马",
      "牛"
    ],
    "8": [
      "猴",
      "羊",
      "龙",
      "虎",
      "兔",
      "马",
      "牛",
      "鸡"
    ]
  },
  "dynamicRate9": 75.0,
  "dynamicRate6": 62.5,
  "votes": {
    "鼠": 2,
    "牛": 2,
    "虎": 3,
    "兔": 3,
    "龙": 4,
    "蛇": 2,
    "马": 3,
    "羊": 4,
    "猴": 4,
    "鸡": 2,
    "狗": 2,
    "猪": 1
  }
};