var ensembleData = {
  "time": "2026-07-21 21:32:32",
  "issue": "2026202",
  "code": "21,15,25,47,13,45,40",
  "zodiac": "狗,龙,马,猴,马,狗,兔",
  "wave": "green,blue,blue,blue,red,red,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026203",
  "ninePool": [
    "鸡",
    "羊",
    "猴",
    "猪",
    "牛",
    "鼠",
    "兔",
    "狗",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "猴",
    "猪",
    "牛",
    "鼠"
  ],
  "killZodiacs": [
    "牛",
    "兔"
  ],
  "numbers": [
    10,
    20,
    30,
    11,
    31,
    22,
    12,
    32,
    42,
    23,
    43,
    34,
    24,
    44,
    35,
    46
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    5,
    6
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "牛"
    ],
    "4": [
      "鸡",
      "羊",
      "牛",
      "猴"
    ],
    "5": [
      "鸡",
      "羊",
      "牛",
      "猴",
      "鼠"
    ],
    "7": [
      "鸡",
      "羊",
      "猴",
      "猪",
      "牛",
      "鼠",
      "兔"
    ],
    "8": [
      "鸡",
      "羊",
      "猴",
      "猪",
      "牛",
      "鼠",
      "兔",
      "狗"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "马": 2.0,
    "羊": 4.5,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 2.0,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 3.0,
    "虎": 1.0,
    "蛇": 2.0,
    "兔": 2.5,
    "龙": 1.0
  }
};