var ensembleData = {
  "time": "2026-10-07 21:32:32",
  "issue": "2026280",
  "code": "01,26,28,29,03,05,15",
  "zodiac": "马,蛇,兔,虎,龙,虎,龙",
  "wave": "red,blue,green,red,blue,green,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026281",
  "ninePool": [
    "羊",
    "猴",
    "猪",
    "兔",
    "鼠",
    "虎",
    "马",
    "鸡",
    "龙"
  ],
  "sixPool": [
    "羊",
    "猴",
    "猪",
    "兔",
    "鼠",
    "虎"
  ],
  "killZodiacs": [
    "虎",
    "龙"
  ],
  "numbers": [
    11,
    31,
    41,
    12,
    32,
    23,
    43,
    24,
    44,
    4,
    36,
    16,
    47,
    7,
    17,
    48
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "猴",
      "猪"
    ],
    "4": [
      "羊",
      "猴",
      "猪",
      "鼠"
    ],
    "5": [
      "羊",
      "猴",
      "猪",
      "鼠",
      "兔"
    ],
    "7": [
      "羊",
      "猴",
      "猪",
      "兔",
      "鼠",
      "虎",
      "马"
    ],
    "8": [
      "羊",
      "猴",
      "猪",
      "兔",
      "鼠",
      "虎",
      "马",
      "鸡"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 56.00000000000001,
  "votes": {
    "龙": 2.0,
    "蛇": 1.0,
    "马": 3.0,
    "羊": 4.5,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 2.0,
    "猪": 3.5,
    "鼠": 3.5,
    "兔": 3.5,
    "虎": 3.5,
    "牛": 2.0
  }
};