var ensembleData = {
  "time": "2026-08-28 21:32:32",
  "issue": "2026240",
  "code": "02,34,22,26,28,37,27",
  "zodiac": "蛇,鸡,鸡,蛇,兔,马,龙",
  "wave": "red,red,green,blue,green,blue,green",
  "teSx": "龙",
  "teWei": 7,
  "nextIssue": "2026241",
  "ninePool": [
    "兔",
    "马",
    "龙",
    "鸡",
    "蛇",
    "羊",
    "猴",
    "鼠",
    "猪"
  ],
  "sixPool": [
    "兔",
    "马",
    "龙",
    "鸡",
    "蛇",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "numbers": [
    40,
    10,
    22,
    2,
    12,
    13,
    3,
    4,
    34,
    14,
    24,
    16,
    46,
    26,
    36,
    28
  ],
  "supplement": [],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "兔",
      "龙",
      "马"
    ],
    "4": [
      "兔",
      "龙",
      "马",
      "蛇"
    ],
    "5": [
      "兔",
      "龙",
      "马",
      "蛇",
      "猴"
    ],
    "7": [
      "兔",
      "马",
      "龙",
      "鸡",
      "蛇",
      "羊",
      "猴"
    ],
    "8": [
      "兔",
      "马",
      "龙",
      "鸡",
      "蛇",
      "羊",
      "猴",
      "鼠"
    ]
  },
  "dynamicRate9": 72.0,
  "dynamicRate6": 60.0,
  "votes": {
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 3.0,
    "狗": 1.0,
    "猪": 2.0,
    "鼠": 2.5,
    "牛": 1.0,
    "虎": 1.0
  }
};