var ensembleData = {
  "time": "2026-09-15 21:32:32",
  "issue": "2026258",
  "code": "03,23,21,35,05,19,46",
  "zodiac": "龙,猴,狗,猴,虎,鼠,鸡",
  "wave": "blue,red,green,red,green,red,red",
  "teSx": "鸡",
  "teWei": 6,
  "nextIssue": "2026259",
  "ninePool": [
    "龙",
    "虎",
    "狗",
    "马",
    "牛",
    "猴",
    "猪",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "虎",
    "龙",
    "狗",
    "马",
    "牛",
    "猴"
  ],
  "killZodiacs": [
    "蛇",
    "鸡"
  ],
  "numbers": [
    5,
    29,
    41,
    15,
    39,
    9,
    21,
    45,
    1,
    25,
    6,
    18,
    42,
    11,
    35,
    17
  ],
  "supplement": [
    17
  ],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "虎",
      "龙",
      "狗"
    ],
    "4": [
      "虎",
      "龙",
      "狗",
      "马"
    ],
    "5": [
      "虎",
      "龙",
      "狗",
      "马",
      "猴"
    ],
    "7": [
      "龙",
      "虎",
      "狗",
      "马",
      "牛",
      "猴",
      "猪"
    ],
    "8": [
      "龙",
      "虎",
      "狗",
      "马",
      "牛",
      "猴",
      "猪",
      "兔"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 64.0,
  "votes": {
    "虎": 4.5,
    "兔": 3.0,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 4.5,
    "羊": 1.0,
    "猴": 3.5,
    "鸡": 2.0,
    "狗": 4.5,
    "牛": 3.5,
    "猪": 3.5,
    "鼠": 1.0
  }
};