var ensembleData = {
  "time": "2026-06-28 21:32:32",
  "issue": "2026179",
  "code": "10,11,26,06,31,09,15",
  "zodiac": "鸡,猴,蛇,牛,鼠,狗,龙",
  "wave": "blue,green,blue,green,blue,blue,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026180",
  "ninePool": [
    "猴",
    "鼠",
    "马",
    "虎",
    "兔",
    "羊",
    "狗",
    "龙",
    "鸡"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "马",
    "虎",
    "兔",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "龙"
  ],
  "numbers": [
    11,
    31,
    1,
    41,
    12,
    4,
    24,
    35,
    25,
    5,
    16,
    36,
    28,
    48,
    19,
    29
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "猴",
      "鼠",
      "马"
    ],
    "4": [
      "猴",
      "鼠",
      "马",
      "虎"
    ],
    "5": [
      "猴",
      "鼠",
      "马",
      "虎",
      "兔"
    ],
    "7": [
      "猴",
      "鼠",
      "马",
      "虎",
      "兔",
      "羊",
      "狗"
    ],
    "8": [
      "猴",
      "鼠",
      "马",
      "虎",
      "兔",
      "羊",
      "狗",
      "龙"
    ]
  },
  "dynamicRate9": 75.0,
  "dynamicRate6": 62.5,
  "votes": {
    "鼠": 4,
    "牛": 1,
    "虎": 3,
    "兔": 3,
    "龙": 2,
    "蛇": 1,
    "马": 3,
    "羊": 3,
    "猴": 4,
    "狗": 2,
    "猪": 2,
    "鸡": 2
  }
};