var ensembleData = {
  "time": "2026-08-11 21:32:32",
  "issue": "2026223",
  "code": "21,43,01,38,29,44,23",
  "zodiac": "狗,鼠,马,蛇,虎,猪,猴",
  "wave": "green,green,red,green,red,green,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026224",
  "ninePool": [
    "龙",
    "兔",
    "蛇",
    "羊",
    "牛",
    "虎",
    "猴",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "龙",
    "兔",
    "蛇",
    "羊",
    "牛",
    "虎"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "numbers": [
    3,
    27,
    39,
    4,
    16,
    40,
    14,
    26,
    24,
    36,
    6,
    30,
    17,
    29,
    41,
    15
  ],
  "supplement": [
    15
  ],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "兔",
      "蛇",
      "龙"
    ],
    "4": [
      "兔",
      "蛇",
      "龙",
      "羊"
    ],
    "5": [
      "兔",
      "蛇",
      "龙",
      "羊",
      "牛"
    ],
    "7": [
      "龙",
      "兔",
      "蛇",
      "羊",
      "牛",
      "虎",
      "猴"
    ],
    "8": [
      "龙",
      "兔",
      "蛇",
      "羊",
      "牛",
      "虎",
      "猴",
      "鸡"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "虎": 3.5,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 4.5,
    "马": 1.0,
    "羊": 4.5,
    "猴": 3.5,
    "鸡": 3.0,
    "狗": 2.0,
    "猪": 2.0,
    "牛": 3.5,
    "鼠": 1.0
  }
};