var ensembleData = {
  "time": "2026-06-10 21:32:32",
  "issue": "2026161",
  "code": "36,40,42,19,34,46,08",
  "zodiac": "羊,兔,牛,鼠,鸡,鸡,猪",
  "wave": "blue,red,blue,red,red,red,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026162",
  "ninePool": [
    "鸡",
    "狗",
    "龙",
    "虎",
    "兔",
    "蛇",
    "猴",
    "牛",
    "马"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "龙",
    "虎",
    "兔",
    "蛇"
  ],
  "killZodiacs": [
    "鼠",
    "猪"
  ],
  "numbers": [
    41,
    45,
    39,
    40,
    16,
    2,
    34,
    10,
    22,
    46,
    21,
    33,
    9,
    15,
    3,
    27
  ],
  "supplement": [],
  "optTails": [
    6,
    1,
    4,
    8,
    3,
    2,
    0
  ],
  "pools": {
    "3": [
      "鸡",
      "狗",
      "龙"
    ],
    "4": [
      "鸡",
      "狗",
      "龙",
      "虎"
    ],
    "5": [
      "鸡",
      "狗",
      "龙",
      "虎",
      "兔"
    ],
    "7": [
      "鸡",
      "狗",
      "龙",
      "虎",
      "兔",
      "蛇",
      "猴"
    ],
    "8": [
      "鸡",
      "狗",
      "龙",
      "虎",
      "兔",
      "蛇",
      "猴",
      "牛"
    ]
  },
  "dynamicRate9": 78.57142857142857,
  "dynamicRate6": 64.28571428571429,
  "votes": {
    "鸡": 4,
    "狗": 4,
    "猪": 1,
    "鼠": 2,
    "牛": 2,
    "虎": 3,
    "兔": 3,
    "龙": 3,
    "蛇": 3,
    "猴": 2,
    "羊": 2,
    "马": 2
  }
};