var ensembleData = {
  "time": "2026-07-07 21:32:32",
  "issue": "2026188",
  "code": "38,05,19,10,14,01,16",
  "zodiac": "蛇,虎,鼠,鸡,蛇,马,兔",
  "wave": "green,green,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026189",
  "ninePool": [
    "鸡",
    "蛇",
    "牛",
    "鼠",
    "马",
    "猪",
    "狗",
    "猴",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "牛",
    "鼠",
    "马",
    "猪"
  ],
  "killZodiacs": [
    "猪",
    "兔"
  ],
  "numbers": [
    2,
    38,
    6,
    7,
    42,
    43,
    14,
    18,
    19,
    26,
    30,
    31,
    25,
    34,
    8,
    37
  ],
  "pools": {
    "3": [
      "蛇",
      "牛",
      "鼠"
    ],
    "4": [
      "鸡",
      "蛇",
      "牛",
      "鼠"
    ],
    "5": [
      "鸡",
      "蛇",
      "牛",
      "鼠",
      "马"
    ],
    "7": [
      "鸡",
      "蛇",
      "牛",
      "鼠",
      "马",
      "猪",
      "狗"
    ],
    "8": [
      "鸡",
      "蛇",
      "牛",
      "鼠",
      "马",
      "猪",
      "狗",
      "猴"
    ]
  },
  "dynamicRate9": 80.48780487804879,
  "dynamicRate6": 65.85365853658537,
  "votes": {
    "蛇": 4,
    "鸡": 4,
    "猪": 3,
    "牛": 4,
    "羊": 2,
    "狗": 3,
    "马": 4,
    "猴": 3,
    "鼠": 4,
    "兔": 2,
    "龙": 1
  }
};