var ensembleData = {
  "time": "2026-10-15 21:32:32",
  "issue": "2026288",
  "code": "14,48,05,17,46,21,25",
  "zodiac": "蛇,羊,虎,虎,鸡,狗,马",
  "wave": "blue,blue,green,green,red,green,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026289",
  "ninePool": [
    "狗",
    "虎",
    "牛",
    "鼠",
    "龙",
    "兔",
    "羊",
    "猪",
    "猴"
  ],
  "sixPool": [
    "狗",
    "虎",
    "牛",
    "鼠",
    "龙",
    "兔"
  ],
  "killZodiacs": [
    "蛇",
    "马"
  ],
  "numbers": [
    21,
    33,
    17,
    41,
    6,
    18,
    42,
    7,
    31,
    43,
    3,
    27,
    4,
    16,
    28,
    9
  ],
  "supplement": [
    9
  ],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "狗",
      "虎",
      "牛"
    ],
    "4": [
      "狗",
      "虎",
      "牛",
      "鼠"
    ],
    "5": [
      "狗",
      "虎",
      "牛",
      "鼠",
      "龙"
    ],
    "7": [
      "狗",
      "虎",
      "牛",
      "鼠",
      "龙",
      "兔",
      "羊"
    ],
    "8": [
      "狗",
      "虎",
      "牛",
      "鼠",
      "龙",
      "兔",
      "羊",
      "猪"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 46.0,
  "votes": {
    "狗": 4.5,
    "猪": 2.0,
    "鼠": 4.5,
    "牛": 4.5,
    "虎": 4.5,
    "兔": 3.0,
    "龙": 3.0,
    "蛇": 1.0,
    "马": 2.0,
    "羊": 2.5,
    "猴": 2.0,
    "鸡": 1.0
  }
};