var ensembleData = {
  "time": "2026-08-03 21:32:32",
  "issue": "2026215",
  "code": "19,38,30,13,01,11,14",
  "zodiac": "鼠,蛇,牛,马,马,猴,蛇",
  "wave": "red,green,red,red,red,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026216",
  "ninePool": [
    "虎",
    "猴",
    "龙",
    "牛",
    "鸡",
    "猪",
    "狗",
    "羊",
    "鼠"
  ],
  "sixPool": [
    "虎",
    "猴",
    "龙",
    "牛",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "虎",
    "蛇"
  ],
  "numbers": [
    41,
    11,
    42,
    22,
    32,
    23,
    3,
    34,
    44,
    6,
    46,
    17,
    47,
    27,
    18,
    8
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "猴",
      "龙"
    ],
    "4": [
      "虎",
      "猴",
      "龙",
      "牛"
    ],
    "5": [
      "虎",
      "猴",
      "龙",
      "牛",
      "狗"
    ],
    "7": [
      "虎",
      "猴",
      "龙",
      "牛",
      "鸡",
      "猪",
      "狗"
    ],
    "8": [
      "虎",
      "猴",
      "龙",
      "牛",
      "鸡",
      "猪",
      "狗",
      "羊"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 60.0,
  "votes": {
    "马": 1.0,
    "羊": 2.0,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 3.0,
    "鼠": 2.0,
    "牛": 3.0,
    "虎": 4.5,
    "龙": 3.5,
    "蛇": 1.0,
    "兔": 1.0
  }
};