var ensembleData = {
  "time": "2026-08-02 21:32:32",
  "issue": "2026214",
  "code": "29,30,27,38,43,31,04",
  "zodiac": "虎,牛,龙,蛇,鼠,鼠,兔",
  "wave": "red,red,green,green,green,blue,blue",
  "teSx": "兔",
  "teWei": 4,
  "nextIssue": "2026215",
  "ninePool": [
    "马",
    "牛",
    "猴",
    "鼠",
    "蛇",
    "鸡",
    "羊",
    "龙",
    "猪"
  ],
  "sixPool": [
    "马",
    "牛",
    "猴",
    "鼠",
    "蛇",
    "鸡"
  ],
  "killZodiacs": [
    "狗",
    "兔"
  ],
  "numbers": [
    30,
    10,
    1,
    11,
    31,
    13,
    23,
    43,
    25,
    35,
    6,
    26,
    46,
    37,
    47,
    7
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "马",
      "牛",
      "猴"
    ],
    "4": [
      "马",
      "牛",
      "猴",
      "鼠"
    ],
    "5": [
      "马",
      "牛",
      "猴",
      "鼠",
      "鸡"
    ],
    "7": [
      "马",
      "牛",
      "猴",
      "鼠",
      "蛇",
      "鸡",
      "羊"
    ],
    "8": [
      "马",
      "牛",
      "猴",
      "鼠",
      "蛇",
      "鸡",
      "羊",
      "龙"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "牛": 4.5,
    "虎": 1.0,
    "兔": 1.0,
    "龙": 2.0,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 3.0,
    "鼠": 3.5,
    "猪": 2.0,
    "狗": 1.0
  }
};