var ensembleData = {
  "time": "2026-06-25 21:32:32",
  "issue": "2026176",
  "code": "30,31,02,36,38,15,10",
  "zodiac": "牛,鼠,蛇,羊,蛇,龙,鸡",
  "wave": "red,blue,red,blue,green,blue,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026177",
  "ninePool": [
    "马",
    "猴",
    "羊",
    "狗",
    "牛",
    "鼠",
    "龙",
    "猪",
    "兔"
  ],
  "sixPool": [
    "马",
    "猴",
    "羊",
    "狗",
    "牛",
    "鼠"
  ],
  "killZodiacs": [
    "鸡",
    "鸡"
  ],
  "numbers": [
    30,
    1,
    11,
    21,
    31,
    13,
    23,
    33,
    43,
    24,
    36,
    6,
    37,
    47,
    7,
    9
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "马",
      "猴",
      "羊"
    ],
    "4": [
      "马",
      "猴",
      "羊",
      "狗"
    ],
    "5": [
      "马",
      "猴",
      "羊",
      "狗",
      "牛"
    ],
    "7": [
      "马",
      "猴",
      "羊",
      "狗",
      "牛",
      "鼠",
      "龙"
    ],
    "8": [
      "马",
      "猴",
      "羊",
      "狗",
      "牛",
      "鼠",
      "龙",
      "猪"
    ]
  },
  "dynamicRate9": 76.66666666666667,
  "dynamicRate6": 63.33333333333333,
  "votes": {
    "蛇": 1,
    "马": 4,
    "羊": 4,
    "猴": 4,
    "鸡": 1,
    "狗": 3,
    "猪": 3,
    "鼠": 3,
    "牛": 3,
    "龙": 3,
    "兔": 2,
    "虎": 1
  }
};