var ensembleData = {
  "time": "2026-07-24 21:32:32",
  "issue": "2026205",
  "code": "30,17,39,12,11,28,03",
  "zodiac": "牛,虎,龙,羊,猴,兔,龙",
  "wave": "red,green,green,red,green,green,blue",
  "teSx": "龙",
  "teWei": 3,
  "nextIssue": "2026206",
  "ninePool": [
    "猴",
    "兔",
    "牛",
    "羊",
    "虎",
    "鸡",
    "狗",
    "鼠",
    "马"
  ],
  "sixPool": [
    "猴",
    "兔",
    "牛",
    "羊",
    "虎",
    "鸡"
  ],
  "killZodiacs": [
    "猪",
    "龙"
  ],
  "numbers": [
    11,
    41,
    4,
    24,
    34,
    35,
    5,
    16,
    6,
    36,
    46,
    47,
    17,
    28,
    18,
    48
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "猴",
      "兔",
      "虎"
    ],
    "4": [
      "猴",
      "兔",
      "虎",
      "牛"
    ],
    "5": [
      "猴",
      "兔",
      "虎",
      "牛",
      "羊"
    ],
    "7": [
      "猴",
      "兔",
      "牛",
      "羊",
      "虎",
      "鸡",
      "狗"
    ],
    "8": [
      "猴",
      "兔",
      "牛",
      "羊",
      "虎",
      "鸡",
      "狗",
      "鼠"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 2.0,
    "鼠": 3.0,
    "牛": 3.5,
    "虎": 3.5,
    "兔": 4.5,
    "龙": 1.0,
    "马": 2.0,
    "羊": 3.5,
    "蛇": 1.0
  }
};