var ensembleData = {
  "time": "2026-07-30 21:32:32",
  "issue": "2026211",
  "code": "13,12,39,37,38,08,01",
  "zodiac": "马,羊,龙,马,蛇,猪,马",
  "wave": "red,red,green,blue,green,red,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026212",
  "ninePool": [
    "猴",
    "猪",
    "牛",
    "狗",
    "羊",
    "鸡",
    "鼠",
    "蛇",
    "马"
  ],
  "sixPool": [
    "猴",
    "猪",
    "牛",
    "羊",
    "狗",
    "鸡"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "numbers": [
    11,
    21,
    32,
    42,
    12,
    22,
    23,
    33,
    44,
    24,
    34,
    6,
    36,
    46,
    47,
    8
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "猪",
      "牛"
    ],
    "4": [
      "猴",
      "猪",
      "牛",
      "羊"
    ],
    "5": [
      "猴",
      "猪",
      "牛",
      "羊",
      "鼠"
    ],
    "7": [
      "猴",
      "猪",
      "牛",
      "狗",
      "羊",
      "鸡",
      "鼠"
    ],
    "8": [
      "猴",
      "猪",
      "牛",
      "狗",
      "羊",
      "鸡",
      "鼠",
      "蛇"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "蛇": 2.0,
    "马": 1.0,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 4.5,
    "鼠": 3.0,
    "牛": 3.0,
    "虎": 1.0,
    "兔": 1.0,
    "龙": 1.0
  }
};