var ensembleData = {
  "time": "2026-10-29 21:32:32",
  "issue": "2026302",
  "code": "10,02,14,13,11,12,45",
  "zodiac": "鸡,蛇,蛇,马,猴,羊,狗",
  "wave": "blue,red,blue,red,green,red,red",
  "teSx": "狗",
  "teWei": 5,
  "nextIssue": "2026303",
  "ninePool": [
    "鸡",
    "牛",
    "羊",
    "虎",
    "马",
    "龙",
    "鼠",
    "猴",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "羊",
    "虎",
    "马",
    "鼠"
  ],
  "killZodiacs": [
    "虎",
    "狗"
  ],
  "numbers": [
    41,
    1,
    31,
    22,
    42,
    12,
    13,
    43,
    34,
    24,
    46,
    6,
    36,
    17,
    37,
    7
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "牛"
    ],
    "4": [
      "鸡",
      "羊",
      "牛",
      "马"
    ],
    "5": [
      "鸡",
      "羊",
      "牛",
      "马",
      "虎"
    ],
    "7": [
      "鸡",
      "牛",
      "羊",
      "虎",
      "马",
      "龙",
      "鼠"
    ],
    "8": [
      "鸡",
      "牛",
      "羊",
      "虎",
      "马",
      "龙",
      "鼠",
      "猴"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 42.0,
  "votes": {
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 2.5,
    "猪": 2.0,
    "鼠": 3.0,
    "牛": 3.5,
    "虎": 3.5,
    "兔": 3.0,
    "龙": 3.0,
    "马": 3.5,
    "羊": 3.5,
    "蛇": 1.0
  }
};