var ensembleData = {
  "time": "2026-07-03 21:32:32",
  "issue": "2026184",
  "code": "44,24,11,36,25,20,01",
  "zodiac": "猪,羊,猴,羊,马,猪,马",
  "wave": "green,red,green,blue,blue,blue,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026185",
  "ninePool": [
    "猴",
    "牛",
    "龙",
    "羊",
    "鼠",
    "兔",
    "虎",
    "鸡",
    "狗"
  ],
  "sixPool": [
    "猴",
    "牛",
    "龙",
    "羊",
    "鼠",
    "兔"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "numbers": [
    35,
    3,
    6,
    39,
    42,
    11,
    47,
    15,
    18,
    23,
    27,
    30,
    36,
    12,
    43,
    48
  ],
  "pools": {
    "3": [
      "猴",
      "牛",
      "龙"
    ],
    "4": [
      "猴",
      "牛",
      "龙",
      "羊"
    ],
    "5": [
      "猴",
      "牛",
      "龙",
      "羊",
      "鼠"
    ],
    "7": [
      "猴",
      "牛",
      "龙",
      "羊",
      "鼠",
      "兔",
      "虎"
    ],
    "8": [
      "猴",
      "牛",
      "龙",
      "羊",
      "鼠",
      "兔",
      "虎",
      "鸡"
    ]
  },
  "dynamicRate9": 78.37837837837837,
  "dynamicRate6": 62.16216216216216,
  "votes": {
    "猴": 4,
    "羊": 3,
    "狗": 2,
    "鼠": 3,
    "牛": 4,
    "虎": 3,
    "兔": 3,
    "猪": 1,
    "鸡": 3,
    "龙": 3,
    "马": 1,
    "蛇": 1
  }
};