var ensembleData = {
  "time": "2026-08-29 21:32:32",
  "issue": "2026241",
  "code": "29,45,27,21,42,41,49",
  "zodiac": "虎,狗,龙,狗,牛,虎,马",
  "wave": "red,red,green,green,blue,blue,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026242",
  "ninePool": [
    "虎",
    "猴",
    "龙",
    "兔",
    "狗",
    "鸡",
    "猪",
    "羊",
    "蛇"
  ],
  "sixPool": [
    "虎",
    "猴",
    "龙",
    "兔",
    "狗",
    "鸡"
  ],
  "killZodiacs": [
    "羊",
    "马"
  ],
  "numbers": [
    40,
    10,
    41,
    11,
    21,
    22,
    23,
    3,
    33,
    5,
    35,
    15,
    45,
    16,
    46,
    17
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    5,
    6,
    7
  ],
  "pools": {
    "3": [
      "虎",
      "猴",
      "龙"
    ],
    "4": [
      "虎",
      "猴",
      "龙",
      "狗"
    ],
    "5": [
      "虎",
      "猴",
      "龙",
      "狗",
      "兔"
    ],
    "7": [
      "虎",
      "猴",
      "龙",
      "兔",
      "狗",
      "鸡",
      "猪"
    ],
    "8": [
      "虎",
      "猴",
      "龙",
      "兔",
      "狗",
      "鸡",
      "猪",
      "羊"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "虎": 4.5,
    "兔": 3.0,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 1.0,
    "羊": 2.0,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 2.5,
    "牛": 2.0,
    "鼠": 1.0
  }
};