var ensembleData = {
  "time": "2026-10-04 21:32:32",
  "issue": "2026277",
  "code": "41,23,14,31,13,32,11",
  "zodiac": "虎,猴,蛇,鼠,马,猪,猴",
  "wave": "blue,red,blue,blue,red,green,green",
  "teSx": "猴",
  "teWei": 1,
  "nextIssue": "2026278",
  "ninePool": [
    "猪",
    "羊",
    "牛",
    "猴",
    "狗",
    "鼠",
    "兔",
    "马",
    "鸡"
  ],
  "sixPool": [
    "羊",
    "猪",
    "牛",
    "猴",
    "狗",
    "鼠"
  ],
  "killZodiacs": [
    "蛇",
    "猴"
  ],
  "numbers": [
    11,
    21,
    31,
    12,
    32,
    42,
    24,
    44,
    35,
    45,
    36,
    6,
    48,
    8,
    18,
    9
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "牛",
      "猪"
    ],
    "4": [
      "羊",
      "牛",
      "猪",
      "猴"
    ],
    "5": [
      "羊",
      "牛",
      "猪",
      "猴",
      "狗"
    ],
    "7": [
      "猪",
      "羊",
      "牛",
      "猴",
      "狗",
      "鼠",
      "兔"
    ],
    "8": [
      "猪",
      "羊",
      "牛",
      "猴",
      "狗",
      "鼠",
      "兔",
      "马"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "马": 2.0,
    "羊": 4.5,
    "猴": 4.5,
    "鸡": 2.0,
    "狗": 3.0,
    "猪": 4.5,
    "鼠": 3.0,
    "牛": 4.5,
    "虎": 2.0,
    "兔": 2.5,
    "龙": 2.0
  }
};