var ensembleData = {
  "time": "2026-10-21 21:32:32",
  "issue": "2026294",
  "code": "29,43,10,02,34,27,28",
  "zodiac": "虎,鼠,鸡,蛇,鸡,龙,兔",
  "wave": "red,green,blue,red,red,green,green",
  "teSx": "兔",
  "teWei": 8,
  "nextIssue": "2026295",
  "ninePool": [
    "牛",
    "鼠",
    "马",
    "虎",
    "羊",
    "狗",
    "蛇",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "牛",
    "鼠",
    "马",
    "虎",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "鸡",
    "兔"
  ],
  "numbers": [
    30,
    31,
    1,
    41,
    21,
    43,
    13,
    33,
    24,
    6,
    36,
    7,
    37,
    17,
    19,
    29
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "牛",
      "鼠",
      "马"
    ],
    "4": [
      "牛",
      "鼠",
      "马",
      "虎"
    ],
    "5": [
      "牛",
      "鼠",
      "马",
      "虎",
      "羊"
    ],
    "7": [
      "牛",
      "鼠",
      "马",
      "虎",
      "羊",
      "狗",
      "蛇"
    ],
    "8": [
      "牛",
      "鼠",
      "马",
      "虎",
      "羊",
      "狗",
      "蛇",
      "鸡"
    ]
  },
  "dynamicRate9": 72.0,
  "dynamicRate6": 42.0,
  "votes": {
    "鸡": 2.0,
    "狗": 3.0,
    "猪": 2.0,
    "鼠": 4.5,
    "牛": 4.5,
    "虎": 3.5,
    "兔": 2.0,
    "龙": 2.0,
    "蛇": 3.0,
    "马": 3.5,
    "羊": 3.5,
    "猴": 1.0
  }
};