var ensembleData = {
  "time": "2026-08-17 21:32:32",
  "issue": "2026229",
  "code": "11,07,15,13,33,16,38",
  "zodiac": "猴,鼠,龙,马,狗,兔,蛇",
  "wave": "green,red,blue,red,green,green,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026230",
  "ninePool": [
    "羊",
    "猴",
    "猪",
    "虎",
    "鼠",
    "牛",
    "兔",
    "龙",
    "鸡"
  ],
  "sixPool": [
    "羊",
    "猴",
    "猪",
    "虎",
    "鼠",
    "牛"
  ],
  "killZodiacs": [
    "鸡",
    "蛇"
  ],
  "numbers": [
    20,
    30,
    11,
    41,
    31,
    23,
    43,
    24,
    44,
    36,
    6,
    47,
    17,
    7,
    29,
    19
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "猴",
      "龙"
    ],
    "4": [
      "羊",
      "猴",
      "龙",
      "猪"
    ],
    "5": [
      "羊",
      "猴",
      "龙",
      "猪",
      "虎"
    ],
    "7": [
      "羊",
      "猴",
      "猪",
      "虎",
      "鼠",
      "牛",
      "兔"
    ],
    "8": [
      "羊",
      "猴",
      "猪",
      "虎",
      "鼠",
      "牛",
      "兔",
      "龙"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "狗": 1.0,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 3.0,
    "虎": 3.0,
    "兔": 3.0,
    "龙": 3.0,
    "蛇": 1.0,
    "马": 1.0,
    "羊": 3.5,
    "鸡": 2.0,
    "猴": 3.5
  }
};