var ensembleData = {
  "time": "2026-09-07 21:32:32",
  "issue": "2026250",
  "code": "10,06,39,47,37,17,14",
  "zodiac": "鸡,牛,龙,猴,马,虎,蛇",
  "wave": "blue,green,green,blue,blue,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026251",
  "ninePool": [
    "虎",
    "马",
    "牛",
    "鼠",
    "鸡",
    "猪",
    "蛇",
    "羊",
    "猴"
  ],
  "sixPool": [
    "虎",
    "马",
    "牛",
    "鼠",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "狗",
    "蛇"
  ],
  "numbers": [
    30,
    10,
    20,
    41,
    1,
    31,
    13,
    43,
    5,
    25,
    6,
    46,
    17,
    37,
    7,
    18
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "马",
      "牛"
    ],
    "4": [
      "虎",
      "马",
      "牛",
      "鼠"
    ],
    "5": [
      "虎",
      "马",
      "牛",
      "鼠",
      "鸡"
    ],
    "7": [
      "虎",
      "马",
      "牛",
      "鼠",
      "鸡",
      "猪",
      "蛇"
    ],
    "8": [
      "虎",
      "马",
      "牛",
      "鼠",
      "鸡",
      "猪",
      "蛇",
      "羊"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0,
  "votes": {
    "马": 3.5,
    "羊": 2.0,
    "猴": 2.0,
    "鸡": 3.0,
    "狗": 2.0,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 3.0,
    "虎": 4.5,
    "蛇": 2.5,
    "兔": 2.0,
    "龙": 1.0
  }
};