var ensembleData = {
  "time": "2026-07-14 21:32:32",
  "issue": "2026195",
  "code": "46,23,39,04,09,19,25",
  "zodiac": "鸡,猴,龙,兔,狗,鼠,马",
  "wave": "red,red,green,blue,blue,red,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026196",
  "ninePool": [
    "牛",
    "猪",
    "虎",
    "鼠",
    "龙",
    "鸡",
    "兔",
    "狗",
    "羊"
  ],
  "sixPool": [
    "牛",
    "猪",
    "虎",
    "鼠",
    "龙",
    "鸡"
  ],
  "killZodiacs": [
    "蛇",
    "马"
  ],
  "numbers": [
    3,
    5,
    7,
    39,
    41,
    43,
    15,
    17,
    19,
    27,
    29,
    31,
    34,
    22,
    42,
    8
  ],
  "pools": {
    "3": [
      "鼠",
      "龙",
      "虎"
    ],
    "4": [
      "牛",
      "猪",
      "虎",
      "鼠"
    ],
    "5": [
      "牛",
      "猪",
      "虎",
      "鼠",
      "龙"
    ],
    "7": [
      "牛",
      "猪",
      "虎",
      "鼠",
      "龙",
      "鸡",
      "兔"
    ],
    "8": [
      "牛",
      "猪",
      "虎",
      "鼠",
      "龙",
      "鸡",
      "兔",
      "狗"
    ]
  },
  "dynamicRate9": 75.0,
  "dynamicRate6": 62.5,
  "votes": {
    "猪": 4,
    "鼠": 4,
    "牛": 4,
    "狗": 2,
    "虎": 4,
    "龙": 4,
    "鸡": 4,
    "兔": 3,
    "蛇": 1,
    "马": 1,
    "羊": 1,
    "猴": 1
  }
};