var ensembleData = {
  "time": "2026-10-31 21:32:32",
  "issue": "2026304",
  "code": "23,24,10,43,13,36,21",
  "zodiac": "猴,羊,鸡,鼠,马,羊,狗",
  "wave": "red,red,blue,green,red,blue,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026305",
  "ninePool": [
    "猪",
    "狗",
    "龙",
    "牛",
    "马",
    "羊",
    "鸡",
    "猴",
    "鼠"
  ],
  "sixPool": [
    "猪",
    "狗",
    "龙",
    "牛",
    "马",
    "羊"
  ],
  "killZodiacs": [
    "龙",
    "狗"
  ],
  "numbers": [
    21,
    1,
    32,
    42,
    12,
    33,
    3,
    13,
    44,
    24,
    6,
    36,
    27,
    37,
    8,
    18
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "猪",
      "狗",
      "龙"
    ],
    "4": [
      "猪",
      "狗",
      "龙",
      "牛"
    ],
    "5": [
      "猪",
      "狗",
      "龙",
      "牛",
      "鸡"
    ],
    "7": [
      "猪",
      "狗",
      "龙",
      "牛",
      "马",
      "羊",
      "鸡"
    ],
    "8": [
      "猪",
      "狗",
      "龙",
      "牛",
      "马",
      "羊",
      "鸡",
      "猴"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 44.0,
  "votes": {
    "马": 3.0,
    "羊": 3.0,
    "猴": 2.0,
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 4.5,
    "鼠": 2.0,
    "牛": 3.5,
    "虎": 1.0,
    "龙": 3.5,
    "兔": 2.0,
    "蛇": 1.0
  }
};