var ensembleData = {
  "time": "2026-06-18 21:32:32",
  "issue": "2026169",
  "code": "44,37,30,08,40,22,24",
  "zodiac": "猪,马,牛,猪,兔,鸡,羊",
  "wave": "green,blue,red,red,red,green,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026170",
  "ninePool": [
    "蛇",
    "鸡",
    "猪",
    "狗",
    "猴",
    "兔",
    "羊",
    "马",
    "龙"
  ],
  "sixPool": [
    "蛇",
    "鸡",
    "猪",
    "狗",
    "猴",
    "兔"
  ],
  "killZodiacs": [
    "兔",
    "羊"
  ],
  "numbers": [
    2,
    8,
    32,
    21,
    38,
    14,
    26,
    34,
    10,
    22,
    46,
    20,
    44,
    33,
    9,
    45
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    8,
    3,
    2,
    7,
    0
  ],
  "pools": {
    "3": [
      "蛇",
      "鸡",
      "猪"
    ],
    "4": [
      "蛇",
      "鸡",
      "猪",
      "狗"
    ],
    "5": [
      "蛇",
      "鸡",
      "猪",
      "狗",
      "猴"
    ],
    "7": [
      "蛇",
      "鸡",
      "猪",
      "狗",
      "猴",
      "兔",
      "羊"
    ],
    "8": [
      "蛇",
      "鸡",
      "猪",
      "狗",
      "猴",
      "兔",
      "羊",
      "马"
    ]
  },
  "dynamicRate9": 72.72727272727273,
  "dynamicRate6": 63.63636363636363,
  "votes": {
    "兔": 3,
    "龙": 2,
    "蛇": 4,
    "马": 3,
    "羊": 3,
    "猴": 3,
    "鸡": 4,
    "狗": 4,
    "猪": 4,
    "虎": 1,
    "牛": 2
  }
};