var ensembleData = {
  "time": "2026-09-29 21:32:32",
  "issue": "2026272",
  "code": "43,15,04,06,32,36,02",
  "zodiac": "鼠,龙,兔,牛,猪,羊,蛇",
  "wave": "green,blue,blue,green,green,blue,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026273",
  "ninePool": [
    "牛",
    "虎",
    "羊",
    "蛇",
    "猴",
    "龙",
    "鼠",
    "马",
    "猪"
  ],
  "sixPool": [
    "牛",
    "虎",
    "羊",
    "蛇",
    "猴",
    "鼠"
  ],
  "killZodiacs": [
    "牛",
    "蛇"
  ],
  "numbers": [
    30,
    41,
    11,
    31,
    42,
    12,
    2,
    23,
    43,
    24,
    14,
    5,
    35,
    6,
    36,
    26
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    5,
    6
  ],
  "pools": {
    "3": [
      "牛",
      "虎",
      "羊"
    ],
    "4": [
      "牛",
      "虎",
      "羊",
      "猴"
    ],
    "5": [
      "牛",
      "虎",
      "羊",
      "猴",
      "蛇"
    ],
    "7": [
      "牛",
      "虎",
      "羊",
      "蛇",
      "猴",
      "龙",
      "鼠"
    ],
    "8": [
      "牛",
      "虎",
      "羊",
      "蛇",
      "猴",
      "龙",
      "鼠",
      "马"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 56.00000000000001,
  "votes": {
    "猪": 2.0,
    "鼠": 3.0,
    "牛": 4.5,
    "虎": 4.5,
    "兔": 2.0,
    "龙": 3.0,
    "蛇": 3.5,
    "马": 3.0,
    "羊": 4.5,
    "猴": 3.5,
    "鸡": 1.0
  }
};