var ensembleData = {
  "time": "2026-10-20 21:32:32",
  "issue": "2026293",
  "code": "38,10,48,49,13,09,05",
  "zodiac": "蛇,鸡,羊,马,马,狗,虎",
  "wave": "green,blue,blue,green,red,blue,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026294",
  "ninePool": [
    "狗",
    "羊",
    "猴",
    "鸡",
    "马",
    "鼠",
    "猪",
    "蛇",
    "虎"
  ],
  "sixPool": [
    "狗",
    "羊",
    "鸡",
    "猴",
    "马",
    "鼠"
  ],
  "killZodiacs": [
    "马",
    "虎"
  ],
  "numbers": [
    9,
    33,
    12,
    24,
    36,
    48,
    10,
    22,
    34,
    46,
    23,
    13,
    19,
    43,
    21,
    45
  ],
  "supplement": [
    21,
    45
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "狗",
      "羊",
      "猴"
    ],
    "4": [
      "狗",
      "羊",
      "猴",
      "鸡"
    ],
    "5": [
      "狗",
      "羊",
      "猴",
      "鸡",
      "鼠"
    ],
    "7": [
      "狗",
      "羊",
      "猴",
      "鸡",
      "马",
      "鼠",
      "猪"
    ],
    "8": [
      "狗",
      "羊",
      "猴",
      "鸡",
      "马",
      "鼠",
      "猪",
      "蛇"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 44.0,
  "votes": {
    "马": 3.0,
    "羊": 4.5,
    "猴": 3.5,
    "鸡": 3.5,
    "狗": 4.5,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 2.0,
    "虎": 2.0,
    "蛇": 2.5,
    "龙": 2.0,
    "兔": 1.0
  }
};