var ensembleData = {
  "time": "2026-06-03 21:32:32",
  "issue": "2026154",
  "code": "46,28,42,31,23,34,41",
  "zodiac": "鸡,兔,牛,鼠,猴,鸡,虎",
  "wave": "red,green,blue,blue,red,red,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026155",
  "ninePool": [
    "猪",
    "鸡",
    "兔",
    "蛇",
    "马",
    "狗",
    "猴",
    "羊",
    "龙"
  ],
  "sixPool": [
    "蛇",
    "猪",
    "鸡",
    "马",
    "狗",
    "兔"
  ],
  "killZodiacs": [
    "鼠",
    "虎"
  ],
  "rangeZodiacs": [
    "猪",
    "鸡",
    "兔",
    "蛇",
    "马",
    "狗",
    "猴",
    "羊",
    "龙"
  ],
  "numbers": [
    14,
    20,
    10,
    37,
    9,
    4,
    40,
    44,
    34,
    26,
    46,
    16
  ],
  "zodiacNumMap": {
    "蛇": [
      14,
      26
    ],
    "猪": [
      20,
      44
    ],
    "鸡": [
      10,
      34,
      46
    ],
    "马": [
      37
    ],
    "狗": [
      9
    ],
    "兔": [
      4,
      40,
      16
    ]
  },
  "top7Tails": [
    0,
    4,
    6,
    2,
    7,
    8,
    9
  ],
  "votes9": {
    "鸡": 4,
    "猴": 3,
    "猪": 4,
    "蛇": 4,
    "狗": 3,
    "鼠": 2,
    "龙": 3,
    "兔": 4,
    "牛": 1,
    "马": 3,
    "羊": 3,
    "虎": 2
  },
  "votes6": {
    "鸡": 3,
    "猴": 1,
    "猪": 3,
    "蛇": 4,
    "狗": 3,
    "鼠": 1,
    "兔": 2,
    "马": 3,
    "龙": 1,
    "羊": 1,
    "虎": 2
  }
};