var ensembleData = {
  "time": "2026-09-12 21:32:32",
  "issue": "2026255",
  "code": "36,22,06,47,39,11,44",
  "zodiac": "羊,鸡,牛,猴,龙,猴,猪",
  "wave": "blue,green,green,blue,green,green,green",
  "teSx": "猪",
  "teWei": 4,
  "nextIssue": "2026256",
  "ninePool": [
    "猴",
    "牛",
    "鸡",
    "鼠",
    "龙",
    "狗",
    "马",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "猴",
    "牛",
    "鸡",
    "鼠",
    "龙",
    "狗"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "numbers": [
    23,
    6,
    18,
    30,
    42,
    10,
    22,
    34,
    46,
    19,
    43,
    3,
    39,
    9,
    33,
    11
  ],
  "supplement": [
    11
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "牛",
      "猴",
      "鸡"
    ],
    "4": [
      "牛",
      "猴",
      "鸡",
      "鼠"
    ],
    "5": [
      "牛",
      "猴",
      "鸡",
      "鼠",
      "龙"
    ],
    "7": [
      "猴",
      "牛",
      "鸡",
      "鼠",
      "龙",
      "狗",
      "马"
    ],
    "8": [
      "猴",
      "牛",
      "鸡",
      "鼠",
      "龙",
      "狗",
      "马",
      "蛇"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 66.0,
  "votes": {
    "龙": 3.0,
    "蛇": 2.0,
    "马": 2.0,
    "羊": 2.0,
    "猴": 3.5,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 2.0,
    "鼠": 3.0,
    "牛": 3.5,
    "虎": 2.0,
    "兔": 1.0
  }
};