var ensembleData = {
  "time": "2026-08-05 21:32:32",
  "issue": "2026217",
  "code": "34,12,11,30,42,07,26",
  "zodiac": "鸡,羊,猴,牛,牛,鼠,蛇",
  "wave": "red,red,green,red,blue,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026218",
  "ninePool": [
    "猴",
    "牛",
    "鸡",
    "羊",
    "虎",
    "龙",
    "兔",
    "狗",
    "蛇"
  ],
  "sixPool": [
    "猴",
    "牛",
    "鸡",
    "羊",
    "虎",
    "龙"
  ],
  "killZodiacs": [
    "龙",
    "蛇"
  ],
  "numbers": [
    11,
    41,
    42,
    22,
    12,
    23,
    3,
    34,
    24,
    6,
    46,
    36,
    47,
    17,
    27,
    18
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "牛",
      "鸡"
    ],
    "4": [
      "猴",
      "牛",
      "鸡",
      "羊"
    ],
    "5": [
      "猴",
      "牛",
      "鸡",
      "羊",
      "虎"
    ],
    "7": [
      "猴",
      "牛",
      "鸡",
      "羊",
      "虎",
      "龙",
      "兔"
    ],
    "8": [
      "猴",
      "牛",
      "鸡",
      "羊",
      "虎",
      "龙",
      "兔",
      "狗"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "虎": 3.0,
    "兔": 2.0,
    "龙": 2.0,
    "蛇": 2.0,
    "马": 2.0,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 2.0,
    "牛": 3.5,
    "鼠": 2.0,
    "猪": 1.0
  }
};