var ensembleData = {
  "time": "2026-07-28 21:32:32",
  "issue": "2026209",
  "code": "44,05,39,14,21,22,08",
  "zodiac": "猪,虎,龙,蛇,狗,鸡,猪",
  "wave": "green,green,green,blue,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026210",
  "ninePool": [
    "兔",
    "龙",
    "蛇",
    "马",
    "狗",
    "牛",
    "虎",
    "鸡",
    "羊"
  ],
  "sixPool": [
    "兔",
    "龙",
    "蛇",
    "马",
    "狗",
    "牛"
  ],
  "killZodiacs": [
    "猪",
    "猪"
  ],
  "numbers": [
    1,
    21,
    4,
    14,
    15,
    25,
    45,
    16,
    26,
    6,
    27,
    37,
    28,
    38,
    18,
    39
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "兔",
      "龙",
      "蛇"
    ],
    "4": [
      "兔",
      "龙",
      "蛇",
      "马"
    ],
    "5": [
      "兔",
      "龙",
      "蛇",
      "马",
      "牛"
    ],
    "7": [
      "兔",
      "龙",
      "蛇",
      "马",
      "狗",
      "牛",
      "虎"
    ],
    "8": [
      "兔",
      "龙",
      "蛇",
      "马",
      "狗",
      "牛",
      "虎",
      "鸡"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "狗": 3.0,
    "猪": 1.0,
    "鼠": 1.0,
    "牛": 3.0,
    "虎": 3.0,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 3.0,
    "马": 3.0,
    "鸡": 2.0,
    "羊": 2.0
  }
};