var ensembleData = {
  "time": "2026-08-07 21:32:32",
  "issue": "2026219",
  "code": "31,41,07,08,29,22,43",
  "zodiac": "鼠,虎,鼠,猪,虎,鸡,鼠",
  "wave": "blue,blue,red,red,red,green,green",
  "teSx": "鼠",
  "teWei": 3,
  "nextIssue": "2026220",
  "ninePool": [
    "龙",
    "鸡",
    "牛",
    "马",
    "狗",
    "羊",
    "虎",
    "猴",
    "兔"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "牛",
    "马",
    "狗",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "numbers": [
    1,
    21,
    34,
    24,
    15,
    25,
    45,
    46,
    6,
    36,
    27,
    37,
    18,
    48,
    39,
    9
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "鸡",
      "牛"
    ],
    "4": [
      "龙",
      "鸡",
      "牛",
      "马"
    ],
    "5": [
      "龙",
      "鸡",
      "牛",
      "马",
      "狗"
    ],
    "7": [
      "龙",
      "鸡",
      "牛",
      "马",
      "狗",
      "羊",
      "虎"
    ],
    "8": [
      "龙",
      "鸡",
      "牛",
      "马",
      "狗",
      "羊",
      "虎",
      "猴"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 56.00000000000001,
  "votes": {
    "虎": 3.0,
    "兔": 2.0,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 3.5,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 3.0,
    "牛": 3.5,
    "猪": 1.0
  }
};