var ensembleData = {
  "time": "2026-06-05 21:32:32",
  "issue": "2026156",
  "code": "31,16,11,03,37,12,01",
  "zodiac": "鼠,兔,猴,龙,马,羊,马",
  "wave": "blue,green,green,blue,blue,red,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026157",
  "ninePool": [
    "牛",
    "鸡",
    "猴",
    "羊",
    "蛇",
    "兔",
    "龙",
    "虎",
    "狗"
  ],
  "sixPool": [
    "猴",
    "牛",
    "鸡",
    "兔",
    "龙",
    "羊"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "rangeZodiacs": [
    "牛",
    "鸡",
    "猴",
    "羊",
    "蛇",
    "兔",
    "龙",
    "虎",
    "狗"
  ],
  "numbers": [
    23,
    6,
    10,
    4,
    3,
    24,
    30,
    40,
    34,
    46,
    16,
    36
  ],
  "zodiacNumMap": {
    "猴": [
      23
    ],
    "牛": [
      6,
      30
    ],
    "鸡": [
      10,
      34,
      46
    ],
    "兔": [
      4,
      40,
      16
    ],
    "龙": [
      3
    ],
    "羊": [
      24,
      36
    ]
  },
  "top7Tails": [
    0,
    4,
    6,
    2,
    3,
    5,
    8
  ],
  "votes9": {
    "鸡": 4,
    "猴": 4,
    "牛": 4,
    "羊": 4,
    "狗": 2,
    "鼠": 1,
    "虎": 3,
    "蛇": 4,
    "猪": 2,
    "兔": 3,
    "龙": 3,
    "马": 2
  },
  "votes6": {
    "鸡": 3,
    "猴": 4,
    "牛": 3,
    "羊": 3,
    "狗": 2,
    "鼠": 1,
    "兔": 3,
    "龙": 3,
    "虎": 1,
    "马": 1
  }
};