var ensembleData = {
  "time": "2026-06-21 21:32:32",
  "issue": "2026172",
  "code": "28,34,42,37,45,08,44",
  "zodiac": "兔,鸡,牛,马,狗,猪,猪",
  "wave": "green,red,blue,blue,red,red,green",
  "teSx": "猪",
  "teWei": 4,
  "nextIssue": "2026173",
  "ninePool": [
    "虎",
    "马",
    "牛",
    "羊",
    "蛇",
    "猴",
    "鸡",
    "鼠",
    "龙"
  ],
  "sixPool": [
    "虎",
    "马",
    "牛",
    "羊",
    "蛇",
    "猴"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "numbers": [
    37,
    6,
    24,
    17,
    29,
    5,
    41,
    25,
    13,
    1,
    18,
    30,
    42,
    36,
    12,
    48
  ],
  "supplement": [],
  "optTails": [
    9,
    6,
    4,
    8,
    3,
    2,
    0
  ],
  "pools": {
    "3": [
      "虎",
      "马",
      "牛"
    ],
    "4": [
      "虎",
      "马",
      "牛",
      "羊"
    ],
    "5": [
      "虎",
      "马",
      "牛",
      "羊",
      "蛇"
    ],
    "7": [
      "虎",
      "马",
      "牛",
      "羊",
      "蛇",
      "猴",
      "鸡"
    ],
    "8": [
      "虎",
      "马",
      "牛",
      "羊",
      "蛇",
      "猴",
      "鸡",
      "鼠"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0,
  "votes": {
    "猪": 1,
    "鼠": 2,
    "牛": 3,
    "虎": 4,
    "兔": 2,
    "龙": 2,
    "蛇": 3,
    "马": 4,
    "羊": 3,
    "鸡": 2,
    "猴": 2,
    "狗": 2
  }
};