var ensembleData = {
  "time": "2026-10-24 21:32:32",
  "issue": "2026297",
  "code": "27,40,25,26,33,09,13",
  "zodiac": "龙,兔,马,蛇,狗,狗,马",
  "wave": "green,red,blue,blue,green,blue,red",
  "teSx": "马",
  "teWei": 3,
  "nextIssue": "2026298",
  "ninePool": [
    "狗",
    "龙",
    "牛",
    "鼠",
    "猪",
    "兔",
    "虎",
    "鸡",
    "蛇"
  ],
  "sixPool": [
    "狗",
    "龙",
    "牛",
    "鼠",
    "猪",
    "兔"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "numbers": [
    30,
    20,
    40,
    21,
    31,
    42,
    32,
    33,
    3,
    43,
    44,
    4,
    6,
    16,
    18,
    8
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "狗",
      "龙",
      "牛"
    ],
    "4": [
      "狗",
      "龙",
      "牛",
      "虎"
    ],
    "5": [
      "狗",
      "龙",
      "牛",
      "虎",
      "兔"
    ],
    "7": [
      "狗",
      "龙",
      "牛",
      "鼠",
      "猪",
      "兔",
      "虎"
    ],
    "8": [
      "狗",
      "龙",
      "牛",
      "鼠",
      "猪",
      "兔",
      "虎",
      "鸡"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 46.0,
  "votes": {
    "狗": 4.5,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 3.0,
    "虎": 3.0,
    "兔": 3.0,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 1.0,
    "鸡": 2.0,
    "猴": 1.0
  }
};