var ensembleData = {
  "time": "2026-07-12 21:32:32",
  "issue": "2026193",
  "code": "02,49,25,11,45,29,09",
  "zodiac": "蛇,马,马,猴,狗,虎,狗",
  "wave": "red,green,blue,green,red,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026194",
  "ninePool": [
    "猪",
    "牛",
    "鼠",
    "虎",
    "猴",
    "龙",
    "羊",
    "马",
    "兔"
  ],
  "sixPool": [
    "猪",
    "牛",
    "鼠",
    "虎",
    "猴",
    "龙"
  ],
  "killZodiacs": [
    "龙",
    "狗"
  ],
  "numbers": [
    32,
    35,
    6,
    8,
    42,
    11,
    44,
    47,
    18,
    20,
    23,
    30,
    17,
    43,
    27,
    31
  ],
  "pools": {
    "3": [
      "猪",
      "牛",
      "猴"
    ],
    "4": [
      "猪",
      "牛",
      "鼠",
      "虎"
    ],
    "5": [
      "猪",
      "牛",
      "鼠",
      "虎",
      "猴"
    ],
    "7": [
      "猪",
      "牛",
      "鼠",
      "虎",
      "猴",
      "龙",
      "羊"
    ],
    "8": [
      "猪",
      "牛",
      "鼠",
      "虎",
      "猴",
      "龙",
      "羊",
      "马"
    ]
  },
  "dynamicRate9": 76.08695652173914,
  "dynamicRate6": 63.04347826086957,
  "votes": {
    "猪": 4,
    "鼠": 3,
    "虎": 3,
    "兔": 2,
    "龙": 3,
    "马": 2,
    "牛": 4,
    "蛇": 2,
    "羊": 3,
    "猴": 3,
    "狗": 1
  }
};