var ensembleData = {
  "time": "2026-06-08 21:32:32",
  "issue": "2026159",
  "code": "12,04,28,17,20,46,39",
  "zodiac": "羊,兔,兔,虎,猪,鸡,龙",
  "wave": "red,blue,green,green,blue,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026160",
  "ninePool": [
    "牛",
    "猴",
    "马",
    "蛇",
    "猪",
    "兔",
    "龙",
    "羊",
    "鸡"
  ],
  "sixPool": [
    "牛",
    "猴",
    "马",
    "蛇",
    "猪",
    "兔"
  ],
  "killZodiacs": [
    "鼠",
    "龙"
  ],
  "numbers": [
    30,
    20,
    40,
    11,
    1,
    42,
    2,
    32,
    23,
    13,
    14,
    44,
    4,
    6,
    26,
    16
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "牛",
      "猴",
      "马"
    ],
    "4": [
      "牛",
      "猴",
      "马",
      "蛇"
    ],
    "5": [
      "牛",
      "猴",
      "马",
      "蛇",
      "猪"
    ],
    "7": [
      "牛",
      "猴",
      "马",
      "蛇",
      "猪",
      "兔",
      "龙"
    ],
    "8": [
      "牛",
      "猴",
      "马",
      "蛇",
      "猪",
      "兔",
      "龙",
      "羊"
    ]
  },
  "dynamicRate9": 75.0,
  "dynamicRate6": 58.333333333333336,
  "votes": {
    "猪": 3,
    "鼠": 2,
    "牛": 4,
    "虎": 2,
    "兔": 3,
    "龙": 3,
    "蛇": 3,
    "马": 3,
    "羊": 3,
    "鸡": 2,
    "猴": 3,
    "狗": 1
  }
};