var ensembleData = {
  "time": "2026-07-15 21:32:32",
  "issue": "2026196",
  "code": "03,37,24,10,41,19,39",
  "zodiac": "龙,马,羊,鸡,虎,鼠,龙",
  "wave": "blue,blue,red,blue,blue,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026197",
  "ninePool": [
    "羊",
    "猴",
    "鸡",
    "兔",
    "虎",
    "狗",
    "牛",
    "鼠",
    "猪"
  ],
  "sixPool": [
    "羊",
    "猴",
    "鸡",
    "兔",
    "虎",
    "狗"
  ],
  "killZodiacs": [
    "兔",
    "龙"
  ],
  "numbers": [
    10,
    40,
    11,
    41,
    21,
    12,
    22,
    23,
    33,
    24,
    34,
    4,
    47,
    17,
    48,
    28
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "猴",
      "鸡"
    ],
    "4": [
      "羊",
      "猴",
      "鸡",
      "兔"
    ],
    "5": [
      "羊",
      "猴",
      "鸡",
      "兔",
      "虎"
    ],
    "7": [
      "羊",
      "猴",
      "鸡",
      "兔",
      "虎",
      "狗",
      "牛"
    ],
    "8": [
      "羊",
      "猴",
      "鸡",
      "兔",
      "虎",
      "狗",
      "牛",
      "鼠"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.66666666666666,
  "votes": {
    "虎": 3,
    "兔": 3,
    "龙": 2,
    "蛇": 2,
    "马": 2,
    "羊": 4,
    "猴": 4,
    "鸡": 3,
    "狗": 3,
    "猪": 2,
    "牛": 2,
    "鼠": 2
  }
};