var ensembleData = {
  "time": "2026-06-11 21:32:32",
  "issue": "2026162",
  "code": "23,41,24,26,33,07,32",
  "zodiac": "猴,虎,羊,蛇,狗,鼠,猪",
  "wave": "red,blue,red,blue,green,red,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026163",
  "ninePool": [
    "兔",
    "牛",
    "鼠",
    "狗",
    "蛇",
    "马",
    "龙",
    "鸡",
    "猴"
  ],
  "sixPool": [
    "兔",
    "牛",
    "鼠",
    "狗",
    "蛇",
    "马"
  ],
  "killZodiacs": [
    "猪",
    "猪"
  ],
  "numbers": [
    40,
    16,
    7,
    45,
    2,
    1,
    28,
    4,
    18,
    6,
    30,
    42,
    19,
    43,
    31,
    21
  ],
  "supplement": [],
  "optTails": [
    9,
    6,
    1,
    4,
    8,
    5,
    7
  ],
  "pools": {
    "3": [
      "兔",
      "牛",
      "鼠"
    ],
    "4": [
      "兔",
      "牛",
      "鼠",
      "狗"
    ],
    "5": [
      "兔",
      "牛",
      "鼠",
      "狗",
      "蛇"
    ],
    "7": [
      "兔",
      "牛",
      "鼠",
      "狗",
      "蛇",
      "马",
      "龙"
    ],
    "8": [
      "兔",
      "牛",
      "鼠",
      "狗",
      "蛇",
      "马",
      "龙",
      "鸡"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.66666666666666,
  "votes": {
    "狗": 3,
    "猪": 2,
    "鼠": 3,
    "牛": 3,
    "虎": 2,
    "兔": 4,
    "龙": 3,
    "蛇": 3,
    "马": 3,
    "鸡": 2,
    "猴": 2,
    "羊": 2
  }
};