var ensembleData = {
  "time": "2026-09-02 21:32:32",
  "issue": "2026245",
  "code": "22,23,14,02,13,38,18",
  "zodiac": "鸡,猴,蛇,蛇,马,蛇,牛",
  "wave": "green,red,blue,red,red,green,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026246",
  "ninePool": [
    "虎",
    "猪",
    "猴",
    "狗",
    "羊",
    "鼠",
    "马",
    "蛇",
    "牛"
  ],
  "sixPool": [
    "虎",
    "猪",
    "猴",
    "狗",
    "羊",
    "鼠"
  ],
  "killZodiacs": [
    "蛇",
    "牛"
  ],
  "numbers": [
    41,
    11,
    21,
    31,
    32,
    12,
    44,
    24,
    5,
    35,
    45,
    36,
    8,
    48,
    29,
    9
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "猪",
      "猴",
      "虎"
    ],
    "4": [
      "猪",
      "猴",
      "虎",
      "狗"
    ],
    "5": [
      "猪",
      "猴",
      "虎",
      "狗",
      "羊"
    ],
    "7": [
      "虎",
      "猪",
      "猴",
      "狗",
      "羊",
      "鼠",
      "马"
    ],
    "8": [
      "虎",
      "猪",
      "猴",
      "狗",
      "羊",
      "鼠",
      "马",
      "蛇"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 62.0,
  "votes": {
    "马": 2.0,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 1.0,
    "狗": 3.5,
    "猪": 4.5,
    "鼠": 3.0,
    "牛": 2.0,
    "虎": 4.5,
    "蛇": 2.0,
    "龙": 2.0,
    "兔": 1.0
  }
};