var ensembleData = {
  "time": "2026-08-31 21:32:32",
  "issue": "2026243",
  "code": "42,17,12,46,09,24,21",
  "zodiac": "牛,虎,羊,鸡,狗,羊,狗",
  "wave": "blue,green,red,red,blue,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026244",
  "ninePool": [
    "鼠",
    "马",
    "虎",
    "羊",
    "兔",
    "龙",
    "狗",
    "蛇",
    "鸡"
  ],
  "sixPool": [
    "鼠",
    "马",
    "虎",
    "羊",
    "兔",
    "龙"
  ],
  "killZodiacs": [
    "猪",
    "狗"
  ],
  "numbers": [
    31,
    1,
    41,
    24,
    4,
    25,
    5,
    15,
    36,
    16,
    7,
    37,
    17,
    27,
    48,
    28
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "鼠",
      "马",
      "羊"
    ],
    "4": [
      "鼠",
      "马",
      "羊",
      "虎"
    ],
    "5": [
      "鼠",
      "马",
      "羊",
      "虎",
      "兔"
    ],
    "7": [
      "鼠",
      "马",
      "虎",
      "羊",
      "兔",
      "龙",
      "狗"
    ],
    "8": [
      "鼠",
      "马",
      "虎",
      "羊",
      "兔",
      "龙",
      "狗",
      "蛇"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0,
  "votes": {
    "狗": 2.0,
    "猪": 1.0,
    "鼠": 4.5,
    "牛": 2.0,
    "虎": 3.5,
    "兔": 3.0,
    "龙": 3.0,
    "蛇": 2.0,
    "马": 4.5,
    "鸡": 2.0,
    "猴": 2.0,
    "羊": 3.5
  }
};