var ensembleData = {
  "time": "2026-05-30 21:32:32",
  "issue": "2026150",
  "code": "11,04,22,25,44,19,09",
  "zodiac": "猴,兔,鸡,马,猪,鼠,狗",
  "wave": "green,blue,green,blue,green,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026151",
  "ninePool": [
    "鸡",
    "羊",
    "猴",
    "鼠",
    "龙",
    "兔",
    "虎",
    "马",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "鼠",
    "兔",
    "虎",
    "龙",
    "羊"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "rangeZodiacs": [
    "鸡",
    "羊",
    "猴",
    "鼠",
    "龙",
    "兔",
    "虎",
    "马",
    "牛"
  ],
  "numbers": [
    10,
    19,
    40,
    29,
    39,
    12,
    31,
    41,
    22,
    34,
    4,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "鼠": [
      19,
      31
    ],
    "兔": [
      40,
      4
    ],
    "虎": [
      29,
      41
    ],
    "龙": [
      39
    ],
    "羊": [
      12,
      24
    ]
  },
  "top7Tails": [
    0,
    1,
    9,
    2,
    4,
    5,
    6
  ],
  "votes9": {
    "鸡": 4,
    "兔": 3,
    "鼠": 3,
    "虎": 3,
    "马": 3,
    "猴": 4,
    "蛇": 3,
    "牛": 3,
    "羊": 4,
    "龙": 3,
    "猪": 1,
    "狗": 2
  },
  "votes6": {
    "鸡": 3,
    "兔": 3,
    "鼠": 3,
    "虎": 3,
    "马": 2,
    "猴": 2,
    "龙": 2,
    "羊": 2,
    "猪": 1,
    "狗": 1,
    "蛇": 1,
    "牛": 1
  }
};