var ensembleData = {
  "time": "2026-08-20 21:32:32",
  "issue": "2026232",
  "code": "29,10,17,04,46,20,42",
  "zodiac": "虎,鸡,虎,兔,鸡,猪,牛",
  "wave": "red,blue,green,blue,red,blue,blue",
  "teSx": "牛",
  "teWei": 2,
  "nextIssue": "2026233",
  "ninePool": [
    "狗",
    "猪",
    "虎",
    "鼠",
    "龙",
    "马",
    "鸡",
    "兔",
    "牛"
  ],
  "sixPool": [
    "狗",
    "猪",
    "虎",
    "鼠",
    "龙",
    "马"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "numbers": [
    9,
    33,
    8,
    20,
    32,
    44,
    29,
    19,
    43,
    3,
    39,
    13,
    21,
    45,
    5,
    17
  ],
  "supplement": [
    21,
    45,
    5,
    17
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "狗",
      "虎",
      "猪"
    ],
    "4": [
      "狗",
      "虎",
      "猪",
      "龙"
    ],
    "5": [
      "狗",
      "虎",
      "猪",
      "龙",
      "鼠"
    ],
    "7": [
      "狗",
      "猪",
      "虎",
      "鼠",
      "龙",
      "马",
      "鸡"
    ],
    "8": [
      "狗",
      "猪",
      "虎",
      "鼠",
      "龙",
      "马",
      "鸡",
      "兔"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "狗": 4.5,
    "猪": 4.5,
    "鼠": 3.0,
    "牛": 2.0,
    "虎": 4.5,
    "兔": 2.0,
    "龙": 3.0,
    "蛇": 2.0,
    "马": 3.0,
    "鸡": 2.0,
    "猴": 1.0
  }
};