var ensembleData = {
  "time": "2026-10-10 21:32:32",
  "issue": "2026283",
  "code": "35,08,15,06,21,01,18",
  "zodiac": "猴,猪,龙,牛,狗,马,牛",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026284",
  "ninePool": [
    "猪",
    "马",
    "鼠",
    "兔",
    "虎",
    "羊",
    "牛",
    "蛇",
    "狗"
  ],
  "sixPool": [
    "猪",
    "马",
    "鼠",
    "兔",
    "虎",
    "羊"
  ],
  "killZodiacs": [
    "猴",
    "牛"
  ],
  "numbers": [
    1,
    31,
    41,
    13,
    43,
    44,
    4,
    24,
    25,
    5,
    16,
    36,
    37,
    7,
    17,
    8
  ],
  "supplement": [],
  "optTails": [
    1,
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "马",
      "猪",
      "兔"
    ],
    "4": [
      "马",
      "猪",
      "兔",
      "鼠"
    ],
    "5": [
      "马",
      "猪",
      "兔",
      "鼠",
      "虎"
    ],
    "7": [
      "猪",
      "马",
      "鼠",
      "兔",
      "虎",
      "羊",
      "牛"
    ],
    "8": [
      "猪",
      "马",
      "鼠",
      "兔",
      "虎",
      "羊",
      "牛",
      "蛇"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 54.0,
  "votes": {
    "狗": 2.0,
    "猪": 4.5,
    "鼠": 4.5,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 4.5,
    "龙": 2.0,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 3.5
  }
};