var ensembleData = {
  "time": "2026-06-17 21:32:32",
  "issue": "2026168",
  "code": "27,11,24,05,40,33,15",
  "zodiac": "龙,猴,羊,虎,兔,狗,龙",
  "wave": "green,green,red,green,red,green,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026169",
  "ninePool": [
    "羊",
    "兔",
    "猴",
    "鸡",
    "蛇",
    "马",
    "猪",
    "狗",
    "龙"
  ],
  "sixPool": [
    "羊",
    "兔",
    "猴",
    "鸡",
    "蛇",
    "马"
  ],
  "killZodiacs": [
    "蛇",
    "龙"
  ],
  "numbers": [
    16,
    2,
    37,
    36,
    12,
    24,
    48,
    28,
    4,
    40,
    47,
    35,
    11,
    23,
    34,
    10
  ],
  "supplement": [],
  "optTails": [
    9,
    6,
    1,
    4,
    8,
    5,
    2
  ],
  "pools": {
    "3": [
      "羊",
      "兔",
      "猴"
    ],
    "4": [
      "羊",
      "兔",
      "猴",
      "鸡"
    ],
    "5": [
      "羊",
      "兔",
      "猴",
      "鸡",
      "蛇"
    ],
    "7": [
      "羊",
      "兔",
      "猴",
      "鸡",
      "蛇",
      "马",
      "猪"
    ],
    "8": [
      "羊",
      "兔",
      "猴",
      "鸡",
      "蛇",
      "马",
      "猪",
      "狗"
    ]
  },
  "dynamicRate9": 76.19047619047619,
  "dynamicRate6": 66.66666666666666,
  "votes": {
    "兔": 4,
    "龙": 1,
    "蛇": 3,
    "马": 3,
    "羊": 4,
    "猴": 3,
    "鸡": 3,
    "狗": 3,
    "猪": 3,
    "虎": 1,
    "牛": 1,
    "鼠": 1
  }
};