var ensembleData = {
  "time": "2026-06-01 21:32:32",
  "issue": "2026152",
  "code": "34,47,16,36,44,01,45",
  "zodiac": "鸡,猴,兔,羊,猪,马,狗",
  "wave": "red,blue,green,blue,green,red,red",
  "teSx": "狗",
  "teWei": 5,
  "nextIssue": "2026153",
  "ninePool": [
    "鸡",
    "蛇",
    "虎",
    "牛",
    "羊",
    "兔",
    "猴",
    "猪",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "羊",
    "兔",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "蛇",
    "狗"
  ],
  "rangeZodiacs": [
    "鸡",
    "蛇",
    "虎",
    "牛",
    "羊",
    "兔",
    "猴",
    "猪",
    "龙"
  ],
  "numbers": [
    10,
    26,
    36,
    16,
    11,
    20,
    40,
    46,
    22,
    2,
    12,
    32
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      46,
      22
    ],
    "蛇": [
      26,
      2
    ],
    "羊": [
      36,
      12
    ],
    "兔": [
      16,
      40
    ],
    "猴": [
      11
    ],
    "猪": [
      20,
      32
    ]
  },
  "top7Tails": [
    0,
    6,
    1,
    2,
    4,
    5,
    7
  ],
  "votes9": {
    "鸡": 4,
    "兔": 3,
    "猴": 3,
    "虎": 4,
    "龙": 3,
    "马": 1,
    "蛇": 4,
    "牛": 4,
    "羊": 3,
    "猪": 3,
    "鼠": 2,
    "狗": 2
  },
  "votes6": {
    "鸡": 4,
    "兔": 2,
    "猴": 2,
    "虎": 2,
    "龙": 2,
    "马": 1,
    "羊": 2,
    "蛇": 3,
    "猪": 2,
    "鼠": 1,
    "狗": 2,
    "牛": 1
  }
};