var ensembleData = {
  "time": "2026-10-13 21:32:32",
  "issue": "2026286",
  "code": "37,49,28,08,29,01,24",
  "zodiac": "马,马,兔,猪,虎,马,羊",
  "wave": "blue,green,green,red,red,red,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026287",
  "ninePool": [
    "虎",
    "狗",
    "鸡",
    "兔",
    "龙",
    "马",
    "猴",
    "猪",
    "羊"
  ],
  "sixPool": [
    "虎",
    "狗",
    "鸡",
    "兔",
    "龙",
    "马"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "numbers": [
    17,
    41,
    21,
    33,
    10,
    22,
    34,
    4,
    28,
    40,
    3,
    27,
    1,
    13,
    37,
    5
  ],
  "supplement": [
    5
  ],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "狗",
      "虎",
      "鸡"
    ],
    "4": [
      "狗",
      "虎",
      "鸡",
      "马"
    ],
    "5": [
      "狗",
      "虎",
      "鸡",
      "马",
      "兔"
    ],
    "7": [
      "虎",
      "狗",
      "鸡",
      "兔",
      "龙",
      "马",
      "猴"
    ],
    "8": [
      "虎",
      "狗",
      "鸡",
      "兔",
      "龙",
      "马",
      "猴",
      "猪"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 50.0,
  "votes": {
    "虎": 4.5,
    "兔": 3.0,
    "龙": 3.0,
    "蛇": 2.0,
    "马": 3.0,
    "羊": 2.0,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 4.5,
    "猪": 2.5,
    "鼠": 1.0
  }
};