var ensembleData = {
  "time": "2026-07-01 21:32:32",
  "issue": "2026182",
  "code": "15,23,09,45,24,39,41",
  "zodiac": "龙,猴,狗,狗,羊,龙,虎",
  "wave": "blue,red,blue,red,red,green,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026183",
  "ninePool": [
    "狗",
    "兔",
    "鼠",
    "牛",
    "猴",
    "猪",
    "马",
    "龙",
    "羊"
  ],
  "sixPool": [
    "狗",
    "兔",
    "鼠",
    "牛",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "蛇",
    "虎"
  ],
  "numbers": [
    33,
    4,
    6,
    40,
    9,
    42,
    45,
    16,
    18,
    21,
    28,
    30,
    35,
    8,
    32,
    44
  ],
  "pools": {
    "3": [
      "兔",
      "狗",
      "牛"
    ],
    "4": [
      "狗",
      "兔",
      "鼠",
      "牛"
    ],
    "5": [
      "狗",
      "兔",
      "鼠",
      "牛",
      "猴"
    ],
    "7": [
      "狗",
      "兔",
      "鼠",
      "牛",
      "猴",
      "猪",
      "马"
    ],
    "8": [
      "狗",
      "兔",
      "鼠",
      "牛",
      "猴",
      "猪",
      "马",
      "龙"
    ]
  },
  "dynamicRate9": 77.14285714285715,
  "dynamicRate6": 62.857142857142854,
  "votes": {
    "猴": 3,
    "猪": 2,
    "马": 2,
    "狗": 4,
    "鼠": 3,
    "羊": 2,
    "兔": 4,
    "鸡": 2,
    "牛": 3,
    "龙": 2,
    "虎": 1,
    "蛇": 1
  }
};