var ensembleData = {
  "time": "2026-10-27 21:32:32",
  "issue": "2026300",
  "code": "01,29,23,17,18,42,38",
  "zodiac": "马,虎,猴,虎,牛,牛,蛇",
  "wave": "red,red,red,green,red,blue,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026301",
  "ninePool": [
    "牛",
    "羊",
    "鸡",
    "兔",
    "龙",
    "猴",
    "鼠",
    "虎",
    "狗"
  ],
  "sixPool": [
    "牛",
    "羊",
    "鸡",
    "兔",
    "龙",
    "猴"
  ],
  "killZodiacs": [
    "猪",
    "蛇"
  ],
  "numbers": [
    11,
    24,
    34,
    4,
    15,
    35,
    6,
    36,
    46,
    16,
    27,
    47,
    18,
    48,
    28,
    39
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "牛",
      "羊",
      "猴"
    ],
    "4": [
      "牛",
      "羊",
      "猴",
      "鸡"
    ],
    "5": [
      "牛",
      "羊",
      "猴",
      "鸡",
      "兔"
    ],
    "7": [
      "牛",
      "羊",
      "鸡",
      "兔",
      "龙",
      "猴",
      "鼠"
    ],
    "8": [
      "牛",
      "羊",
      "鸡",
      "兔",
      "龙",
      "猴",
      "鼠",
      "虎"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 44.0,
  "votes": {
    "牛": 3.5,
    "虎": 2.0,
    "兔": 3.0,
    "龙": 3.0,
    "蛇": 2.0,
    "马": 2.0,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 3.0,
    "鼠": 2.5,
    "狗": 2.0,
    "猪": 1.0
  }
};