var ensembleData = {
  "time": "2026-05-28 21:32:32",
  "issue": "2026148",
  "code": "28,24,31,23,04,27,48",
  "zodiac": "兔,羊,鼠,猴,兔,龙,羊",
  "wave": "green,red,blue,red,blue,green,blue",
  "teSx": "羊",
  "teWei": 8,
  "nextIssue": "2026149",
  "ninePool": [
    "兔",
    "龙",
    "猪",
    "鼠",
    "蛇",
    "鸡",
    "猴",
    "马",
    "狗"
  ],
  "sixPool": [
    "兔",
    "龙",
    "猪",
    "鼠",
    "蛇",
    "鸡"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "rangeZodiacs": [
    "兔",
    "龙",
    "猪",
    "鼠",
    "蛇",
    "鸡",
    "猴",
    "马",
    "狗"
  ],
  "numbers": [
    28,
    27,
    8,
    7,
    38,
    10,
    40,
    20,
    31,
    32,
    2,
    22
  ],
  "zodiacNumMap": {
    "兔": [
      28,
      40
    ],
    "龙": [
      27
    ],
    "猪": [
      8,
      20,
      32
    ],
    "鼠": [
      7,
      31
    ],
    "蛇": [
      38,
      2
    ],
    "鸡": [
      10,
      22
    ]
  },
  "top7Tails": [
    0,
    1,
    7,
    8,
    2,
    5,
    6
  ],
  "votes9": {
    "鸡": 3,
    "龙": 4,
    "蛇": 4,
    "兔": 4,
    "马": 3,
    "鼠": 4,
    "猪": 4,
    "猴": 3,
    "狗": 3,
    "虎": 1,
    "牛": 2,
    "羊": 1
  },
  "votes6": {
    "鸡": 2,
    "龙": 4,
    "蛇": 3,
    "兔": 4,
    "马": 1,
    "鼠": 3,
    "猪": 3,
    "猴": 1,
    "虎": 1,
    "牛": 2
  }
};