var ensembleData = {
  "time": "2026-07-19 21:32:32",
  "issue": "2026200",
  "code": "43,46,05,32,35,29,39",
  "zodiac": "鼠,鸡,虎,猪,猴,虎,龙",
  "wave": "green,red,green,green,red,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026201",
  "ninePool": [
    "鼠",
    "羊",
    "猴",
    "虎",
    "鸡",
    "兔",
    "牛",
    "狗",
    "马"
  ],
  "sixPool": [
    "鼠",
    "羊",
    "猴",
    "虎",
    "兔",
    "鸡"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "numbers": [
    40,
    10,
    12,
    22,
    43,
    23,
    24,
    4,
    34,
    36,
    16,
    46,
    48,
    28,
    19,
    29
  ],
  "supplement": [],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "鼠",
      "羊",
      "牛"
    ],
    "4": [
      "鼠",
      "羊",
      "牛",
      "猴"
    ],
    "5": [
      "鼠",
      "羊",
      "牛",
      "猴",
      "兔"
    ],
    "7": [
      "鼠",
      "羊",
      "猴",
      "虎",
      "鸡",
      "兔",
      "牛"
    ],
    "8": [
      "鼠",
      "羊",
      "猴",
      "虎",
      "鸡",
      "兔",
      "牛",
      "狗"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "猴": 3.0,
    "鸡": 3.0,
    "狗": 2.0,
    "猪": 1.0,
    "鼠": 3.5,
    "牛": 3.0,
    "虎": 3.0,
    "兔": 3.0,
    "龙": 2.0,
    "羊": 3.5,
    "马": 2.0,
    "蛇": 1.0
  }
};