var ensembleData = {
  "time": "2026-07-29 21:32:32",
  "issue": "2026210",
  "code": "40,37,15,17,42,48,49",
  "zodiac": "兔,马,龙,虎,牛,羊,马",
  "wave": "red,blue,blue,green,blue,blue,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026211",
  "ninePool": [
    "虎",
    "龙",
    "兔",
    "猴",
    "羊",
    "牛",
    "鼠",
    "狗",
    "鸡"
  ],
  "sixPool": [
    "虎",
    "龙",
    "兔",
    "猴",
    "羊",
    "牛"
  ],
  "killZodiacs": [
    "兔",
    "马"
  ],
  "numbers": [
    40,
    30,
    41,
    11,
    12,
    42,
    3,
    23,
    4,
    24,
    17,
    27,
    47,
    28,
    48,
    18
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "猴",
      "兔"
    ],
    "4": [
      "龙",
      "猴",
      "兔",
      "虎"
    ],
    "5": [
      "龙",
      "猴",
      "兔",
      "虎",
      "鼠"
    ],
    "7": [
      "虎",
      "龙",
      "兔",
      "猴",
      "羊",
      "牛",
      "鼠"
    ],
    "8": [
      "虎",
      "龙",
      "兔",
      "猴",
      "羊",
      "牛",
      "鼠",
      "狗"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "虎": 4.5,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 1.0,
    "羊": 3.5,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 3.0,
    "鼠": 3.5,
    "牛": 3.5
  }
};