var ensembleData = {
  "time": "2026-08-08 21:32:32",
  "issue": "2026220",
  "code": "27,39,04,12,38,25,48",
  "zodiac": "龙,龙,兔,羊,蛇,马,羊",
  "wave": "green,green,blue,red,green,blue,blue",
  "teSx": "羊",
  "teWei": 8,
  "nextIssue": "2026221",
  "ninePool": [
    "牛",
    "鼠",
    "兔",
    "蛇",
    "马",
    "狗",
    "猪",
    "鸡",
    "猴"
  ],
  "sixPool": [
    "牛",
    "鼠",
    "兔",
    "蛇",
    "马",
    "狗"
  ],
  "killZodiacs": [
    "牛",
    "羊"
  ],
  "numbers": [
    30,
    40,
    31,
    1,
    21,
    42,
    2,
    43,
    13,
    33,
    4,
    14,
    25,
    45,
    6,
    16
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    5,
    6
  ],
  "pools": {
    "3": [
      "鼠",
      "牛",
      "兔"
    ],
    "4": [
      "鼠",
      "牛",
      "兔",
      "狗"
    ],
    "5": [
      "鼠",
      "牛",
      "兔",
      "狗",
      "蛇"
    ],
    "7": [
      "牛",
      "鼠",
      "兔",
      "蛇",
      "马",
      "狗",
      "猪"
    ],
    "8": [
      "牛",
      "鼠",
      "兔",
      "蛇",
      "马",
      "狗",
      "猪",
      "鸡"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "蛇": 3.0,
    "马": 3.0,
    "羊": 1.0,
    "猴": 2.0,
    "鸡": 2.0,
    "狗": 3.0,
    "猪": 3.0,
    "鼠": 4.5,
    "牛": 4.5,
    "兔": 3.5,
    "龙": 1.0,
    "虎": 1.0
  }
};