var ensembleData = {
  "time": "2026-06-14 21:32:32",
  "issue": "2026165",
  "code": "11,47,09,49,02,01,03",
  "zodiac": "猴,猴,狗,马,蛇,马,龙",
  "wave": "green,blue,blue,green,red,red,blue",
  "teSx": "龙",
  "teWei": 3,
  "nextIssue": "2026166",
  "ninePool": [
    "猴",
    "羊",
    "兔",
    "蛇",
    "鸡",
    "牛",
    "马",
    "虎",
    "鼠"
  ],
  "sixPool": [
    "猴",
    "羊",
    "兔",
    "蛇",
    "鸡",
    "牛"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "numbers": [
    40,
    16,
    2,
    47,
    35,
    11,
    23,
    36,
    12,
    24,
    48,
    28,
    4,
    38,
    14,
    26
  ],
  "supplement": [],
  "optTails": [
    9,
    6,
    1,
    4,
    8,
    5,
    2
  ],
  "pools": {
    "3": [
      "猴",
      "羊",
      "兔"
    ],
    "4": [
      "猴",
      "羊",
      "兔",
      "蛇"
    ],
    "5": [
      "猴",
      "羊",
      "兔",
      "蛇",
      "鸡"
    ],
    "7": [
      "猴",
      "羊",
      "兔",
      "蛇",
      "鸡",
      "牛",
      "马"
    ],
    "8": [
      "猴",
      "羊",
      "兔",
      "蛇",
      "鸡",
      "牛",
      "马",
      "虎"
    ]
  },
  "dynamicRate9": 72.22222222222221,
  "dynamicRate6": 61.111111111111114,
  "votes": {
    "蛇": 3,
    "马": 2,
    "羊": 4,
    "猴": 4,
    "鸡": 3,
    "狗": 1,
    "猪": 2,
    "鼠": 2,
    "牛": 3,
    "虎": 2,
    "兔": 3,
    "龙": 1
  }
};