var ensembleData = {
  "time": "2026-09-30 21:32:32",
  "issue": "2026273",
  "code": "30,03,25,28,06,17,05",
  "zodiac": "牛,龙,马,兔,牛,虎,虎",
  "wave": "red,blue,blue,green,green,green,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026274",
  "ninePool": [
    "马",
    "兔",
    "鸡",
    "狗",
    "猪",
    "虎",
    "龙",
    "蛇",
    "猴"
  ],
  "sixPool": [
    "马",
    "兔",
    "鸡",
    "狗",
    "猪",
    "虎"
  ],
  "killZodiacs": [
    "牛",
    "虎"
  ],
  "numbers": [
    40,
    10,
    20,
    1,
    21,
    41,
    22,
    32,
    13,
    33,
    4,
    34,
    44,
    25,
    45,
    5
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    5,
    6
  ],
  "pools": {
    "3": [
      "兔",
      "马",
      "鸡"
    ],
    "4": [
      "兔",
      "马",
      "鸡",
      "狗"
    ],
    "5": [
      "兔",
      "马",
      "鸡",
      "狗",
      "猪"
    ],
    "7": [
      "马",
      "兔",
      "鸡",
      "狗",
      "猪",
      "虎",
      "龙"
    ],
    "8": [
      "马",
      "兔",
      "鸡",
      "狗",
      "猪",
      "虎",
      "龙",
      "蛇"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "牛": 2.0,
    "虎": 3.5,
    "兔": 4.5,
    "龙": 3.0,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 2.0,
    "猴": 2.0,
    "鸡": 4.5,
    "狗": 3.5,
    "猪": 3.5
  }
};