var ensembleData = {
  "time": "2026-10-12 21:32:32",
  "issue": "2026285",
  "code": "46,45,43,39,20,40,19",
  "zodiac": "鸡,狗,鼠,龙,猪,兔,鼠",
  "wave": "red,red,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026286",
  "ninePool": [
    "兔",
    "马",
    "牛",
    "龙",
    "蛇",
    "狗",
    "鸡",
    "猴",
    "虎"
  ],
  "sixPool": [
    "兔",
    "马",
    "牛",
    "龙",
    "蛇",
    "狗"
  ],
  "killZodiacs": [
    "羊",
    "鼠"
  ],
  "numbers": [
    40,
    30,
    1,
    21,
    42,
    2,
    13,
    3,
    33,
    25,
    15,
    45,
    16,
    6,
    26,
    37
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    5,
    6,
    7
  ],
  "pools": {
    "3": [
      "马",
      "牛",
      "兔"
    ],
    "4": [
      "马",
      "牛",
      "兔",
      "蛇"
    ],
    "5": [
      "马",
      "牛",
      "兔",
      "蛇",
      "龙"
    ],
    "7": [
      "兔",
      "马",
      "牛",
      "龙",
      "蛇",
      "狗",
      "鸡"
    ],
    "8": [
      "兔",
      "马",
      "牛",
      "龙",
      "蛇",
      "狗",
      "鸡",
      "猴"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 52.0,
  "votes": {
    "猪": 1.0,
    "鼠": 2.0,
    "牛": 4.5,
    "虎": 2.0,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 4.5,
    "马": 4.5,
    "羊": 1.0,
    "猴": 3.5,
    "鸡": 3.5,
    "狗": 3.5
  }
};