var ensembleData = {
  "time": "2026-10-09 21:32:32",
  "issue": "2026282",
  "code": "44,03,37,46,29,20,23",
  "zodiac": "猪,龙,马,鸡,虎,猪,猴",
  "wave": "green,blue,blue,red,red,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026283",
  "ninePool": [
    "狗",
    "兔",
    "猴",
    "猪",
    "龙",
    "羊",
    "虎",
    "鸡",
    "马"
  ],
  "sixPool": [
    "狗",
    "兔",
    "猴",
    "猪",
    "龙",
    "羊"
  ],
  "killZodiacs": [
    "牛",
    "猴"
  ],
  "numbers": [
    40,
    20,
    21,
    11,
    32,
    12,
    33,
    23,
    3,
    4,
    44,
    24,
    45,
    35,
    15,
    16
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    5,
    6
  ],
  "pools": {
    "3": [
      "兔",
      "狗",
      "猴"
    ],
    "4": [
      "兔",
      "狗",
      "猴",
      "龙"
    ],
    "5": [
      "兔",
      "狗",
      "猴",
      "龙",
      "猪"
    ],
    "7": [
      "狗",
      "兔",
      "猴",
      "猪",
      "龙",
      "羊",
      "虎"
    ],
    "8": [
      "狗",
      "兔",
      "猴",
      "猪",
      "龙",
      "羊",
      "虎",
      "鸡"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 54.0,
  "votes": {
    "虎": 3.0,
    "兔": 4.5,
    "龙": 3.5,
    "蛇": 1.0,
    "马": 2.0,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 3.5,
    "牛": 1.0,
    "鼠": 1.0
  }
};