var ensembleData = {
  "time": "2026-06-19 21:32:32",
  "issue": "2026170",
  "code": "27,46,06,38,20,34,03",
  "zodiac": "龙,鸡,牛,蛇,猪,鸡,龙",
  "wave": "green,red,green,green,blue,red,blue",
  "teSx": "龙",
  "teWei": 3,
  "nextIssue": "2026171",
  "ninePool": [
    "兔",
    "猴",
    "虎",
    "蛇",
    "猪",
    "牛",
    "马",
    "龙",
    "鸡"
  ],
  "sixPool": [
    "兔",
    "猴",
    "虎",
    "蛇",
    "猪",
    "牛"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "numbers": [
    2,
    8,
    32,
    6,
    28,
    4,
    40,
    16,
    47,
    35,
    11,
    23,
    17,
    29,
    5,
    41
  ],
  "supplement": [],
  "optTails": [
    9,
    6,
    4,
    8,
    3,
    2,
    0
  ],
  "pools": {
    "3": [
      "兔",
      "猴",
      "虎"
    ],
    "4": [
      "兔",
      "猴",
      "虎",
      "蛇"
    ],
    "5": [
      "兔",
      "猴",
      "虎",
      "蛇",
      "猪"
    ],
    "7": [
      "兔",
      "猴",
      "虎",
      "蛇",
      "猪",
      "牛",
      "马"
    ],
    "8": [
      "兔",
      "猴",
      "虎",
      "蛇",
      "猪",
      "牛",
      "马",
      "龙"
    ]
  },
  "dynamicRate9": 73.91304347826086,
  "dynamicRate6": 65.21739130434783,
  "votes": {
    "猪": 3,
    "鼠": 1,
    "牛": 3,
    "虎": 3,
    "兔": 4,
    "龙": 3,
    "蛇": 3,
    "马": 3,
    "羊": 2,
    "鸡": 2,
    "猴": 3,
    "狗": 2
  }
};