var ensembleData = {
  "time": "2026-06-24 21:32:32",
  "issue": "2026175",
  "code": "07,19,30,29,28,25,26",
  "zodiac": "鼠,鼠,牛,虎,兔,马,蛇",
  "wave": "red,red,red,red,green,blue,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026176",
  "ninePool": [
    "猴",
    "狗",
    "羊",
    "龙",
    "马",
    "鸡",
    "兔",
    "牛",
    "鼠"
  ],
  "sixPool": [
    "猴",
    "狗",
    "羊",
    "龙",
    "马",
    "鸡"
  ],
  "killZodiacs": [
    "鸡",
    "蛇"
  ],
  "numbers": [
    3,
    24,
    15,
    47,
    35,
    11,
    23,
    33,
    9,
    45,
    21,
    36,
    12,
    48,
    27,
    39
  ],
  "supplement": [],
  "optTails": [
    9,
    6,
    1,
    4,
    3,
    7,
    0
  ],
  "pools": {
    "3": [
      "猴",
      "狗",
      "羊"
    ],
    "4": [
      "猴",
      "狗",
      "羊",
      "龙"
    ],
    "5": [
      "猴",
      "狗",
      "羊",
      "龙",
      "马"
    ],
    "7": [
      "猴",
      "狗",
      "羊",
      "龙",
      "马",
      "鸡",
      "兔"
    ],
    "8": [
      "猴",
      "狗",
      "羊",
      "龙",
      "马",
      "鸡",
      "兔",
      "牛"
    ]
  },
  "dynamicRate9": 75.0,
  "dynamicRate6": 60.71428571428571,
  "votes": {
    "兔": 3,
    "龙": 4,
    "蛇": 1,
    "马": 3,
    "羊": 4,
    "猴": 4,
    "鸡": 3,
    "狗": 4,
    "猪": 1,
    "牛": 2,
    "鼠": 2,
    "虎": 1
  }
};