var ensembleData = {
  "time": "2026-09-01 21:32:32",
  "issue": "2026244",
  "code": "09,14,03,17,33,40,46",
  "zodiac": "狗,蛇,龙,虎,狗,兔,鸡",
  "wave": "blue,blue,blue,green,green,red,red",
  "teSx": "鸡",
  "teWei": 6,
  "nextIssue": "2026245",
  "ninePool": [
    "龙",
    "兔",
    "马",
    "狗",
    "猴",
    "蛇",
    "鼠",
    "猪",
    "牛"
  ],
  "sixPool": [
    "龙",
    "兔",
    "马",
    "狗",
    "猴",
    "蛇"
  ],
  "killZodiacs": [
    "虎",
    "鸡"
  ],
  "numbers": [
    1,
    21,
    11,
    2,
    3,
    13,
    33,
    23,
    4,
    14,
    16,
    26,
    27,
    37,
    47,
    28
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "兔",
      "马"
    ],
    "4": [
      "龙",
      "兔",
      "马",
      "狗"
    ],
    "5": [
      "龙",
      "兔",
      "马",
      "狗",
      "猴"
    ],
    "7": [
      "龙",
      "兔",
      "马",
      "狗",
      "猴",
      "蛇",
      "鼠"
    ],
    "8": [
      "龙",
      "兔",
      "马",
      "狗",
      "猴",
      "蛇",
      "鼠",
      "猪"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0,
  "votes": {
    "狗": 3.5,
    "猪": 3.0,
    "鼠": 3.0,
    "牛": 2.0,
    "虎": 2.0,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 3.0,
    "马": 4.5,
    "猴": 3.5,
    "鸡": 1.5,
    "羊": 1.0
  }
};