var ensembleData = {
  "time": "2026-06-09 21:32:32",
  "issue": "2026160",
  "code": "08,16,26,01,29,30,02",
  "zodiac": "猪,兔,蛇,马,虎,牛,蛇",
  "wave": "red,green,blue,red,red,red,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026161",
  "ninePool": [
    "猴",
    "虎",
    "猪",
    "鸡",
    "羊",
    "狗",
    "马",
    "兔",
    "牛"
  ],
  "sixPool": [
    "猴",
    "虎",
    "猪",
    "鸡",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "鼠",
    "蛇"
  ],
  "numbers": [
    20,
    10,
    11,
    41,
    21,
    32,
    22,
    12,
    23,
    33,
    44,
    34,
    24,
    46,
    36,
    8
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "虎",
      "猪"
    ],
    "4": [
      "猴",
      "虎",
      "猪",
      "鸡"
    ],
    "5": [
      "猴",
      "虎",
      "猪",
      "鸡",
      "羊"
    ],
    "7": [
      "猴",
      "虎",
      "猪",
      "鸡",
      "羊",
      "狗",
      "马"
    ],
    "8": [
      "猴",
      "虎",
      "猪",
      "鸡",
      "羊",
      "狗",
      "马",
      "兔"
    ]
  },
  "dynamicRate9": 76.92307692307693,
  "dynamicRate6": 61.53846153846154,
  "votes": {
    "虎": 4,
    "兔": 2,
    "龙": 1,
    "蛇": 1,
    "马": 3,
    "羊": 3,
    "猴": 4,
    "鸡": 3,
    "狗": 3,
    "猪": 3,
    "牛": 2,
    "鼠": 2
  }
};