var ensembleData = {
  "time": "2026-10-06 21:32:32",
  "issue": "2026279",
  "code": "29,32,47,38,06,26,10",
  "zodiac": "虎,猪,猴,蛇,牛,蛇,鸡",
  "wave": "red,green,blue,green,green,blue,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026280",
  "ninePool": [
    "兔",
    "虎",
    "猪",
    "狗",
    "牛",
    "羊",
    "马",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "兔",
    "虎",
    "猪",
    "狗",
    "牛",
    "羊"
  ],
  "killZodiacs": [
    "猴",
    "鸡"
  ],
  "numbers": [
    41,
    21,
    33,
    4,
    44,
    24,
    5,
    45,
    16,
    6,
    36,
    17,
    28,
    8,
    18,
    48
  ],
  "supplement": [],
  "optTails": [
    1,
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "兔",
      "虎",
      "猪"
    ],
    "4": [
      "兔",
      "虎",
      "猪",
      "狗"
    ],
    "5": [
      "兔",
      "虎",
      "猪",
      "狗",
      "羊"
    ],
    "7": [
      "兔",
      "虎",
      "猪",
      "狗",
      "牛",
      "羊",
      "马"
    ],
    "8": [
      "兔",
      "虎",
      "猪",
      "狗",
      "牛",
      "羊",
      "马",
      "龙"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "牛": 3.0,
    "虎": 4.5,
    "兔": 4.5,
    "龙": 2.0,
    "蛇": 2.0,
    "马": 3.0,
    "羊": 3.0,
    "猴": 2.0,
    "鸡": 1.0,
    "猪": 3.5,
    "狗": 3.5,
    "鼠": 1.0
  }
};