var ensembleData = {
  "time": "2026-07-13 21:32:32",
  "issue": "2026194",
  "code": "30,21,22,15,04,34,26",
  "zodiac": "牛,狗,鸡,龙,兔,鸡,蛇",
  "wave": "red,green,green,blue,blue,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026195",
  "ninePool": [
    "鸡",
    "兔",
    "狗",
    "猪",
    "牛",
    "龙",
    "羊",
    "虎",
    "马"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "狗",
    "猪",
    "牛",
    "龙"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "numbers": [
    33,
    34,
    4,
    40,
    9,
    10,
    45,
    46,
    16,
    21,
    22,
    28,
    20,
    30,
    42,
    27
  ],
  "pools": {
    "3": [
      "鸡",
      "兔",
      "狗"
    ],
    "4": [
      "鸡",
      "兔",
      "狗",
      "猪"
    ],
    "5": [
      "鸡",
      "兔",
      "狗",
      "猪",
      "牛"
    ],
    "7": [
      "鸡",
      "兔",
      "狗",
      "猪",
      "牛",
      "龙",
      "羊"
    ],
    "8": [
      "鸡",
      "兔",
      "狗",
      "猪",
      "牛",
      "龙",
      "羊",
      "虎"
    ]
  },
  "dynamicRate9": 76.59574468085107,
  "dynamicRate6": 63.829787234042556,
  "votes": {
    "猪": 3,
    "牛": 3,
    "鸡": 4,
    "兔": 4,
    "羊": 2,
    "猴": 1,
    "龙": 3,
    "马": 2,
    "狗": 4,
    "虎": 2,
    "蛇": 1,
    "鼠": 1
  }
};