var ensembleData = {
  "time": "2026-08-30 21:32:32",
  "issue": "2026242",
  "code": "29,35,46,32,13,31,09",
  "zodiac": "虎,猴,鸡,猪,马,鼠,狗",
  "wave": "red,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026243",
  "ninePool": [
    "鼠",
    "狗",
    "龙",
    "虎",
    "鸡",
    "猴",
    "羊",
    "猪",
    "马"
  ],
  "sixPool": [
    "鼠",
    "狗",
    "龙",
    "虎",
    "鸡",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "狗"
  ],
  "numbers": [
    31,
    21,
    41,
    22,
    12,
    34,
    24,
    45,
    15,
    5,
    46,
    36,
    48,
    19,
    9,
    39
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "鼠",
      "狗",
      "虎"
    ],
    "4": [
      "鼠",
      "狗",
      "虎",
      "龙"
    ],
    "5": [
      "鼠",
      "狗",
      "虎",
      "龙",
      "羊"
    ],
    "7": [
      "鼠",
      "狗",
      "龙",
      "虎",
      "鸡",
      "猴",
      "羊"
    ],
    "8": [
      "鼠",
      "狗",
      "龙",
      "虎",
      "鸡",
      "猴",
      "羊",
      "猪"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0,
  "votes": {
    "马": 2.0,
    "羊": 3.0,
    "猴": 3.0,
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 2.0,
    "鼠": 4.5,
    "牛": 1.0,
    "虎": 3.5,
    "龙": 3.5,
    "兔": 2.0,
    "蛇": 1.0
  }
};