var ensembleData = {
  "time": "2026-10-16 21:32:32",
  "issue": "2026289",
  "code": "12,29,19,28,47,34,38",
  "zodiac": "羊,虎,鼠,兔,猴,鸡,蛇",
  "wave": "red,red,red,green,blue,red,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026290",
  "ninePool": [
    "狗",
    "鼠",
    "虎",
    "兔",
    "鸡",
    "牛",
    "马",
    "猪",
    "龙"
  ],
  "sixPool": [
    "狗",
    "鼠",
    "虎",
    "兔",
    "鸡",
    "牛"
  ],
  "killZodiacs": [
    "猪",
    "蛇"
  ],
  "numbers": [
    21,
    31,
    41,
    4,
    34,
    45,
    5,
    16,
    46,
    6,
    7,
    17,
    28,
    18,
    9,
    19
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "狗",
      "虎",
      "鼠"
    ],
    "4": [
      "狗",
      "虎",
      "鼠",
      "兔"
    ],
    "5": [
      "狗",
      "虎",
      "鼠",
      "兔",
      "鸡"
    ],
    "7": [
      "狗",
      "鼠",
      "虎",
      "兔",
      "鸡",
      "牛",
      "马"
    ],
    "8": [
      "狗",
      "鼠",
      "虎",
      "兔",
      "鸡",
      "牛",
      "马",
      "猪"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 48.0,
  "votes": {
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 2.0,
    "鼠": 4.5,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 3.0,
    "龙": 2.0,
    "蛇": 1.0,
    "马": 2.5,
    "猴": 2.0,
    "羊": 1.0
  }
};