var ensembleData = {
  "time": "2026-08-04 21:32:32",
  "issue": "2026216",
  "code": "18,41,32,44,36,45,37",
  "zodiac": "牛,虎,猪,猪,羊,狗,马",
  "wave": "red,blue,green,green,blue,red,blue",
  "teSx": "马",
  "teWei": 7,
  "nextIssue": "2026217",
  "ninePool": [
    "鸡",
    "狗",
    "羊",
    "猴",
    "龙",
    "猪",
    "兔",
    "鼠",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "羊",
    "猴",
    "龙",
    "猪"
  ],
  "killZodiacs": [
    "猪",
    "马"
  ],
  "numbers": [
    21,
    11,
    34,
    24,
    44,
    45,
    35,
    15,
    46,
    36,
    47,
    27,
    48,
    8,
    9,
    39
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "鸡",
      "狗"
    ],
    "4": [
      "羊",
      "鸡",
      "狗",
      "猴"
    ],
    "5": [
      "羊",
      "鸡",
      "狗",
      "猴",
      "龙"
    ],
    "7": [
      "鸡",
      "狗",
      "羊",
      "猴",
      "龙",
      "猪",
      "兔"
    ],
    "8": [
      "鸡",
      "狗",
      "羊",
      "猴",
      "龙",
      "猪",
      "兔",
      "鼠"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 60.0,
  "votes": {
    "羊": 4.5,
    "猴": 4.5,
    "鸡": 4.5,
    "狗": 4.5,
    "猪": 3.0,
    "鼠": 2.0,
    "牛": 2.0,
    "虎": 2.0,
    "兔": 3.0,
    "龙": 3.5,
    "蛇": 1.0
  }
};