var ensembleData = {
  "time": "2026-07-31 21:32:32",
  "issue": "2026212",
  "code": "43,32,16,39,19,27,06",
  "zodiac": "鼠,猪,兔,龙,鼠,龙,牛",
  "wave": "green,green,green,green,red,green,green",
  "teSx": "牛",
  "teWei": 6,
  "nextIssue": "2026213",
  "ninePool": [
    "龙",
    "兔",
    "鼠",
    "马",
    "猴",
    "虎",
    "蛇",
    "牛",
    "狗"
  ],
  "sixPool": [
    "龙",
    "兔",
    "鼠",
    "马",
    "猴",
    "虎"
  ],
  "killZodiacs": [
    "猴",
    "牛"
  ],
  "numbers": [
    31,
    1,
    11,
    41,
    3,
    43,
    13,
    23,
    4,
    15,
    25,
    35,
    5,
    16,
    27,
    7
  ],
  "supplement": [],
  "optTails": [
    1,
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "兔",
      "鼠"
    ],
    "4": [
      "龙",
      "兔",
      "鼠",
      "马"
    ],
    "5": [
      "龙",
      "兔",
      "鼠",
      "马",
      "猴"
    ],
    "7": [
      "龙",
      "兔",
      "鼠",
      "马",
      "猴",
      "虎",
      "蛇"
    ],
    "8": [
      "龙",
      "兔",
      "鼠",
      "马",
      "猴",
      "虎",
      "蛇",
      "牛"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "鼠": 4.5,
    "牛": 2.0,
    "虎": 3.0,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 2.0,
    "猴": 3.5,
    "鸡": 1.0,
    "狗": 2.0
  }
};