var ensembleData = {
  "time": "2026-07-26 21:32:32",
  "issue": "2026207",
  "code": "09,40,26,23,44,13,31",
  "zodiac": "狗,兔,蛇,猴,猪,马,鼠",
  "wave": "blue,red,blue,red,green,red,blue",
  "teSx": "鼠",
  "teWei": 1,
  "nextIssue": "2026208",
  "ninePool": [
    "蛇",
    "龙",
    "牛",
    "鸡",
    "羊",
    "马",
    "兔",
    "狗",
    "虎"
  ],
  "sixPool": [
    "蛇",
    "龙",
    "牛",
    "鸡",
    "羊",
    "马"
  ],
  "killZodiacs": [
    "鼠",
    "鼠"
  ],
  "numbers": [
    30,
    10,
    1,
    2,
    42,
    22,
    12,
    3,
    13,
    14,
    34,
    24,
    26,
    6,
    46,
    36
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "蛇",
      "鸡"
    ],
    "4": [
      "龙",
      "蛇",
      "鸡",
      "牛"
    ],
    "5": [
      "龙",
      "蛇",
      "鸡",
      "牛",
      "羊"
    ],
    "7": [
      "蛇",
      "龙",
      "牛",
      "鸡",
      "羊",
      "马",
      "兔"
    ],
    "8": [
      "蛇",
      "龙",
      "牛",
      "鸡",
      "羊",
      "马",
      "兔",
      "狗"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 62.0,
  "votes": {
    "鼠": 1.0,
    "牛": 3.5,
    "虎": 2.0,
    "兔": 3.0,
    "龙": 4.5,
    "蛇": 4.5,
    "马": 3.0,
    "羊": 3.0,
    "猴": 2.0,
    "鸡": 3.5,
    "狗": 2.0,
    "猪": 1.0
  }
};