var ensembleData = {
  "time": "2026-06-04 21:32:32",
  "issue": "2026155",
  "code": "21,37,46,13,40,47,07",
  "zodiac": "狗,马,鸡,马,兔,猴,鼠",
  "wave": "green,blue,red,red,red,blue,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026156",
  "ninePool": [
    "鸡",
    "兔",
    "马",
    "羊",
    "牛",
    "猴",
    "蛇",
    "龙",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "马",
    "猴",
    "兔",
    "蛇"
  ],
  "killZodiacs": [
    "兔",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "兔",
    "马",
    "羊",
    "牛",
    "猴",
    "蛇",
    "龙",
    "猪"
  ],
  "numbers": [
    10,
    6,
    13,
    23,
    4,
    14,
    30,
    40,
    34,
    46,
    16,
    26
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34,
      46
    ],
    "牛": [
      6,
      30
    ],
    "马": [
      13
    ],
    "猴": [
      23
    ],
    "兔": [
      4,
      40,
      16
    ],
    "蛇": [
      14,
      26
    ]
  },
  "top7Tails": [
    0,
    4,
    6,
    2,
    3,
    7,
    8
  ],
  "votes9": {
    "鸡": 4,
    "猴": 3,
    "龙": 3,
    "马": 4,
    "羊": 4,
    "狗": 3,
    "兔": 4,
    "蛇": 3,
    "猪": 3,
    "牛": 3,
    "鼠": 1,
    "虎": 1
  },
  "votes6": {
    "鸡": 4,
    "猴": 2,
    "龙": 2,
    "马": 3,
    "羊": 2,
    "狗": 2,
    "牛": 3,
    "蛇": 2,
    "猪": 1,
    "鼠": 1,
    "兔": 2
  }
};