var ensembleData = {
  "time": "2026-07-04 21:32:32",
  "issue": "2026185",
  "code": "18,35,09,41,12,30,36",
  "zodiac": "牛,猴,狗,虎,羊,牛,羊",
  "wave": "red,red,blue,blue,red,red,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026186",
  "ninePool": [
    "猪",
    "猴",
    "兔",
    "鼠",
    "鸡",
    "虎",
    "牛",
    "蛇",
    "狗"
  ],
  "sixPool": [
    "猪",
    "猴",
    "兔",
    "鼠",
    "鸡",
    "虎"
  ],
  "killZodiacs": [
    "蛇",
    "羊"
  ],
  "numbers": [
    34,
    35,
    7,
    10,
    11,
    43,
    46,
    47,
    19,
    22,
    23,
    31,
    5,
    16,
    8,
    32
  ],
  "pools": {
    "3": [
      "猴",
      "鸡",
      "鼠"
    ],
    "4": [
      "猪",
      "猴",
      "兔",
      "鼠"
    ],
    "5": [
      "猪",
      "猴",
      "兔",
      "鼠",
      "鸡"
    ],
    "7": [
      "猪",
      "猴",
      "兔",
      "鼠",
      "鸡",
      "虎",
      "牛"
    ],
    "8": [
      "猪",
      "猴",
      "兔",
      "鼠",
      "鸡",
      "虎",
      "牛",
      "蛇"
    ]
  },
  "dynamicRate9": 78.94736842105263,
  "dynamicRate6": 63.1578947368421,
  "votes": {
    "猴": 4,
    "猪": 4,
    "兔": 4,
    "蛇": 2,
    "鸡": 4,
    "鼠": 4,
    "牛": 3,
    "狗": 2,
    "虎": 4,
    "羊": 1,
    "龙": 1
  }
};