var ensembleData = {
  "time": "2026-07-10 21:32:32",
  "issue": "2026191",
  "code": "19,43,39,24,16,26,29",
  "zodiac": "鼠,鼠,龙,羊,兔,蛇,虎",
  "wave": "red,green,green,red,green,blue,red",
  "teSx": "虎",
  "teWei": 9,
  "nextIssue": "2026192",
  "ninePool": [
    "狗",
    "鸡",
    "猪",
    "马",
    "鼠",
    "猴",
    "蛇",
    "兔",
    "羊"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "猪",
    "马",
    "鼠",
    "猴"
  ],
  "killZodiacs": [
    "鸡",
    "虎"
  ],
  "numbers": [
    33,
    34,
    7,
    9,
    10,
    43,
    45,
    46,
    19,
    21,
    22,
    31,
    47,
    20,
    13,
    37
  ],
  "pools": {
    "3": [
      "狗",
      "鸡",
      "鼠"
    ],
    "4": [
      "狗",
      "鸡",
      "猪",
      "马"
    ],
    "5": [
      "狗",
      "鸡",
      "猪",
      "马",
      "鼠"
    ],
    "7": [
      "狗",
      "鸡",
      "猪",
      "马",
      "鼠",
      "猴",
      "蛇"
    ],
    "8": [
      "狗",
      "鸡",
      "猪",
      "马",
      "鼠",
      "猴",
      "蛇",
      "兔"
    ]
  },
  "dynamicRate9": 77.27272727272727,
  "dynamicRate6": 63.63636363636363,
  "votes": {
    "蛇": 3,
    "狗": 4,
    "猪": 3,
    "龙": 1,
    "马": 3,
    "猴": 3,
    "鸡": 4,
    "兔": 3,
    "羊": 2,
    "鼠": 3,
    "虎": 2
  }
};