var ensembleData = {
  "time": "2026-07-18 21:32:32",
  "issue": "2026199",
  "code": "17,49,42,45,05,38,36",
  "zodiac": "虎,马,牛,狗,虎,蛇,羊",
  "wave": "green,green,blue,red,green,green,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026200",
  "ninePool": [
    "鸡",
    "猴",
    "龙",
    "猪",
    "鼠",
    "兔",
    "狗",
    "虎",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "龙",
    "猪",
    "鼠",
    "兔"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "numbers": [
    10,
    20,
    40,
    11,
    31,
    22,
    32,
    23,
    3,
    43,
    34,
    44,
    4,
    47,
    27,
    7
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "鸡",
      "龙"
    ],
    "4": [
      "猴",
      "鸡",
      "龙",
      "猪"
    ],
    "5": [
      "猴",
      "鸡",
      "龙",
      "猪",
      "鼠"
    ],
    "7": [
      "鸡",
      "猴",
      "龙",
      "猪",
      "鼠",
      "兔",
      "狗"
    ],
    "8": [
      "鸡",
      "猴",
      "龙",
      "猪",
      "鼠",
      "兔",
      "狗",
      "虎"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "虎": 2.0,
    "兔": 3.0,
    "龙": 3.5,
    "蛇": 2.0,
    "马": 1.0,
    "羊": 2.0,
    "猴": 4.5,
    "鸡": 4.5,
    "狗": 3.0,
    "猪": 3.5,
    "鼠": 3.5,
    "牛": 2.0
  }
};