var ensembleData = {
  "time": "2026-06-06 21:32:32",
  "issue": "2026157",
  "code": "43,25,11,31,17,10,40",
  "zodiac": "鼠,马,猴,鼠,虎,鸡,兔",
  "wave": "green,blue,green,blue,green,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026158",
  "ninePool": [
    "蛇",
    "鸡",
    "猴",
    "龙",
    "羊",
    "狗",
    "兔",
    "虎",
    "马"
  ],
  "sixPool": [
    "蛇",
    "鸡",
    "猴",
    "龙",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "兔",
    "兔"
  ],
  "numbers": [
    10,
    11,
    21,
    2,
    22,
    12,
    23,
    3,
    33,
    14,
    34,
    24,
    47,
    27,
    38,
    48
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "鸡",
      "猴"
    ],
    "4": [
      "蛇",
      "鸡",
      "猴",
      "龙"
    ],
    "5": [
      "蛇",
      "鸡",
      "猴",
      "龙",
      "羊"
    ],
    "7": [
      "蛇",
      "鸡",
      "猴",
      "龙",
      "羊",
      "狗",
      "兔"
    ],
    "8": [
      "蛇",
      "鸡",
      "猴",
      "龙",
      "羊",
      "狗",
      "兔",
      "虎"
    ]
  },
  "dynamicRate9": 72.72727272727273,
  "dynamicRate6": 63.63636363636363,
  "votes": {
    "虎": 2,
    "兔": 2,
    "龙": 3,
    "蛇": 3,
    "马": 2,
    "羊": 3,
    "猴": 3,
    "鸡": 3,
    "狗": 3,
    "猪": 2,
    "牛": 1,
    "鼠": 1
  }
};