var ensembleData = {
  "time": "2026-08-10 21:32:32",
  "issue": "2026222",
  "code": "49,14,47,27,18,38,26",
  "zodiac": "马,蛇,猴,龙,牛,蛇,蛇",
  "wave": "green,blue,blue,green,red,green,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026223",
  "ninePool": [
    "鸡",
    "牛",
    "兔",
    "龙",
    "猴",
    "狗",
    "鼠",
    "猪",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "兔",
    "龙",
    "猴",
    "狗"
  ],
  "killZodiacs": [
    "虎",
    "蛇"
  ],
  "numbers": [
    11,
    21,
    22,
    42,
    3,
    23,
    33,
    34,
    4,
    46,
    6,
    16,
    27,
    47,
    18,
    28
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "兔",
      "龙"
    ],
    "4": [
      "猴",
      "兔",
      "龙",
      "牛"
    ],
    "5": [
      "猴",
      "兔",
      "龙",
      "牛",
      "鸡"
    ],
    "7": [
      "鸡",
      "牛",
      "兔",
      "龙",
      "猴",
      "狗",
      "鼠"
    ],
    "8": [
      "鸡",
      "牛",
      "兔",
      "龙",
      "猴",
      "狗",
      "鼠",
      "猪"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "牛": 3.0,
    "虎": 2.0,
    "兔": 3.0,
    "龙": 3.0,
    "蛇": 1.0,
    "马": 1.0,
    "羊": 2.0,
    "猴": 3.0,
    "鸡": 3.0,
    "鼠": 2.0,
    "狗": 2.0,
    "猪": 2.0
  }
};