var ensembleData = {
  "time": "2026-08-01 21:32:32",
  "issue": "2026213",
  "code": "09,05,12,22,01,15,35",
  "zodiac": "狗,虎,羊,鸡,马,龙,猴",
  "wave": "blue,green,red,green,red,blue,red",
  "teSx": "猴",
  "teWei": 5,
  "nextIssue": "2026214",
  "ninePool": [
    "鸡",
    "猴",
    "鼠",
    "牛",
    "蛇",
    "虎",
    "羊",
    "马",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "鼠",
    "牛",
    "蛇",
    "虎"
  ],
  "killZodiacs": [
    "猪",
    "猴"
  ],
  "numbers": [
    11,
    31,
    41,
    34,
    14,
    35,
    5,
    46,
    6,
    26,
    47,
    7,
    17,
    18,
    38,
    19
  ],
  "supplement": [],
  "optTails": [
    1,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "pools": {
    "3": [
      "牛",
      "鸡",
      "鼠"
    ],
    "4": [
      "牛",
      "鸡",
      "鼠",
      "猴"
    ],
    "5": [
      "牛",
      "鸡",
      "鼠",
      "猴",
      "蛇"
    ],
    "7": [
      "鸡",
      "猴",
      "鼠",
      "牛",
      "蛇",
      "虎",
      "羊"
    ],
    "8": [
      "鸡",
      "猴",
      "鼠",
      "牛",
      "蛇",
      "虎",
      "羊",
      "马"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "马": 3.0,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 4.5,
    "狗": 2.0,
    "猪": 2.0,
    "鼠": 4.5,
    "牛": 4.5,
    "虎": 3.5,
    "蛇": 3.5,
    "兔": 2.5
  }
};