var ensembleData = {
  "time": "2026-09-16 21:32:32",
  "issue": "2026259",
  "code": "43,33,49,36,19,30,22",
  "zodiac": "鼠,狗,马,羊,鼠,牛,鸡",
  "wave": "green,green,green,blue,red,red,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026260",
  "ninePool": [
    "龙",
    "虎",
    "羊",
    "兔",
    "狗",
    "鼠",
    "牛",
    "蛇",
    "马"
  ],
  "sixPool": [
    "龙",
    "虎",
    "羊",
    "兔",
    "狗",
    "鼠"
  ],
  "killZodiacs": [
    "羊",
    "鸡"
  ],
  "numbers": [
    40,
    41,
    21,
    31,
    12,
    3,
    33,
    43,
    15,
    5,
    45,
    36,
    16,
    27,
    17,
    7
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    5,
    6,
    7
  ],
  "pools": {
    "3": [
      "羊",
      "龙",
      "虎"
    ],
    "4": [
      "羊",
      "龙",
      "虎",
      "兔"
    ],
    "5": [
      "羊",
      "龙",
      "虎",
      "兔",
      "鼠"
    ],
    "7": [
      "龙",
      "虎",
      "羊",
      "兔",
      "狗",
      "鼠",
      "牛"
    ],
    "8": [
      "龙",
      "虎",
      "羊",
      "兔",
      "狗",
      "鼠",
      "牛",
      "蛇"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 64.0,
  "votes": {
    "鼠": 3.5,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 2.0,
    "羊": 4.5,
    "猴": 1.0,
    "狗": 3.5,
    "猪": 1.0,
    "鸡": 2.0
  }
};