var ensembleData = {
  "time": "2026-06-29 21:32:32",
  "issue": "2026180",
  "code": "14,10,37,30,49,19,21",
  "zodiac": "蛇,鸡,马,牛,马,鼠,狗",
  "wave": "blue,blue,blue,red,green,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026181",
  "ninePool": [
    "猴",
    "羊",
    "鼠",
    "兔",
    "鸡",
    "猪",
    "虎",
    "马",
    "牛"
  ],
  "sixPool": [
    "猴",
    "羊",
    "鼠",
    "兔",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "马",
    "狗"
  ],
  "numbers": [
    40,
    10,
    20,
    12,
    22,
    32,
    23,
    43,
    24,
    4,
    34,
    44,
    36,
    16,
    46,
    48
  ],
  "supplement": [],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "猴",
      "羊",
      "鼠"
    ],
    "4": [
      "猴",
      "羊",
      "鼠",
      "兔"
    ],
    "5": [
      "猴",
      "羊",
      "鼠",
      "兔",
      "鸡"
    ],
    "7": [
      "猴",
      "羊",
      "鼠",
      "兔",
      "鸡",
      "猪",
      "虎"
    ],
    "8": [
      "猴",
      "羊",
      "鼠",
      "兔",
      "鸡",
      "猪",
      "虎",
      "马"
    ]
  },
  "dynamicRate9": 75.75757575757575,
  "dynamicRate6": 63.63636363636363,
  "votes": {
    "羊": 4,
    "猴": 4,
    "鸡": 3,
    "狗": 1,
    "猪": 3,
    "鼠": 3,
    "牛": 2,
    "虎": 3,
    "兔": 3,
    "马": 2,
    "蛇": 2
  }
};