var ensembleData = {
  "time": "2026-08-25 21:32:32",
  "issue": "2026237",
  "code": "47,36,14,06,41,25,12",
  "zodiac": "猴,羊,蛇,牛,虎,马,羊",
  "wave": "blue,blue,blue,green,blue,blue,red",
  "teSx": "羊",
  "teWei": 2,
  "nextIssue": "2026238",
  "ninePool": [
    "龙",
    "鸡",
    "兔",
    "猴",
    "马",
    "狗",
    "猪",
    "羊",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "兔",
    "猴",
    "狗",
    "马"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "numbers": [
    11,
    21,
    1,
    22,
    3,
    23,
    33,
    13,
    34,
    4,
    46,
    16,
    27,
    47,
    37,
    28
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "鸡",
      "狗"
    ],
    "4": [
      "龙",
      "鸡",
      "狗",
      "兔"
    ],
    "5": [
      "龙",
      "鸡",
      "狗",
      "兔",
      "猴"
    ],
    "7": [
      "龙",
      "鸡",
      "兔",
      "猴",
      "马",
      "狗",
      "猪"
    ],
    "8": [
      "龙",
      "鸡",
      "兔",
      "猴",
      "马",
      "狗",
      "猪",
      "羊"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0,
  "votes": {
    "虎": 1.0,
    "兔": 3.0,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 3.0,
    "羊": 2.0,
    "猴": 3.0,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 2.5,
    "牛": 1.0,
    "鼠": 2.0
  }
};