var ensembleData = {
  "time": "2026-10-26 21:32:32",
  "issue": "2026299",
  "code": "12,19,28,32,05,42,23",
  "zodiac": "羊,鼠,兔,猪,虎,牛,猴",
  "wave": "red,red,green,green,green,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026300",
  "ninePool": [
    "龙",
    "蛇",
    "羊",
    "兔",
    "马",
    "猴",
    "鸡",
    "狗",
    "虎"
  ],
  "sixPool": [
    "龙",
    "蛇",
    "羊",
    "兔",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "numbers": [
    40,
    1,
    11,
    3,
    13,
    23,
    14,
    24,
    4,
    26,
    36,
    16,
    27,
    37,
    47,
    39
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "蛇",
      "羊",
      "龙"
    ],
    "4": [
      "蛇",
      "羊",
      "龙",
      "兔"
    ],
    "5": [
      "蛇",
      "羊",
      "龙",
      "兔",
      "马"
    ],
    "7": [
      "龙",
      "蛇",
      "羊",
      "兔",
      "马",
      "猴",
      "鸡"
    ],
    "8": [
      "龙",
      "蛇",
      "羊",
      "兔",
      "马",
      "猴",
      "鸡",
      "狗"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 44.0,
  "votes": {
    "虎": 2.0,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 4.5,
    "马": 4.5,
    "羊": 4.5,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 2.0,
    "牛": 2.0
  }
};