var ensembleData = {
  "time": "2026-09-28 21:32:32",
  "issue": "2026271",
  "code": "25,02,05,22,20,31,35",
  "zodiac": "马,蛇,虎,鸡,猪,鼠,猴",
  "wave": "blue,red,green,green,blue,blue,red",
  "teSx": "猴",
  "teWei": 5,
  "nextIssue": "2026272",
  "ninePool": [
    "牛",
    "羊",
    "马",
    "狗",
    "龙",
    "蛇",
    "猪",
    "鼠",
    "虎"
  ],
  "sixPool": [
    "牛",
    "羊",
    "马",
    "狗",
    "龙",
    "蛇"
  ],
  "killZodiacs": [
    "虎",
    "猴"
  ],
  "numbers": [
    1,
    21,
    42,
    12,
    2,
    13,
    33,
    3,
    24,
    14,
    6,
    36,
    26,
    37,
    27,
    18
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "牛",
      "马"
    ],
    "4": [
      "羊",
      "牛",
      "马",
      "狗"
    ],
    "5": [
      "羊",
      "牛",
      "马",
      "狗",
      "龙"
    ],
    "7": [
      "牛",
      "羊",
      "马",
      "狗",
      "龙",
      "蛇",
      "猪"
    ],
    "8": [
      "牛",
      "羊",
      "马",
      "狗",
      "龙",
      "蛇",
      "猪",
      "鼠"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "猪": 2.0,
    "鼠": 2.0,
    "牛": 4.5,
    "虎": 2.0,
    "兔": 2.0,
    "龙": 3.0,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 4.5,
    "狗": 3.5,
    "鸡": 1.0,
    "猴": 1.0
  }
};