var ensembleData = {
  "time": "2026-08-19 21:32:32",
  "issue": "2026231",
  "code": "39,46,23,11,08,13,20",
  "zodiac": "龙,鸡,猴,猴,猪,马,猪",
  "wave": "green,red,red,green,red,red,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026232",
  "ninePool": [
    "马",
    "牛",
    "猴",
    "鼠",
    "羊",
    "龙",
    "蛇",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "马",
    "牛",
    "猴",
    "鼠",
    "羊",
    "龙"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "numbers": [
    13,
    6,
    18,
    30,
    42,
    23,
    19,
    43,
    12,
    24,
    36,
    48,
    3,
    39,
    1,
    25
  ],
  "supplement": [
    1,
    25
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "马",
      "牛",
      "猴"
    ],
    "4": [
      "马",
      "牛",
      "猴",
      "蛇"
    ],
    "5": [
      "马",
      "牛",
      "猴",
      "蛇",
      "羊"
    ],
    "7": [
      "马",
      "牛",
      "猴",
      "鼠",
      "羊",
      "龙",
      "蛇"
    ],
    "8": [
      "马",
      "牛",
      "猴",
      "鼠",
      "羊",
      "龙",
      "蛇",
      "鸡"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "猪": 2.0,
    "鼠": 3.0,
    "牛": 3.5,
    "虎": 2.0,
    "兔": 1.0,
    "龙": 3.0,
    "蛇": 3.0,
    "马": 4.5,
    "羊": 3.0,
    "猴": 3.5,
    "鸡": 2.0,
    "狗": 1.0
  }
};