var ensembleData = {
  "time": "2026-07-06 21:32:32",
  "issue": "2026187",
  "code": "23,12,36,38,27,22,01",
  "zodiac": "猴,羊,羊,蛇,龙,鸡,马",
  "wave": "red,red,blue,green,green,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026188",
  "ninePool": [
    "猪",
    "牛",
    "龙",
    "鼠",
    "兔",
    "狗",
    "鸡",
    "羊",
    "猴"
  ],
  "sixPool": [
    "猪",
    "牛",
    "龙",
    "鼠",
    "兔",
    "狗"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "numbers": [
    32,
    4,
    6,
    8,
    40,
    42,
    44,
    16,
    18,
    20,
    28,
    30,
    33,
    43,
    27,
    7
  ],
  "pools": {
    "3": [
      "猪",
      "牛",
      "兔"
    ],
    "4": [
      "猪",
      "牛",
      "龙",
      "鼠"
    ],
    "5": [
      "猪",
      "牛",
      "龙",
      "鼠",
      "兔"
    ],
    "7": [
      "猪",
      "牛",
      "龙",
      "鼠",
      "兔",
      "狗",
      "鸡"
    ],
    "8": [
      "猪",
      "牛",
      "龙",
      "鼠",
      "兔",
      "狗",
      "鸡",
      "羊"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 65.0,
  "votes": {
    "龙": 3,
    "羊": 2,
    "猴": 2,
    "狗": 3,
    "鼠": 3,
    "蛇": 2,
    "兔": 3,
    "鸡": 3,
    "猪": 4,
    "牛": 3,
    "虎": 1
  }
};