var ensembleData = {
  "time": "2026-09-24 21:32:32",
  "issue": "2026267",
  "code": "16,20,25,22,09,41,40",
  "zodiac": "兔,猪,马,鸡,狗,虎,兔",
  "wave": "green,blue,blue,green,blue,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026268",
  "ninePool": [
    "蛇",
    "猪",
    "牛",
    "猴",
    "狗",
    "鼠",
    "马",
    "龙",
    "鸡"
  ],
  "sixPool": [
    "蛇",
    "猪",
    "猴",
    "牛",
    "狗",
    "鼠"
  ],
  "killZodiacs": [
    "猴",
    "兔"
  ],
  "numbers": [
    11,
    21,
    31,
    23,
    33,
    43,
    14,
    44,
    35,
    45,
    26,
    6,
    47,
    7,
    38,
    8
  ],
  "supplement": [],
  "optTails": [
    1,
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "猪",
      "牛"
    ],
    "4": [
      "蛇",
      "猪",
      "牛",
      "猴"
    ],
    "5": [
      "蛇",
      "猪",
      "牛",
      "猴",
      "鼠"
    ],
    "7": [
      "蛇",
      "猪",
      "牛",
      "猴",
      "狗",
      "鼠",
      "马"
    ],
    "8": [
      "蛇",
      "猪",
      "牛",
      "猴",
      "狗",
      "鼠",
      "马",
      "龙"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "狗": 3.0,
    "猪": 4.5,
    "鼠": 3.0,
    "牛": 3.5,
    "虎": 1.0,
    "兔": 1.0,
    "龙": 3.0,
    "蛇": 4.5,
    "马": 3.0,
    "猴": 3.5,
    "鸡": 2.0,
    "羊": 1.0
  }
};