var ensembleData = {
  "time": "2026-10-30 21:32:32",
  "issue": "2026303",
  "code": "08,28,40,03,38,49,17",
  "zodiac": "猪,兔,兔,龙,蛇,马,虎",
  "wave": "red,green,red,blue,green,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026304",
  "ninePool": [
    "羊",
    "猴",
    "猪",
    "兔",
    "鸡",
    "马",
    "蛇",
    "鼠",
    "狗"
  ],
  "sixPool": [
    "羊",
    "猴",
    "猪",
    "兔",
    "鸡",
    "马"
  ],
  "killZodiacs": [
    "鼠",
    "虎"
  ],
  "numbers": [
    20,
    40,
    10,
    11,
    1,
    12,
    32,
    22,
    23,
    13,
    24,
    44,
    4,
    34,
    36,
    16
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "猪",
      "猴"
    ],
    "4": [
      "羊",
      "猪",
      "猴",
      "兔"
    ],
    "5": [
      "羊",
      "猪",
      "猴",
      "兔",
      "鸡"
    ],
    "7": [
      "羊",
      "猴",
      "猪",
      "兔",
      "鸡",
      "马",
      "蛇"
    ],
    "8": [
      "羊",
      "猴",
      "猪",
      "兔",
      "鸡",
      "马",
      "蛇",
      "鼠"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 44.0,
  "votes": {
    "蛇": 3.0,
    "马": 3.0,
    "羊": 4.5,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 2.0,
    "猪": 4.5,
    "鼠": 2.0,
    "牛": 1.0,
    "兔": 3.5,
    "虎": 1.0,
    "龙": 1.0
  }
};