var ensembleData = {
  "time": "2026-10-18 21:32:32",
  "issue": "2026291",
  "code": "32,10,41,38,22,02,17",
  "zodiac": "猪,鸡,虎,蛇,鸡,蛇,虎",
  "wave": "green,blue,blue,green,green,red,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026292",
  "ninePool": [
    "狗",
    "马",
    "兔",
    "鸡",
    "龙",
    "虎",
    "蛇",
    "猴",
    "猪"
  ],
  "sixPool": [
    "狗",
    "马",
    "兔",
    "鸡",
    "龙",
    "虎"
  ],
  "killZodiacs": [
    "马",
    "虎"
  ],
  "numbers": [
    9,
    33,
    13,
    4,
    16,
    28,
    40,
    10,
    22,
    34,
    46,
    3,
    39,
    29,
    21,
    45
  ],
  "supplement": [
    21,
    45
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "狗",
      "兔",
      "马"
    ],
    "4": [
      "狗",
      "兔",
      "马",
      "鸡"
    ],
    "5": [
      "狗",
      "兔",
      "马",
      "鸡",
      "龙"
    ],
    "7": [
      "狗",
      "马",
      "兔",
      "鸡",
      "龙",
      "虎",
      "蛇"
    ],
    "8": [
      "狗",
      "马",
      "兔",
      "鸡",
      "龙",
      "虎",
      "蛇",
      "猴"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 48.0,
  "votes": {
    "鸡": 3.0,
    "狗": 4.5,
    "猪": 2.0,
    "鼠": 1.0,
    "牛": 2.0,
    "虎": 3.0,
    "兔": 3.5,
    "龙": 3.0,
    "蛇": 3.0,
    "马": 3.5,
    "猴": 2.0,
    "羊": 1.0
  }
};