var ensembleData = {
  "time": "2026-09-18 21:32:32",
  "issue": "2026261",
  "code": "06,25,43,46,29,47,24",
  "zodiac": "牛,马,鼠,鸡,虎,猴,羊",
  "wave": "green,blue,green,red,red,blue,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026262",
  "ninePool": [
    "兔",
    "猴",
    "羊",
    "鸡",
    "鼠",
    "猪",
    "虎",
    "狗",
    "龙"
  ],
  "sixPool": [
    "兔",
    "猴",
    "羊",
    "鸡",
    "鼠",
    "猪"
  ],
  "killZodiacs": [
    "兔",
    "羊"
  ],
  "numbers": [
    40,
    10,
    20,
    11,
    31,
    12,
    22,
    32,
    23,
    43,
    4,
    24,
    34,
    44,
    47,
    7
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "猴",
      "兔"
    ],
    "4": [
      "羊",
      "猴",
      "兔",
      "鸡"
    ],
    "5": [
      "羊",
      "猴",
      "兔",
      "鸡",
      "鼠"
    ],
    "7": [
      "兔",
      "猴",
      "羊",
      "鸡",
      "鼠",
      "猪",
      "虎"
    ],
    "8": [
      "兔",
      "猴",
      "羊",
      "鸡",
      "鼠",
      "猪",
      "虎",
      "狗"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 62.0,
  "votes": {
    "虎": 3.0,
    "兔": 4.5,
    "龙": 2.0,
    "蛇": 1.0,
    "马": 1.0,
    "羊": 4.5,
    "猴": 4.5,
    "鸡": 4.5,
    "狗": 3.0,
    "鼠": 3.5,
    "猪": 3.5,
    "牛": 1.0
  }
};