var ensembleData = {
  "time": "2026-10-05 21:32:32",
  "issue": "2026278",
  "code": "06,40,24,29,44,01,02",
  "zodiac": "牛,兔,羊,虎,猪,马,蛇",
  "wave": "green,red,red,red,green,red,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026279",
  "ninePool": [
    "牛",
    "龙",
    "虎",
    "狗",
    "猴",
    "蛇",
    "兔",
    "羊",
    "鼠"
  ],
  "sixPool": [
    "龙",
    "牛",
    "虎",
    "狗",
    "蛇",
    "猴"
  ],
  "killZodiacs": [
    "鼠",
    "蛇"
  ],
  "numbers": [
    3,
    6,
    18,
    30,
    42,
    41,
    21,
    33,
    2,
    14,
    26,
    38,
    11,
    23,
    15,
    27
  ],
  "supplement": [
    15,
    27
  ],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "牛",
      "虎"
    ],
    "4": [
      "龙",
      "牛",
      "虎",
      "狗"
    ],
    "5": [
      "龙",
      "牛",
      "虎",
      "狗",
      "猴"
    ],
    "7": [
      "牛",
      "龙",
      "虎",
      "狗",
      "猴",
      "蛇",
      "兔"
    ],
    "8": [
      "牛",
      "龙",
      "虎",
      "狗",
      "猴",
      "蛇",
      "兔",
      "羊"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "鼠": 2.0,
    "牛": 4.5,
    "虎": 4.5,
    "兔": 3.0,
    "龙": 4.5,
    "蛇": 3.5,
    "马": 2.0,
    "羊": 3.0,
    "猴": 3.5,
    "狗": 3.5,
    "猪": 1.0,
    "鸡": 1.0
  }
};