var ensembleData = {
  "time": "2026-05-31 21:32:32",
  "issue": "2026151",
  "code": "27,15,29,42,20,41,31",
  "zodiac": "龙,龙,虎,牛,猪,虎,鼠",
  "wave": "green,blue,red,blue,blue,blue,blue",
  "teSx": "鼠",
  "teWei": 1,
  "nextIssue": "2026152",
  "ninePool": [
    "鸡",
    "蛇",
    "兔",
    "马",
    "龙",
    "羊",
    "虎",
    "牛",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "马",
    "蛇",
    "兔",
    "龙",
    "虎"
  ],
  "killZodiacs": [
    "牛",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "蛇",
    "兔",
    "马",
    "龙",
    "羊",
    "虎",
    "牛",
    "猪"
  ],
  "numbers": [
    10,
    1,
    26,
    16,
    15,
    41,
    40,
    46,
    22,
    2,
    34,
    14
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      46,
      22,
      34
    ],
    "马": [
      1
    ],
    "蛇": [
      26,
      2,
      14
    ],
    "兔": [
      16,
      40
    ],
    "龙": [
      15
    ],
    "虎": [
      41
    ]
  },
  "top7Tails": [
    0,
    1,
    6,
    2,
    4,
    5,
    7
  ],
  "votes9": {
    "鸡": 4,
    "牛": 3,
    "虎": 3,
    "龙": 4,
    "马": 4,
    "羊": 4,
    "兔": 4,
    "蛇": 4,
    "猪": 2,
    "猴": 2,
    "狗": 1,
    "鼠": 1
  },
  "votes6": {
    "鸡": 4,
    "牛": 2,
    "虎": 3,
    "龙": 3,
    "马": 4,
    "羊": 1,
    "蛇": 3,
    "兔": 3,
    "狗": 1
  }
};