var ensembleData = {
  "time": "2026-06-29 21:32:32",
  "issue": "2026180",
  "code": "14,10,37,30,49,19,21",
  "zodiac": "蛇,鸡,马,牛,马,鼠,狗",
  "wave": "blue,blue,blue,red,green,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026181",
  "ninePool": [
    "猴",
    "羊",
    "马",
    "鼠",
    "牛",
    "鸡",
    "龙",
    "兔",
    "虎"
  ],
  "sixPool": [
    "猴",
    "羊",
    "马",
    "鼠",
    "牛",
    "鸡"
  ],
  "killZodiacs": [
    "马",
    "狗"
  ],
  "numbers": [
    35,
    36,
    6,
    42,
    11,
    12,
    47,
    48,
    18,
    23,
    24,
    30,
    22,
    43,
    13,
    19
  ],
  "pools": {
    "3": [
      "猴",
      "羊",
      "牛"
    ],
    "4": [
      "猴",
      "羊",
      "马",
      "鼠"
    ],
    "5": [
      "猴",
      "羊",
      "马",
      "鼠",
      "牛"
    ],
    "7": [
      "猴",
      "羊",
      "马",
      "鼠",
      "牛",
      "鸡",
      "龙"
    ],
    "8": [
      "猴",
      "羊",
      "马",
      "鼠",
      "牛",
      "鸡",
      "龙",
      "兔"
    ]
  },
  "dynamicRate9": 76.47058823529412,
  "dynamicRate6": 61.76470588235294,
  "votes": {
    "猴": 4,
    "马": 3,
    "鼠": 3,
    "鸡": 3,
    "虎": 2,
    "兔": 2,
    "羊": 4,
    "猪": 2,
    "牛": 3,
    "龙": 2,
    "蛇": 2
  }
};