var ensembleData = {
  "time": "2026-09-20 21:32:32",
  "issue": "2026263",
  "code": "44,28,03,02,24,13,09",
  "zodiac": "猪,兔,龙,蛇,羊,马,狗",
  "wave": "green,green,blue,red,red,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026264",
  "ninePool": [
    "虎",
    "狗",
    "蛇",
    "牛",
    "猴",
    "猪",
    "鸡",
    "羊",
    "龙"
  ],
  "sixPool": [
    "虎",
    "狗",
    "蛇",
    "牛",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "numbers": [
    30,
    20,
    41,
    21,
    11,
    2,
    42,
    32,
    33,
    23,
    14,
    44,
    26,
    6,
    38,
    18
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "狗",
      "蛇"
    ],
    "4": [
      "虎",
      "狗",
      "蛇",
      "牛"
    ],
    "5": [
      "虎",
      "狗",
      "蛇",
      "牛",
      "猴"
    ],
    "7": [
      "虎",
      "狗",
      "蛇",
      "牛",
      "猴",
      "猪",
      "鸡"
    ],
    "8": [
      "虎",
      "狗",
      "蛇",
      "牛",
      "猴",
      "猪",
      "鸡",
      "羊"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 60.0,
  "votes": {
    "羊": 2.0,
    "猴": 3.0,
    "鸡": 2.0,
    "狗": 4.5,
    "猪": 3.0,
    "鼠": 2.0,
    "牛": 3.5,
    "虎": 4.5,
    "兔": 2.0,
    "蛇": 3.5,
    "龙": 2.0,
    "马": 1.0
  }
};