var ensembleData = {
  "time": "2026-08-15 21:32:32",
  "issue": "2026227",
  "code": "23,24,29,07,13,31,16",
  "zodiac": "猴,羊,虎,鼠,马,鼠,兔",
  "wave": "red,red,red,red,red,blue,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026228",
  "ninePool": [
    "牛",
    "羊",
    "鸡",
    "鼠",
    "马",
    "猪",
    "兔",
    "龙",
    "狗"
  ],
  "sixPool": [
    "牛",
    "羊",
    "鸡",
    "鼠",
    "马",
    "猪"
  ],
  "killZodiacs": [
    "龙",
    "兔"
  ],
  "numbers": [
    31,
    1,
    42,
    12,
    22,
    32,
    43,
    13,
    24,
    34,
    44,
    6,
    36,
    46,
    7,
    37
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "牛",
      "鸡",
      "鼠"
    ],
    "4": [
      "牛",
      "鸡",
      "鼠",
      "羊"
    ],
    "5": [
      "牛",
      "鸡",
      "鼠",
      "羊",
      "马"
    ],
    "7": [
      "牛",
      "羊",
      "鸡",
      "鼠",
      "马",
      "猪",
      "兔"
    ],
    "8": [
      "牛",
      "羊",
      "鸡",
      "鼠",
      "马",
      "猪",
      "兔",
      "龙"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0,
  "votes": {
    "马": 3.0,
    "羊": 4.5,
    "猴": 1.0,
    "鸡": 4.5,
    "狗": 2.0,
    "猪": 3.0,
    "鼠": 4.5,
    "牛": 4.5,
    "虎": 2.0,
    "龙": 2.0,
    "兔": 2.5,
    "蛇": 1.0
  }
};