var ensembleData = {
  "time": "2026-10-01 21:32:32",
  "issue": "2026274",
  "code": "12,16,32,05,39,36,33",
  "zodiac": "羊,兔,猪,虎,龙,羊,狗",
  "wave": "red,green,green,green,green,blue,green",
  "teSx": "狗",
  "teWei": 3,
  "nextIssue": "2026275",
  "ninePool": [
    "羊",
    "猪",
    "鸡",
    "鼠",
    "狗",
    "蛇",
    "猴",
    "牛",
    "虎"
  ],
  "sixPool": [
    "羊",
    "猪",
    "鸡",
    "鼠",
    "狗",
    "蛇"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "numbers": [
    20,
    10,
    31,
    21,
    12,
    32,
    22,
    2,
    43,
    33,
    24,
    44,
    34,
    14,
    36,
    46
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    4,
    6,
    8
  ],
  "pools": {
    "3": [
      "羊",
      "狗",
      "猪"
    ],
    "4": [
      "羊",
      "狗",
      "猪",
      "鸡"
    ],
    "5": [
      "羊",
      "狗",
      "猪",
      "鸡",
      "鼠"
    ],
    "7": [
      "羊",
      "猪",
      "鸡",
      "鼠",
      "狗",
      "蛇",
      "猴"
    ],
    "8": [
      "羊",
      "猪",
      "鸡",
      "鼠",
      "狗",
      "蛇",
      "猴",
      "牛"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "龙": 2.0,
    "蛇": 3.0,
    "马": 2.0,
    "羊": 4.5,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 4.5,
    "猪": 4.5,
    "鼠": 4.5,
    "牛": 2.5,
    "虎": 2.5
  }
};