var ensembleData = {
  "time": "2026-07-17 21:32:32",
  "issue": "2026198",
  "code": "48,35,45,21,12,24,07",
  "zodiac": "羊,猴,狗,狗,羊,羊,鼠",
  "wave": "blue,red,red,green,red,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026199",
  "ninePool": [
    "羊",
    "鸡",
    "猴",
    "牛",
    "虎",
    "狗",
    "兔",
    "蛇",
    "鼠"
  ],
  "sixPool": [
    "羊",
    "鸡",
    "猴",
    "牛",
    "兔",
    "虎"
  ],
  "killZodiacs": [
    "蛇",
    "鼠"
  ],
  "numbers": [
    11,
    41,
    12,
    22,
    42,
    24,
    34,
    4,
    35,
    5,
    36,
    46,
    6,
    16,
    48,
    18
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "牛"
    ],
    "4": [
      "鸡",
      "羊",
      "牛",
      "猴"
    ],
    "5": [
      "鸡",
      "羊",
      "牛",
      "猴",
      "兔"
    ],
    "7": [
      "羊",
      "鸡",
      "猴",
      "牛",
      "虎",
      "狗",
      "兔"
    ],
    "8": [
      "羊",
      "鸡",
      "猴",
      "牛",
      "虎",
      "狗",
      "兔",
      "蛇"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "羊": 4.5,
    "猴": 3.0,
    "鸡": 4.5,
    "狗": 3.0,
    "猪": 1.0,
    "鼠": 2.0,
    "牛": 3.0,
    "虎": 3.0,
    "兔": 3.0,
    "蛇": 2.5,
    "马": 2.0
  }
};