var ensembleData = {
  "time": "2026-06-30 21:32:32",
  "issue": "2026181",
  "code": "17,29,06,34,47,15,19",
  "zodiac": "虎,虎,牛,鸡,猴,龙,鼠",
  "wave": "green,red,green,red,blue,blue,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026182",
  "ninePool": [
    "虎",
    "兔",
    "牛",
    "龙",
    "鸡",
    "猴",
    "羊",
    "蛇",
    "马"
  ],
  "sixPool": [
    "虎",
    "兔",
    "牛",
    "龙",
    "鸡",
    "猴"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "numbers": [
    4,
    5,
    6,
    40,
    41,
    42,
    16,
    17,
    18,
    28,
    29,
    30,
    47,
    35,
    27,
    39
  ],
  "pools": {
    "3": [
      "虎",
      "牛",
      "兔"
    ],
    "4": [
      "虎",
      "兔",
      "牛",
      "龙"
    ],
    "5": [
      "虎",
      "兔",
      "牛",
      "龙",
      "鸡"
    ],
    "7": [
      "虎",
      "兔",
      "牛",
      "龙",
      "鸡",
      "猴",
      "羊"
    ],
    "8": [
      "虎",
      "兔",
      "牛",
      "龙",
      "鸡",
      "猴",
      "羊",
      "蛇"
    ]
  },
  "dynamicRate9": 76.47058823529412,
  "dynamicRate6": 61.76470588235294,
  "votes": {
    "猴": 3,
    "狗": 1,
    "牛": 4,
    "虎": 4,
    "龙": 4,
    "兔": 4,
    "鸡": 4,
    "猪": 1,
    "蛇": 3,
    "羊": 3,
    "马": 2
  }
};