var ensembleData = {
  "time": "2026-08-27 21:32:32",
  "issue": "2026239",
  "code": "47,43,34,17,22,07,05",
  "zodiac": "猴,鼠,鸡,虎,鸡,鼠,虎",
  "wave": "blue,green,red,green,green,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026240",
  "ninePool": [
    "兔",
    "虎",
    "狗",
    "鼠",
    "鸡",
    "蛇",
    "龙",
    "马",
    "猪"
  ],
  "sixPool": [
    "兔",
    "虎",
    "狗",
    "鼠",
    "鸡",
    "蛇"
  ],
  "killZodiacs": [
    "鸡",
    "虎"
  ],
  "numbers": [
    40,
    10,
    41,
    21,
    31,
    33,
    43,
    4,
    34,
    14,
    16,
    46,
    26,
    17,
    7,
    29
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "兔",
      "虎",
      "狗"
    ],
    "4": [
      "兔",
      "虎",
      "狗",
      "鼠"
    ],
    "5": [
      "兔",
      "虎",
      "狗",
      "鼠",
      "鸡"
    ],
    "7": [
      "兔",
      "虎",
      "狗",
      "鼠",
      "鸡",
      "蛇",
      "龙"
    ],
    "8": [
      "兔",
      "虎",
      "狗",
      "鼠",
      "鸡",
      "蛇",
      "龙",
      "马"
    ]
  },
  "dynamicRate9": 72.0,
  "dynamicRate6": 60.0,
  "votes": {
    "鸡": 3.0,
    "狗": 3.5,
    "猪": 2.0,
    "鼠": 3.5,
    "牛": 2.0,
    "虎": 4.5,
    "兔": 4.5,
    "龙": 3.0,
    "蛇": 3.0,
    "马": 2.0,
    "羊": 1.0,
    "猴": 1.0
  }
};