var ensembleData = {
  "time": "2026-06-20 21:32:32",
  "issue": "2026171",
  "code": "24,38,40,31,42,46,28",
  "zodiac": "羊,蛇,兔,鼠,牛,鸡,兔",
  "wave": "red,green,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": 8,
  "nextIssue": "2026172",
  "ninePool": [
    "龙",
    "鸡",
    "猴",
    "虎",
    "马",
    "兔",
    "蛇",
    "狗",
    "牛"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "猴",
    "虎",
    "马",
    "兔"
  ],
  "killZodiacs": [
    "虎",
    "兔"
  ],
  "numbers": [
    3,
    15,
    37,
    27,
    39,
    34,
    10,
    22,
    46,
    47,
    35,
    11,
    23,
    17,
    29,
    5
  ],
  "supplement": [],
  "optTails": [
    6,
    1,
    4,
    8,
    3,
    2,
    7
  ],
  "pools": {
    "3": [
      "龙",
      "鸡",
      "猴"
    ],
    "4": [
      "龙",
      "鸡",
      "猴",
      "虎"
    ],
    "5": [
      "龙",
      "鸡",
      "猴",
      "虎",
      "马"
    ],
    "7": [
      "龙",
      "鸡",
      "猴",
      "虎",
      "马",
      "兔",
      "蛇"
    ],
    "8": [
      "龙",
      "鸡",
      "猴",
      "虎",
      "马",
      "兔",
      "蛇",
      "狗"
    ]
  },
  "dynamicRate9": 75.0,
  "dynamicRate6": 62.5,
  "votes": {
    "虎": 3,
    "兔": 3,
    "龙": 3,
    "蛇": 3,
    "马": 3,
    "羊": 2,
    "猴": 3,
    "鸡": 3,
    "狗": 3,
    "猪": 1,
    "牛": 2,
    "鼠": 2
  }
};