var ensembleData = {
  "time": "2026-09-23 21:32:32",
  "issue": "2026266",
  "code": "38,42,37,29,45,18,08",
  "zodiac": "蛇,牛,马,虎,狗,牛,猪",
  "wave": "green,blue,blue,red,red,red,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026267",
  "ninePool": [
    "兔",
    "蛇",
    "羊",
    "虎",
    "龙",
    "牛",
    "猪",
    "鼠",
    "猴"
  ],
  "sixPool": [
    "兔",
    "蛇",
    "羊",
    "虎",
    "龙",
    "牛"
  ],
  "killZodiacs": [
    "狗",
    "猪"
  ],
  "numbers": [
    40,
    30,
    41,
    3,
    5,
    15,
    16,
    26,
    36,
    6,
    17,
    27,
    28,
    38,
    48,
    18
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "蛇",
      "兔",
      "羊"
    ],
    "4": [
      "蛇",
      "兔",
      "羊",
      "虎"
    ],
    "5": [
      "蛇",
      "兔",
      "羊",
      "虎",
      "龙"
    ],
    "7": [
      "兔",
      "蛇",
      "羊",
      "虎",
      "龙",
      "牛",
      "猪"
    ],
    "8": [
      "兔",
      "蛇",
      "羊",
      "虎",
      "龙",
      "牛",
      "猪",
      "鼠"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 60.0,
  "votes": {
    "猪": 2.0,
    "鼠": 2.0,
    "牛": 3.0,
    "虎": 3.0,
    "兔": 4.5,
    "龙": 3.0,
    "蛇": 4.5,
    "马": 1.0,
    "羊": 3.5,
    "猴": 2.0,
    "鸡": 2.0,
    "狗": 1.0
  }
};