var ensembleData = {
  "time": "2026-09-21 21:32:32",
  "issue": "2026264",
  "code": "10,06,08,31,22,24,21",
  "zodiac": "鸡,牛,猪,鼠,鸡,羊,狗",
  "wave": "blue,green,red,blue,green,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026265",
  "ninePool": [
    "鸡",
    "兔",
    "猪",
    "羊",
    "龙",
    "鼠",
    "虎",
    "马",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "猪",
    "羊",
    "龙",
    "鼠"
  ],
  "killZodiacs": [
    "狗",
    "狗"
  ],
  "numbers": [
    10,
    46,
    16,
    28,
    40,
    8,
    20,
    36,
    48,
    3,
    15,
    27,
    7,
    31,
    43,
    22
  ],
  "supplement": [
    22
  ],
  "optTails": [
    0,
    1,
    3,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "兔",
      "鸡",
      "猪"
    ],
    "4": [
      "兔",
      "鸡",
      "猪",
      "羊"
    ],
    "5": [
      "兔",
      "鸡",
      "猪",
      "羊",
      "鼠"
    ],
    "7": [
      "鸡",
      "兔",
      "猪",
      "羊",
      "龙",
      "鼠",
      "虎"
    ],
    "8": [
      "鸡",
      "兔",
      "猪",
      "羊",
      "龙",
      "鼠",
      "虎",
      "马"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 60.0,
  "votes": {
    "鸡": 4.5,
    "狗": 1.0,
    "猪": 4.5,
    "鼠": 3.0,
    "牛": 2.0,
    "虎": 2.0,
    "兔": 4.5,
    "龙": 3.0,
    "蛇": 2.0,
    "羊": 3.5,
    "马": 2.0,
    "猴": 1.0
  }
};