var ensembleData = {
  "time": "2026-07-11 21:32:32",
  "issue": "2026192",
  "code": "27,30,45,08,01,37,25",
  "zodiac": "龙,牛,狗,猪,马,马,马",
  "wave": "green,red,red,red,red,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026193",
  "ninePool": [
    "狗",
    "鼠",
    "鸡",
    "牛",
    "羊",
    "蛇",
    "猴",
    "猪",
    "虎"
  ],
  "sixPool": [
    "狗",
    "鼠",
    "鸡",
    "牛",
    "羊",
    "蛇"
  ],
  "killZodiacs": [
    "狗",
    "马"
  ],
  "numbers": [
    33,
    34,
    7,
    9,
    10,
    43,
    45,
    46,
    19,
    21,
    22,
    31,
    38,
    30,
    48,
    18
  ],
  "pools": {
    "3": [
      "狗",
      "鼠",
      "鸡"
    ],
    "4": [
      "狗",
      "鼠",
      "鸡",
      "牛"
    ],
    "5": [
      "狗",
      "鼠",
      "鸡",
      "牛",
      "羊"
    ],
    "7": [
      "狗",
      "鼠",
      "鸡",
      "牛",
      "羊",
      "蛇",
      "猴"
    ],
    "8": [
      "狗",
      "鼠",
      "鸡",
      "牛",
      "羊",
      "蛇",
      "猴",
      "猪"
    ]
  },
  "dynamicRate9": 75.55555555555556,
  "dynamicRate6": 62.22222222222222,
  "votes": {
    "猪": 2,
    "狗": 4,
    "鼠": 3,
    "牛": 3,
    "羊": 3,
    "猴": 2,
    "虎": 2,
    "蛇": 3,
    "鸡": 3,
    "马": 2,
    "龙": 2
  }
};