var ensembleData = {
  "time": "2026-09-10 21:32:32",
  "issue": "2026253",
  "code": "05,35,15,28,13,49,16",
  "zodiac": "虎,猴,龙,兔,马,马,兔",
  "wave": "green,red,blue,green,red,green,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026254",
  "ninePool": [
    "羊",
    "马",
    "鼠",
    "牛",
    "鸡",
    "兔",
    "虎",
    "龙",
    "猴"
  ],
  "sixPool": [
    "羊",
    "马",
    "鼠",
    "鸡",
    "牛",
    "兔"
  ],
  "killZodiacs": [
    "蛇",
    "兔"
  ],
  "numbers": [
    1,
    31,
    12,
    22,
    42,
    24,
    34,
    4,
    25,
    36,
    46,
    6,
    16,
    48,
    18,
    28
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    4,
    5,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "鼠",
      "羊",
      "马"
    ],
    "4": [
      "鼠",
      "羊",
      "马",
      "牛"
    ],
    "5": [
      "鼠",
      "羊",
      "马",
      "牛",
      "鸡"
    ],
    "7": [
      "羊",
      "马",
      "鼠",
      "牛",
      "鸡",
      "兔",
      "虎"
    ],
    "8": [
      "羊",
      "马",
      "鼠",
      "牛",
      "鸡",
      "兔",
      "虎",
      "龙"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 64.0,
  "votes": {
    "马": 4.5,
    "羊": 4.5,
    "猴": 2.0,
    "鸡": 4.5,
    "狗": 1.0,
    "猪": 1.0,
    "鼠": 4.5,
    "牛": 4.5,
    "虎": 3.0,
    "龙": 2.5,
    "兔": 3.5,
    "蛇": 2.0
  }
};