var ensembleData = {
  "time": "2026-06-27 21:32:32",
  "issue": "2026178",
  "code": "26,46,22,44,31,17,18",
  "zodiac": "蛇,鸡,鸡,猪,鼠,虎,牛",
  "wave": "blue,red,green,green,blue,green,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026179",
  "ninePool": [
    "龙",
    "猴",
    "兔",
    "虎",
    "马",
    "羊",
    "鼠",
    "蛇",
    "狗"
  ],
  "sixPool": [
    "龙",
    "猴",
    "兔",
    "虎",
    "马",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "numbers": [
    3,
    39,
    23,
    4,
    16,
    28,
    40,
    29,
    13,
    12,
    24,
    36,
    48,
    15,
    27,
    11
  ],
  "supplement": [
    15,
    27,
    11
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "猴",
      "兔"
    ],
    "4": [
      "龙",
      "猴",
      "兔",
      "虎"
    ],
    "5": [
      "龙",
      "猴",
      "兔",
      "虎",
      "马"
    ],
    "7": [
      "龙",
      "猴",
      "兔",
      "虎",
      "马",
      "羊",
      "鼠"
    ],
    "8": [
      "龙",
      "猴",
      "兔",
      "虎",
      "马",
      "羊",
      "鼠",
      "蛇"
    ]
  },
  "dynamicRate9": 74.19354838709677,
  "dynamicRate6": 61.29032258064516,
  "votes": {
    "鼠": 2,
    "牛": 1,
    "虎": 4,
    "兔": 4,
    "龙": 4,
    "蛇": 2,
    "马": 3,
    "羊": 3,
    "猴": 4,
    "狗": 2,
    "猪": 2,
    "鸡": 2
  }
};