var ensembleData = {
  "time": "2026-09-08 21:32:32",
  "issue": "2026251",
  "code": "09,06,11,25,08,45,30",
  "zodiac": "狗,牛,猴,马,猪,狗,牛",
  "wave": "blue,green,green,blue,red,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026252",
  "ninePool": [
    "鼠",
    "虎",
    "龙",
    "蛇",
    "兔",
    "猪",
    "猴",
    "牛",
    "鸡"
  ],
  "sixPool": [
    "鼠",
    "虎",
    "龙",
    "蛇",
    "兔",
    "猪"
  ],
  "killZodiacs": [
    "狗",
    "牛"
  ],
  "numbers": [
    40,
    20,
    31,
    41,
    43,
    3,
    5,
    15,
    26,
    16,
    7,
    17,
    27,
    38,
    28,
    8
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    5,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "虎",
      "鼠",
      "龙"
    ],
    "4": [
      "虎",
      "鼠",
      "龙",
      "兔"
    ],
    "5": [
      "虎",
      "鼠",
      "龙",
      "兔",
      "蛇"
    ],
    "7": [
      "鼠",
      "虎",
      "龙",
      "蛇",
      "兔",
      "猪",
      "猴"
    ],
    "8": [
      "鼠",
      "虎",
      "龙",
      "蛇",
      "兔",
      "猪",
      "猴",
      "牛"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0,
  "votes": {
    "猪": 3.5,
    "鼠": 4.5,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 4.5,
    "龙": 4.5,
    "蛇": 4.5,
    "马": 2.0,
    "羊": 2.0,
    "鸡": 2.5,
    "猴": 3.5
  }
};