var ensembleData = {
  "time": "2026-10-25 21:32:32",
  "issue": "2026298",
  "code": "31,36,40,34,37,43,08",
  "zodiac": "鼠,羊,兔,鸡,马,鼠,猪",
  "wave": "blue,blue,red,red,blue,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026299",
  "ninePool": [
    "猴",
    "马",
    "猪",
    "蛇",
    "龙",
    "羊",
    "鸡",
    "狗",
    "牛"
  ],
  "sixPool": [
    "猴",
    "马",
    "猪",
    "蛇",
    "龙",
    "羊"
  ],
  "killZodiacs": [
    "龙",
    "猪"
  ],
  "numbers": [
    11,
    1,
    32,
    2,
    12,
    23,
    13,
    3,
    44,
    14,
    24,
    26,
    36,
    47,
    37,
    27
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "猴",
      "马",
      "猪"
    ],
    "4": [
      "猴",
      "马",
      "猪",
      "蛇"
    ],
    "5": [
      "猴",
      "马",
      "猪",
      "蛇",
      "龙"
    ],
    "7": [
      "猴",
      "马",
      "猪",
      "蛇",
      "龙",
      "羊",
      "鸡"
    ],
    "8": [
      "猴",
      "马",
      "猪",
      "蛇",
      "龙",
      "羊",
      "鸡",
      "狗"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 44.0,
  "votes": {
    "马": 4.5,
    "羊": 3.0,
    "猴": 4.5,
    "鸡": 3.0,
    "狗": 2.0,
    "猪": 4.5,
    "鼠": 2.0,
    "牛": 2.0,
    "虎": 1.0,
    "蛇": 3.5,
    "龙": 3.5,
    "兔": 1.0
  }
};