var ensembleData = {
  "time": "2026-10-03 21:32:32",
  "issue": "2026276",
  "code": "02,21,17,40,11,24,14",
  "zodiac": "蛇,狗,虎,兔,猴,羊,蛇",
  "wave": "red,green,green,red,green,red,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026277",
  "ninePool": [
    "猴",
    "牛",
    "鼠",
    "虎",
    "龙",
    "猪",
    "兔",
    "狗",
    "鸡"
  ],
  "sixPool": [
    "猴",
    "牛",
    "鼠",
    "虎",
    "龙",
    "猪"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "numbers": [
    30,
    20,
    11,
    31,
    41,
    42,
    32,
    23,
    43,
    3,
    35,
    5,
    15,
    6,
    47,
    7
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    2,
    3,
    5,
    6,
    7
  ],
  "pools": {
    "3": [
      "牛",
      "鼠",
      "猴"
    ],
    "4": [
      "牛",
      "鼠",
      "猴",
      "虎"
    ],
    "5": [
      "牛",
      "鼠",
      "猴",
      "虎",
      "猪"
    ],
    "7": [
      "猴",
      "牛",
      "鼠",
      "虎",
      "龙",
      "猪",
      "兔"
    ],
    "8": [
      "猴",
      "牛",
      "鼠",
      "虎",
      "龙",
      "猪",
      "兔",
      "狗"
    ]
  },
  "dynamicRate9": 82.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "猴": 4.5,
    "鸡": 2.0,
    "狗": 2.0,
    "猪": 3.0,
    "鼠": 4.5,
    "牛": 4.5,
    "虎": 3.5,
    "兔": 3.0,
    "龙": 3.0,
    "羊": 1.0,
    "马": 2.0
  }
};