var ensembleData = {
  "time": "2026-06-16 21:32:32",
  "issue": "2026167",
  "code": "23,03,40,39,07,11,19",
  "zodiac": "猴,龙,兔,龙,鼠,猴,鼠",
  "wave": "red,blue,red,green,red,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026168",
  "ninePool": [
    "蛇",
    "鸡",
    "猴",
    "羊",
    "兔",
    "马",
    "牛",
    "虎",
    "鼠"
  ],
  "sixPool": [
    "蛇",
    "鸡",
    "猴",
    "羊",
    "兔",
    "马"
  ],
  "killZodiacs": [
    "牛",
    "鼠"
  ],
  "numbers": [
    2,
    40,
    16,
    37,
    38,
    14,
    26,
    34,
    10,
    22,
    46,
    47,
    35,
    11,
    23,
    36
  ],
  "supplement": [],
  "optTails": [
    6,
    1,
    4,
    5,
    3,
    2,
    0
  ],
  "pools": {
    "3": [
      "蛇",
      "鸡",
      "猴"
    ],
    "4": [
      "蛇",
      "鸡",
      "猴",
      "羊"
    ],
    "5": [
      "蛇",
      "鸡",
      "猴",
      "羊",
      "兔"
    ],
    "7": [
      "蛇",
      "鸡",
      "猴",
      "羊",
      "兔",
      "马",
      "牛"
    ],
    "8": [
      "蛇",
      "鸡",
      "猴",
      "羊",
      "兔",
      "马",
      "牛",
      "虎"
    ]
  },
  "dynamicRate9": 75.0,
  "dynamicRate6": 65.0,
  "votes": {
    "鼠": 2,
    "牛": 2,
    "虎": 2,
    "兔": 3,
    "龙": 2,
    "蛇": 4,
    "马": 3,
    "羊": 3,
    "猴": 3,
    "鸡": 3,
    "猪": 2,
    "狗": 2
  }
};