var ensembleData = {
  "time": "2026-09-25 21:32:32",
  "issue": "2026268",
  "code": "48,34,11,21,19,36,40",
  "zodiac": "羊,鸡,猴,狗,鼠,羊,兔",
  "wave": "blue,red,green,green,red,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026269",
  "ninePool": [
    "鼠",
    "猴",
    "鸡",
    "猪",
    "牛",
    "羊",
    "蛇",
    "虎",
    "龙"
  ],
  "sixPool": [
    "鼠",
    "猴",
    "鸡",
    "猪",
    "牛",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "兔"
  ],
  "numbers": [
    10,
    20,
    30,
    22,
    32,
    42,
    12,
    43,
    23,
    34,
    44,
    24,
    46,
    6,
    36,
    8
  ],
  "supplement": [],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "鼠",
      "猴",
      "猪"
    ],
    "4": [
      "鼠",
      "猴",
      "猪",
      "鸡"
    ],
    "5": [
      "鼠",
      "猴",
      "猪",
      "鸡",
      "羊"
    ],
    "7": [
      "鼠",
      "猴",
      "鸡",
      "猪",
      "牛",
      "羊",
      "蛇"
    ],
    "8": [
      "鼠",
      "猴",
      "鸡",
      "猪",
      "牛",
      "羊",
      "蛇",
      "虎"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 60.0,
  "votes": {
    "鼠": 4.5,
    "牛": 3.0,
    "虎": 2.0,
    "兔": 1.0,
    "龙": 2.0,
    "蛇": 2.0,
    "马": 2.0,
    "羊": 3.0,
    "猴": 4.5,
    "猪": 3.5,
    "鸡": 3.5,
    "狗": 2.0
  }
};