var ensembleData = {
  "time": "2026-10-23 21:32:32",
  "issue": "2026296",
  "code": "14,43,26,45,03,31,23",
  "zodiac": "蛇,鼠,蛇,狗,龙,鼠,猴",
  "wave": "blue,green,blue,red,blue,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026297",
  "ninePool": [
    "羊",
    "狗",
    "蛇",
    "龙",
    "鸡",
    "猪",
    "鼠",
    "马",
    "猴"
  ],
  "sixPool": [
    "羊",
    "蛇",
    "狗",
    "龙",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "numbers": [
    24,
    36,
    14,
    26,
    9,
    21,
    33,
    3,
    27,
    39,
    10,
    34,
    46,
    20,
    44,
    12
  ],
  "supplement": [
    12
  ],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "鼠",
      "蛇"
    ],
    "4": [
      "羊",
      "鼠",
      "蛇",
      "狗"
    ],
    "5": [
      "羊",
      "鼠",
      "蛇",
      "狗",
      "龙"
    ],
    "7": [
      "羊",
      "狗",
      "蛇",
      "龙",
      "鸡",
      "猪",
      "鼠"
    ],
    "8": [
      "羊",
      "狗",
      "蛇",
      "龙",
      "鸡",
      "猪",
      "鼠",
      "马"
    ]
  },
  "dynamicRate9": 70.0,
  "dynamicRate6": 44.0,
  "votes": {
    "龙": 3.0,
    "蛇": 3.0,
    "马": 2.0,
    "羊": 4.5,
    "猴": 2.0,
    "鸡": 3.0,
    "狗": 3.0,
    "猪": 3.0,
    "鼠": 3.0,
    "兔": 2.0,
    "牛": 1.5
  }
};