var ensembleData = {
  "time": "2026-10-08 21:32:32",
  "issue": "2026281",
  "code": "22,19,21,32,48,38,10",
  "zodiac": "鸡,鼠,狗,猪,羊,蛇,鸡",
  "wave": "green,red,green,green,blue,green,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026282",
  "ninePool": [
    "虎",
    "龙",
    "鸡",
    "牛",
    "猴",
    "猪",
    "兔",
    "羊",
    "狗"
  ],
  "sixPool": [
    "虎",
    "龙",
    "鸡",
    "牛",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "鸡",
    "鸡"
  ],
  "numbers": [
    10,
    30,
    20,
    41,
    11,
    3,
    23,
    34,
    44,
    46,
    6,
    17,
    27,
    47,
    29,
    39
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "鸡"
    ],
    "4": [
      "龙",
      "虎",
      "鸡",
      "牛"
    ],
    "5": [
      "龙",
      "虎",
      "鸡",
      "牛",
      "猴"
    ],
    "7": [
      "虎",
      "龙",
      "鸡",
      "牛",
      "猴",
      "猪",
      "兔"
    ],
    "8": [
      "虎",
      "龙",
      "鸡",
      "牛",
      "猴",
      "猪",
      "兔",
      "羊"
    ]
  },
  "dynamicRate9": 80.0,
  "dynamicRate6": 56.00000000000001,
  "votes": {
    "猴": 3.0,
    "鸡": 3.5,
    "狗": 2.0,
    "猪": 3.0,
    "鼠": 1.0,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 3.0,
    "龙": 4.5,
    "羊": 2.0,
    "马": 1.0,
    "蛇": 1.0
  }
};