var ensembleData = {
  "time": "2026-07-27 21:32:32",
  "issue": "2026208",
  "code": "07,48,40,35,23,28,19",
  "zodiac": "鼠,羊,兔,猴,猴,兔,鼠",
  "wave": "red,blue,red,red,red,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026209",
  "ninePool": [
    "牛",
    "鸡",
    "猪",
    "鼠",
    "蛇",
    "羊",
    "龙",
    "兔",
    "马"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猪",
    "鼠",
    "蛇",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "鼠"
  ],
  "numbers": [
    31,
    22,
    42,
    32,
    2,
    12,
    43,
    34,
    44,
    14,
    24,
    46,
    6,
    26,
    36,
    7
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "猪",
      "鸡",
      "牛"
    ],
    "4": [
      "猪",
      "鸡",
      "牛",
      "鼠"
    ],
    "5": [
      "猪",
      "鸡",
      "牛",
      "鼠",
      "蛇"
    ],
    "7": [
      "牛",
      "鸡",
      "猪",
      "鼠",
      "蛇",
      "羊",
      "龙"
    ],
    "8": [
      "牛",
      "鸡",
      "猪",
      "鼠",
      "蛇",
      "羊",
      "龙",
      "兔"
    ]
  },
  "dynamicRate9": 78.0,
  "dynamicRate6": 60.0,
  "votes": {
    "猴": 1.0,
    "鸡": 4.5,
    "狗": 2.0,
    "猪": 4.5,
    "鼠": 4.5,
    "牛": 4.5,
    "虎": 2.0,
    "兔": 3.5,
    "龙": 3.5,
    "蛇": 3.5,
    "羊": 3.5,
    "马": 3.5
  }
};