var ensembleData = {
  "time": "2026-08-09 21:32:32",
  "issue": "2026221",
  "code": "24,14,18,48,46,28,01",
  "zodiac": "羊,蛇,牛,羊,鸡,兔,马",
  "wave": "red,blue,red,blue,red,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026222",
  "ninePool": [
    "龙",
    "虎",
    "羊",
    "狗",
    "猪",
    "牛",
    "鼠",
    "兔",
    "马"
  ],
  "sixPool": [
    "龙",
    "虎",
    "羊",
    "狗",
    "猪",
    "牛"
  ],
  "killZodiacs": [
    "虎",
    "马"
  ],
  "numbers": [
    41,
    21,
    12,
    32,
    42,
    3,
    33,
    24,
    44,
    36,
    6,
    27,
    17,
    48,
    8,
    18
  ],
  "supplement": [],
  "optTails": [
    1,
    2,
    3,
    4,
    6,
    7,
    8
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "羊"
    ],
    "4": [
      "龙",
      "虎",
      "羊",
      "狗"
    ],
    "5": [
      "龙",
      "虎",
      "羊",
      "狗",
      "牛"
    ],
    "7": [
      "龙",
      "虎",
      "羊",
      "狗",
      "猪",
      "牛",
      "鼠"
    ],
    "8": [
      "龙",
      "虎",
      "羊",
      "狗",
      "猪",
      "牛",
      "鼠",
      "兔"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "狗": 3.0,
    "猪": 3.0,
    "鼠": 2.0,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 2.0,
    "龙": 4.5,
    "蛇": 1.0,
    "马": 2.0,
    "羊": 3.5,
    "鸡": 2.0,
    "猴": 1.0
  }
};