var ensembleData = {
  "time": "2026-08-13 21:32:32",
  "issue": "2026225",
  "code": "07,34,27,10,19,38,01",
  "zodiac": "鼠,鸡,龙,鸡,鼠,蛇,马",
  "wave": "red,red,green,blue,red,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026226",
  "ninePool": [
    "龙",
    "虎",
    "牛",
    "鼠",
    "羊",
    "狗",
    "鸡",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "虎",
    "牛",
    "鼠",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "马",
    "马"
  ],
  "numbers": [
    3,
    39,
    29,
    6,
    18,
    30,
    42,
    19,
    43,
    12,
    24,
    36,
    48,
    9,
    33,
    15
  ],
  "supplement": [
    15
  ],
  "optTails": [
    0,
    2,
    3,
    4,
    6,
    8,
    9
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "牛"
    ],
    "4": [
      "龙",
      "虎",
      "牛",
      "鼠"
    ],
    "5": [
      "龙",
      "虎",
      "牛",
      "鼠",
      "羊"
    ],
    "7": [
      "龙",
      "虎",
      "牛",
      "鼠",
      "羊",
      "狗",
      "鸡"
    ],
    "8": [
      "龙",
      "虎",
      "牛",
      "鼠",
      "羊",
      "狗",
      "鸡",
      "兔"
    ]
  },
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999,
  "votes": {
    "鼠": 3.0,
    "牛": 3.0,
    "虎": 4.5,
    "兔": 2.0,
    "龙": 4.5,
    "蛇": 2.0,
    "马": 2.0,
    "羊": 3.0,
    "猴": 2.0,
    "鸡": 2.0,
    "狗": 2.5,
    "猪": 1.0
  }
};