var ensembleData = {
  "time": "2026-08-12 21:32:32",
  "issue": "2026224",
  "code": "25,19,08,49,18,36,09",
  "zodiac": "马,鼠,猪,马,牛,羊,狗",
  "wave": "blue,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026225",
  "ninePool": [
    "马",
    "羊",
    "虎",
    "兔",
    "猪",
    "鼠",
    "鸡",
    "牛",
    "龙"
  ],
  "sixPool": [
    "马",
    "羊",
    "虎",
    "猪",
    "兔",
    "鼠"
  ],
  "killZodiacs": [
    "鸡",
    "狗"
  ],
  "numbers": [
    20,
    40,
    1,
    41,
    31,
    13,
    43,
    24,
    44,
    4,
    36,
    16,
    37,
    17,
    7,
    29
  ],
  "supplement": [],
  "optTails": [
    0,
    1,
    3,
    4,
    6,
    7,
    9
  ],
  "pools": {
    "3": [
      "羊",
      "马",
      "兔"
    ],
    "4": [
      "羊",
      "马",
      "兔",
      "虎"
    ],
    "5": [
      "羊",
      "马",
      "兔",
      "虎",
      "猪"
    ],
    "7": [
      "马",
      "羊",
      "虎",
      "兔",
      "猪",
      "鼠",
      "鸡"
    ],
    "8": [
      "马",
      "羊",
      "虎",
      "兔",
      "猪",
      "鼠",
      "鸡",
      "牛"
    ]
  },
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0,
  "votes": {
    "牛": 3.0,
    "虎": 3.5,
    "兔": 3.5,
    "龙": 3.0,
    "蛇": 2.0,
    "马": 4.5,
    "羊": 4.5,
    "猴": 1.0,
    "鸡": 3.0,
    "猪": 3.5,
    "鼠": 3.5,
    "狗": 2.5
  }
};