var predictionMaxData = {
  "time": "2026-05-28 21:32:32",
  "issue": "2026148",
  "code": "28,24,31,23,4,27,48",
  "zodiac": "兔,羊,鼠,猴,兔,龙,羊",
  "wave": "green,red,blue,red,blue,green,blue",
  "teSx": "羊",
  "teWei": 8,
  "nextIssue": "2026149",
  "ninePool": [
    "鸡",
    "龙",
    "兔",
    "猪",
    "鼠",
    "蛇",
    "猴",
    "马",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "兔",
    "猪",
    "鼠",
    "蛇"
  ],
  "goldVotes": {
    "蛇": 4,
    "虎": 8,
    "牛": 1,
    "狗": 6,
    "鸡": 4,
    "羊": 3,
    "马": 1,
    "龙": 2,
    "猴": 2
  },
  "missing": {
    "马": 1,
    "羊": 0,
    "猴": 6,
    "鸡": 25,
    "狗": 7,
    "猪": 5,
    "鼠": 4,
    "牛": 2,
    "虎": 3,
    "兔": 8,
    "龙": 24,
    "蛇": 11
  },
  "fixedKillSet": [
    "羊",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "猪",
    "虎",
    "龙",
    "羊"
  ],
  "oraclePool": [
    "猴",
    "马",
    "猪",
    "鸡",
    "狗",
    "蛇",
    "龙",
    "羊",
    "兔"
  ],
  "hechongPool": [
    "马",
    "猪",
    "鸡",
    "牛",
    "鼠",
    "蛇",
    "羊",
    "兔"
  ],
  "dynamicRate9": 92.85714285714286,
  "dynamicRate6": 71.42857142857143
};