var predictionMaxData = {
  "time": "2026-07-08 21:32:32",
  "issue": "2026189",
  "code": "45,12,37,20,38,43,15",
  "zodiac": "狗,羊,马,猪,蛇,鼠,龙",
  "wave": "red,red,blue,blue,green,green,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026190",
  "ninePool": [
    "鸡",
    "鼠",
    "狗",
    "牛",
    "蛇",
    "猴",
    "猪",
    "羊",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "鼠",
    "狗",
    "牛",
    "蛇",
    "猴"
  ],
  "goldVotes": {
    "猪": 5,
    "马": 7,
    "龙": 6,
    "兔": 6,
    "牛": 3,
    "虎": 3,
    "羊": 3,
    "蛇": 3,
    "鸡": 1,
    "猴": 1,
    "狗": 1
  },
  "missing": {
    "马": 2,
    "羊": 4,
    "猴": 3,
    "鸡": 13,
    "狗": 9,
    "猪": 17,
    "鼠": 8,
    "牛": 11,
    "虎": 7,
    "兔": 1,
    "龙": 0,
    "蛇": 12
  },
  "fixedKillSet": [
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "虎",
    "猴",
    "龙",
    "蛇",
    "马",
    "兔",
    "鸡",
    "猪"
  ],
  "oraclePool": [
    "狗",
    "猴",
    "鼠",
    "羊",
    "蛇",
    "牛",
    "鸡",
    "马",
    "猪"
  ],
  "hechongPool": [
    "狗",
    "兔",
    "猴",
    "虎",
    "鼠",
    "龙",
    "鸡",
    "马"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 66.0
};