var predictionMaxData = {
  "time": "2026-09-25 21:32:32",
  "issue": "2026268",
  "code": "48,34,11,21,19,36,40",
  "zodiac": "羊,鸡,猴,狗,鼠,羊,兔",
  "wave": "blue,red,green,green,red,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026269",
  "ninePool": [
    "龙",
    "虎",
    "猴",
    "蛇",
    "鼠",
    "鸡",
    "牛",
    "猪",
    "羊"
  ],
  "sixPool": [
    "龙",
    "虎",
    "猴",
    "蛇",
    "鼠",
    "鸡"
  ],
  "goldVotes": {
    "狗": 5,
    "羊": 4,
    "蛇": 3,
    "猪": 2,
    "龙": 7,
    "马": 2,
    "虎": 8,
    "牛": 2,
    "鸡": 1,
    "猴": 1,
    "兔": 2
  },
  "missing": {
    "马": 3,
    "羊": 7,
    "猴": 19,
    "鸡": 9,
    "狗": 4,
    "猪": 2,
    "鼠": 11,
    "牛": 6,
    "虎": 29,
    "兔": 0,
    "龙": 28,
    "蛇": 14
  },
  "fixedKillSet": [
    "兔",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "狗",
    "龙",
    "兔",
    "虎",
    "鸡",
    "马",
    "牛",
    "鼠",
    "猪",
    "羊"
  ],
  "oraclePool": [
    "猴",
    "龙",
    "兔",
    "虎",
    "蛇",
    "牛",
    "马",
    "鼠",
    "羊"
  ],
  "hechongPool": [
    "狗",
    "龙",
    "兔",
    "鸡",
    "蛇",
    "牛",
    "猪",
    "羊"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0
};