var predictionMaxData = {
  "time": "2026-09-14 21:32:32",
  "issue": "2026257",
  "code": "8,46,47,39,27,45,7",
  "zodiac": "猪,鸡,猴,龙,龙,狗,鼠",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026258",
  "ninePool": [
    "羊",
    "龙",
    "狗",
    "虎",
    "鸡",
    "牛",
    "蛇",
    "猴",
    "兔"
  ],
  "sixPool": [
    "羊",
    "龙",
    "狗",
    "虎",
    "鸡",
    "牛"
  ],
  "goldVotes": {
    "鼠": 5,
    "猪": 6,
    "猴": 4,
    "羊": 4,
    "虎": 5,
    "牛": 2,
    "狗": 3,
    "鸡": 2,
    "蛇": 2,
    "马": 1,
    "龙": 2
  },
  "missing": {
    "马": 1,
    "羊": 20,
    "猴": 8,
    "鸡": 5,
    "狗": 14,
    "猪": 2,
    "鼠": 0,
    "牛": 6,
    "虎": 18,
    "兔": 4,
    "龙": 17,
    "蛇": 3
  },
  "fixedKillSet": [
    "马",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "兔",
    "猴",
    "龙",
    "鸡",
    "狗",
    "虎",
    "马",
    "羊",
    "蛇",
    "猪"
  ],
  "oraclePool": [
    "猴",
    "龙",
    "鸡",
    "狗",
    "鼠",
    "马",
    "羊",
    "蛇",
    "猪"
  ],
  "hechongPool": [
    "牛",
    "猴",
    "虎",
    "龙",
    "狗",
    "鼠",
    "马",
    "羊"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 66.0
};