var predictionMaxData = {
  "time": "2026-09-06 21:32:32",
  "issue": "2026249",
  "code": "41,22,13,36,26,29,23",
  "zodiac": "虎,鸡,马,羊,蛇,虎,猴",
  "wave": "blue,green,red,blue,blue,red,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026250",
  "ninePool": [
    "蛇",
    "羊",
    "鼠",
    "龙",
    "狗",
    "虎",
    "猪",
    "牛",
    "马"
  ],
  "sixPool": [
    "蛇",
    "羊",
    "鼠",
    "龙",
    "狗",
    "虎"
  ],
  "goldVotes": {
    "鼠": 5,
    "蛇": 5,
    "牛": 3,
    "虎": 3,
    "猪": 3,
    "鸡": 7,
    "羊": 2,
    "马": 7,
    "兔": 4,
    "狗": 2,
    "猴": 1,
    "龙": 2
  },
  "missing": {
    "马": 8,
    "羊": 12,
    "猴": 0,
    "鸡": 5,
    "狗": 6,
    "猪": 1,
    "鼠": 16,
    "牛": 3,
    "虎": 10,
    "兔": 2,
    "龙": 9,
    "蛇": 20
  },
  "fixedKillSet": [
    "猴",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "兔",
    "狗",
    "龙",
    "虎",
    "牛",
    "蛇",
    "鸡",
    "羊",
    "猪"
  ],
  "oraclePool": [
    "猴",
    "马",
    "狗",
    "鼠",
    "牛",
    "蛇",
    "鸡",
    "羊",
    "猪"
  ],
  "hechongPool": [
    "猴",
    "马",
    "狗",
    "龙",
    "虎",
    "蛇",
    "鼠",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};