var predictionMaxData = {
  "time": "2026-07-19 21:32:32",
  "issue": "2026200",
  "code": "43,46,5,32,35,29,39",
  "zodiac": "鼠,鸡,虎,猪,猴,虎,龙",
  "wave": "green,red,green,green,red,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026201",
  "ninePool": [
    "牛",
    "鸡",
    "猴",
    "兔",
    "鼠",
    "狗",
    "虎",
    "羊",
    "马"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "猴",
    "兔",
    "鼠",
    "狗"
  ],
  "goldVotes": {
    "鸡": 6,
    "马": 3,
    "虎": 6,
    "蛇": 6,
    "猪": 4,
    "牛": 2,
    "猴": 2,
    "羊": 1,
    "龙": 3,
    "狗": 2
  },
  "missing": {
    "马": 5,
    "羊": 1,
    "猴": 14,
    "鸡": 24,
    "狗": 7,
    "猪": 3,
    "鼠": 2,
    "牛": 22,
    "虎": 9,
    "兔": 10,
    "龙": 0,
    "蛇": 6
  },
  "fixedKillSet": [
    "龙",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "龙",
    "狗",
    "马",
    "鸡",
    "猪",
    "兔",
    "虎",
    "羊",
    "牛",
    "蛇"
  ],
  "oraclePool": [
    "猴",
    "龙",
    "狗",
    "鸡",
    "猪",
    "兔",
    "牛",
    "虎",
    "鼠"
  ],
  "hechongPool": [
    "猴",
    "龙",
    "狗",
    "马",
    "鸡",
    "兔",
    "虎",
    "鼠"
  ],
  "dynamicRate9": 70.0,
  "dynamicRate6": 60.0
};