var predictionMaxData = {
  "time": "2026-08-05 21:32:32",
  "issue": "2026217",
  "code": "34,12,11,30,42,7,26",
  "zodiac": "鸡,羊,猴,牛,牛,鼠,蛇",
  "wave": "red,red,green,red,blue,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026218",
  "ninePool": [
    "鸡",
    "狗",
    "羊",
    "猴",
    "虎",
    "兔",
    "鼠",
    "牛",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "羊",
    "猴",
    "虎",
    "兔"
  ],
  "goldVotes": {
    "猴": 1,
    "羊": 2,
    "龙": 9,
    "鼠": 2,
    "猪": 4,
    "狗": 4,
    "马": 4,
    "兔": 3,
    "鸡": 4,
    "蛇": 3,
    "虎": 4,
    "牛": 1
  },
  "missing": {
    "马": 1,
    "羊": 18,
    "猴": 4,
    "鸡": 41,
    "狗": 24,
    "猪": 8,
    "鼠": 9,
    "牛": 5,
    "虎": 13,
    "兔": 3,
    "龙": 12,
    "蛇": 0
  },
  "fixedKillSet": [
    "蛇",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "鸡",
    "猴",
    "虎",
    "牛",
    "鼠",
    "蛇",
    "马",
    "狗",
    "龙"
  ],
  "oraclePool": [
    "羊",
    "鸡",
    "猴",
    "虎",
    "兔",
    "马",
    "蛇",
    "狗",
    "龙"
  ],
  "hechongPool": [
    "猪",
    "羊",
    "鸡",
    "猴",
    "虎",
    "兔",
    "牛",
    "蛇"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};