var predictionMaxData = {
  "time": "2026-08-21 21:32:32",
  "issue": "2026233",
  "code": "18,41,5,49,4,34,7",
  "zodiac": "牛,虎,虎,马,兔,鸡,鼠",
  "wave": "red,blue,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026234",
  "ninePool": [
    "鸡",
    "龙",
    "羊",
    "马",
    "狗",
    "猴",
    "蛇",
    "虎",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "羊",
    "马",
    "狗",
    "猴"
  ],
  "goldVotes": {
    "马": 1,
    "兔": 4,
    "牛": 2,
    "鼠": 4,
    "猴": 3,
    "猪": 7,
    "龙": 2,
    "羊": 1,
    "虎": 3,
    "蛇": 2,
    "鸡": 1
  },
  "missing": {
    "马": 8,
    "羊": 13,
    "猴": 5,
    "鸡": 57,
    "狗": 9,
    "猪": 2,
    "鼠": 0,
    "牛": 1,
    "虎": 7,
    "兔": 3,
    "龙": 28,
    "蛇": 4
  },
  "fixedKillSet": [
    "鼠",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "鸡",
    "鼠",
    "羊",
    "虎",
    "蛇",
    "牛",
    "猪",
    "狗",
    "兔",
    "猴"
  ],
  "oraclePool": [
    "龙",
    "鸡",
    "狗",
    "羊",
    "蛇",
    "马",
    "猪",
    "兔",
    "猴"
  ],
  "hechongPool": [
    "龙",
    "鼠",
    "羊",
    "马",
    "牛",
    "虎",
    "狗",
    "猴"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};