var predictionMaxData = {
  "time": "2026-07-17 21:32:32",
  "issue": "2026198",
  "code": "48,35,45,21,12,24,7",
  "zodiac": "羊,猴,狗,狗,羊,羊,鼠",
  "wave": "blue,red,red,green,red,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026199",
  "ninePool": [
    "鸡",
    "牛",
    "羊",
    "猴",
    "虎",
    "兔",
    "狗",
    "马",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "羊",
    "猴",
    "虎",
    "兔"
  ],
  "goldVotes": {
    "狗": 5,
    "马": 3,
    "虎": 2,
    "羊": 2,
    "龙": 6,
    "猪": 6,
    "兔": 3,
    "猴": 3,
    "鼠": 4,
    "牛": 2
  },
  "missing": {
    "马": 3,
    "羊": 13,
    "猴": 12,
    "鸡": 22,
    "狗": 5,
    "猪": 1,
    "鼠": 0,
    "牛": 20,
    "虎": 7,
    "兔": 8,
    "龙": 2,
    "蛇": 4
  },
  "fixedKillSet": [
    "鼠",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "蛇",
    "羊",
    "鸡",
    "猴",
    "兔",
    "龙",
    "鼠",
    "虎",
    "猪"
  ],
  "oraclePool": [
    "羊",
    "鸡",
    "狗",
    "猴",
    "虎",
    "兔",
    "鼠",
    "牛",
    "猪"
  ],
  "hechongPool": [
    "马",
    "羊",
    "狗",
    "猴",
    "虎",
    "鼠",
    "牛",
    "龙"
  ],
  "dynamicRate9": 70.0,
  "dynamicRate6": 60.0
};