var predictionMaxData = {
  "time": "2026-10-12 21:32:32",
  "issue": "2026285",
  "code": "46,45,43,39,20,40,19",
  "zodiac": "鸡,狗,鼠,龙,猪,兔,鼠",
  "wave": "red,red,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026286",
  "ninePool": [
    "马",
    "羊",
    "兔",
    "龙",
    "狗",
    "牛",
    "猴",
    "蛇",
    "虎"
  ],
  "sixPool": [
    "马",
    "羊",
    "兔",
    "龙",
    "狗",
    "牛"
  ],
  "goldVotes": {
    "虎": 5,
    "猪": 6,
    "鼠": 2,
    "蛇": 2,
    "狗": 2,
    "羊": 4,
    "鸡": 1
  },
  "missing": {
    "马": 20,
    "羊": 24,
    "猴": 3,
    "鸡": 4,
    "狗": 11,
    "猪": 1,
    "鼠": 0,
    "牛": 2,
    "虎": 10,
    "兔": 17,
    "龙": 5,
    "蛇": 7
  },
  "fixedKillSet": [
    "鼠",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "龙",
    "狗",
    "虎",
    "羊",
    "马",
    "猪",
    "牛",
    "鸡",
    "猴",
    "蛇",
    "兔"
  ],
  "oraclePool": [
    "鼠",
    "龙",
    "虎",
    "羊",
    "马",
    "猪",
    "牛",
    "蛇",
    "兔"
  ],
  "hechongPool": [
    "鼠",
    "龙",
    "狗",
    "虎",
    "羊",
    "马",
    "牛",
    "猴"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};