var predictionMaxData = {
  "time": "2026-06-18 21:32:32",
  "issue": "2026169",
  "code": "44,37,30,8,40,22,24",
  "zodiac": "猪,马,牛,猪,兔,鸡,羊",
  "wave": "green,blue,red,red,red,green,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026170",
  "ninePool": [
    "鸡",
    "猴",
    "蛇",
    "猪",
    "兔",
    "狗",
    "牛",
    "马",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "蛇",
    "猪",
    "兔",
    "狗"
  ],
  "goldVotes": {
    "猴": 5,
    "蛇": 2,
    "龙": 4,
    "兔": 2,
    "马": 3,
    "虎": 6,
    "羊": 2,
    "鼠": 4,
    "猪": 1,
    "鸡": 1
  },
  "missing": {
    "马": 6,
    "羊": 0,
    "猴": 27,
    "鸡": 46,
    "狗": 5,
    "猪": 7,
    "鼠": 2,
    "牛": 3,
    "虎": 15,
    "兔": 11,
    "龙": 1,
    "蛇": 9
  },
  "fixedKillSet": [
    "羊",
    "兔"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "虎",
    "鸡",
    "猴",
    "牛",
    "羊",
    "猪",
    "狗",
    "蛇",
    "龙",
    "兔"
  ],
  "oraclePool": [
    "鸡",
    "猴",
    "羊",
    "猪",
    "狗",
    "蛇",
    "马",
    "兔",
    "龙"
  ],
  "hechongPool": [
    "鼠",
    "鸡",
    "羊",
    "牛",
    "猪",
    "蛇",
    "马",
    "兔"
  ],
  "dynamicRate9": 74.28571428571429,
  "dynamicRate6": 57.14285714285714
};