var predictionMaxData = {
  "time": "2026-06-26 21:32:32",
  "issue": "2026177",
  "code": "19,21,5,1,2,44,14",
  "zodiac": "鼠,狗,虎,马,蛇,猪,蛇",
  "wave": "red,green,green,red,red,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026178",
  "ninePool": [
    "猴",
    "牛",
    "狗",
    "马",
    "鼠",
    "虎",
    "猪",
    "羊",
    "鸡"
  ],
  "sixPool": [
    "猴",
    "牛",
    "狗",
    "马",
    "鼠",
    "虎"
  ],
  "goldVotes": {
    "猪": 4,
    "蛇": 7,
    "兔": 8,
    "鼠": 6,
    "马": 4,
    "羊": 6,
    "狗": 3,
    "鸡": 4,
    "龙": 4,
    "虎": 2,
    "猴": 2
  },
  "missing": {
    "马": 14,
    "羊": 8,
    "猴": 35,
    "鸡": 1,
    "狗": 13,
    "猪": 5,
    "鼠": 10,
    "牛": 11,
    "虎": 3,
    "兔": 6,
    "龙": 7,
    "蛇": 0
  },
  "fixedKillSet": [
    "蛇",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "蛇",
    "马",
    "猪",
    "猴",
    "虎",
    "兔",
    "龙",
    "牛",
    "鸡"
  ],
  "oraclePool": [
    "羊",
    "蛇",
    "马",
    "猴",
    "狗",
    "猪",
    "牛",
    "鼠",
    "鸡"
  ],
  "hechongPool": [
    "羊",
    "蛇",
    "猪",
    "猴",
    "兔",
    "虎",
    "牛",
    "鸡"
  ],
  "dynamicRate9": 76.74418604651163,
  "dynamicRate6": 60.46511627906976
};