var predictionMaxData = {
  "time": "2026-10-08 21:32:32",
  "issue": "2026281",
  "code": "22,19,21,32,48,38,10",
  "zodiac": "鸡,鼠,狗,猪,羊,蛇,鸡",
  "wave": "green,red,green,green,blue,green,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026282",
  "ninePool": [
    "羊",
    "牛",
    "兔",
    "猪",
    "狗",
    "龙",
    "虎",
    "蛇",
    "马"
  ],
  "sixPool": [
    "羊",
    "牛",
    "兔",
    "猪",
    "狗",
    "龙"
  ],
  "goldVotes": {
    "兔": 4,
    "猪": 4,
    "马": 9,
    "鸡": 2,
    "羊": 3,
    "牛": 3,
    "鼠": 4,
    "蛇": 1,
    "虎": 2,
    "猴": 4,
    "狗": 2
  },
  "missing": {
    "马": 16,
    "羊": 20,
    "猴": 4,
    "鸡": 0,
    "狗": 7,
    "猪": 15,
    "鼠": 11,
    "牛": 19,
    "虎": 6,
    "兔": 13,
    "龙": 1,
    "蛇": 3
  },
  "fixedKillSet": [
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "虎",
    "鼠",
    "牛",
    "猴",
    "蛇",
    "鸡",
    "狗",
    "龙",
    "羊",
    "猪"
  ],
  "oraclePool": [
    "虎",
    "鼠",
    "兔",
    "牛",
    "猴",
    "鸡",
    "狗",
    "龙",
    "猪"
  ],
  "hechongPool": [
    "牛",
    "蛇",
    "鸡",
    "狗",
    "兔",
    "龙",
    "羊",
    "猪"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};