var predictionMaxData = {
  "time": "2026-09-22 21:32:32",
  "issue": "2026265",
  "code": "5,46,40,23,26,44,49",
  "zodiac": "虎,鸡,兔,猴,蛇,猪,马",
  "wave": "green,red,red,red,blue,green,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026266",
  "ninePool": [
    "虎",
    "龙",
    "猴",
    "鼠",
    "羊",
    "狗",
    "牛",
    "蛇",
    "鸡"
  ],
  "sixPool": [
    "虎",
    "龙",
    "猴",
    "鼠",
    "羊",
    "狗"
  ],
  "goldVotes": {
    "牛": 3,
    "鼠": 3,
    "猪": 5,
    "马": 5,
    "猴": 3,
    "兔": 7,
    "鸡": 3,
    "蛇": 5,
    "龙": 3,
    "虎": 1,
    "狗": 1
  },
  "missing": {
    "马": 0,
    "羊": 4,
    "猴": 16,
    "鸡": 6,
    "狗": 1,
    "猪": 5,
    "鼠": 8,
    "牛": 3,
    "虎": 26,
    "兔": 12,
    "龙": 25,
    "蛇": 11
  },
  "fixedKillSet": [
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "兔",
    "牛",
    "羊",
    "猪",
    "龙",
    "蛇",
    "马",
    "猴",
    "虎"
  ],
  "oraclePool": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "蛇",
    "马",
    "猴",
    "鼠",
    "狗"
  ],
  "hechongPool": [
    "龙",
    "牛",
    "羊",
    "马",
    "猴",
    "鼠",
    "虎",
    "狗"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0
};