var predictionMaxData = {
  "time": "2026-07-10 21:32:32",
  "issue": "2026191",
  "code": "19,43,39,24,16,26,29",
  "zodiac": "鼠,鼠,龙,羊,兔,蛇,虎",
  "wave": "red,green,green,red,green,blue,red",
  "teSx": "虎",
  "teWei": 9,
  "nextIssue": "2026192",
  "ninePool": [
    "猪",
    "狗",
    "鼠",
    "鸡",
    "蛇",
    "马",
    "兔",
    "牛",
    "猴"
  ],
  "sixPool": [
    "猪",
    "狗",
    "鼠",
    "鸡",
    "蛇",
    "马"
  ],
  "goldVotes": {
    "龙": 7,
    "鼠": 1,
    "鸡": 2,
    "羊": 6,
    "猪": 3,
    "猴": 7,
    "马": 2,
    "牛": 6,
    "蛇": 4,
    "虎": 2
  },
  "missing": {
    "马": 4,
    "羊": 6,
    "猴": 5,
    "鸡": 15,
    "狗": 11,
    "猪": 19,
    "鼠": 10,
    "牛": 13,
    "虎": 0,
    "兔": 1,
    "龙": 2,
    "蛇": 14
  },
  "fixedKillSet": [
    "鸡",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "羊",
    "马",
    "虎",
    "猴",
    "猪",
    "鸡",
    "蛇",
    "兔",
    "牛"
  ],
  "oraclePool": [
    "狗",
    "羊",
    "马",
    "猴",
    "鸡",
    "猪",
    "龙",
    "兔",
    "蛇"
  ],
  "hechongPool": [
    "狗",
    "虎",
    "猴",
    "猪",
    "鼠",
    "龙",
    "马",
    "蛇"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};