var predictionMaxData = {
  "time": "2026-07-11 21:32:32",
  "issue": "2026192",
  "code": "27,30,45,8,1,37,25",
  "zodiac": "龙,牛,狗,猪,马,马,马",
  "wave": "green,red,red,red,red,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026193",
  "ninePool": [
    "猪",
    "牛",
    "鸡",
    "鼠",
    "狗",
    "蛇",
    "虎",
    "龙",
    "羊"
  ],
  "sixPool": [
    "猪",
    "牛",
    "鸡",
    "鼠",
    "狗",
    "蛇"
  ],
  "goldVotes": {
    "兔": 6,
    "牛": 2,
    "龙": 3,
    "猪": 10,
    "猴": 4,
    "羊": 5,
    "鸡": 2,
    "蛇": 2,
    "虎": 2,
    "鼠": 2,
    "马": 2
  },
  "missing": {
    "马": 0,
    "羊": 7,
    "猴": 6,
    "鸡": 16,
    "狗": 12,
    "猪": 20,
    "鼠": 11,
    "牛": 14,
    "虎": 1,
    "兔": 2,
    "龙": 3,
    "蛇": 15
  },
  "fixedKillSet": [
    "马",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "鸡",
    "兔",
    "牛",
    "猪",
    "羊",
    "蛇",
    "马",
    "猴",
    "虎",
    "龙",
    "狗"
  ],
  "oraclePool": [
    "鸡",
    "鼠",
    "牛",
    "猪",
    "羊",
    "马",
    "猴",
    "虎",
    "狗"
  ],
  "hechongPool": [
    "鼠",
    "牛",
    "羊",
    "马",
    "猴",
    "虎",
    "龙",
    "狗"
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 60.0
};