var predictionMaxData = {
  "time": "2026-08-26 21:32:32",
  "issue": "2026238",
  "code": "35,44,23,4,7,21,17",
  "zodiac": "猴,猪,猴,兔,鼠,狗,虎",
  "wave": "red,green,red,blue,red,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026239",
  "ninePool": [
    "鸡",
    "狗",
    "蛇",
    "马",
    "龙",
    "兔",
    "猴",
    "羊",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "蛇",
    "马",
    "龙",
    "兔"
  ],
  "goldVotes": {
    "马": 4,
    "兔": 4,
    "猪": 6,
    "鸡": 6,
    "猴": 1,
    "牛": 7,
    "龙": 2,
    "鼠": 5,
    "羊": 2,
    "蛇": 2,
    "虎": 3
  },
  "missing": {
    "马": 13,
    "羊": 1,
    "猴": 2,
    "鸡": 62,
    "狗": 14,
    "猪": 3,
    "鼠": 5,
    "牛": 6,
    "虎": 0,
    "兔": 8,
    "龙": 4,
    "蛇": 9
  },
  "fixedKillSet": [
    "猴",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "猴",
    "牛",
    "羊",
    "马",
    "龙",
    "猪",
    "蛇",
    "虎",
    "鸡"
  ],
  "oraclePool": [
    "猴",
    "牛",
    "羊",
    "马",
    "龙",
    "蛇",
    "虎",
    "兔",
    "鼠"
  ],
  "hechongPool": [
    "狗",
    "猴",
    "马",
    "龙",
    "猪",
    "蛇",
    "虎",
    "鼠"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};