var predictionMaxData = {
  "time": "2026-08-29 21:32:32",
  "issue": "2026241",
  "code": "29,45,27,21,42,41,49",
  "zodiac": "虎,狗,龙,狗,牛,虎,马",
  "wave": "red,red,green,green,blue,blue,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026242",
  "ninePool": [
    "鸡",
    "狗",
    "兔",
    "猴",
    "虎",
    "龙",
    "蛇",
    "羊",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "兔",
    "猴",
    "虎",
    "龙"
  ],
  "goldVotes": {
    "牛": 4,
    "鼠": 5,
    "猪": 2,
    "马": 1,
    "猴": 2,
    "兔": 3,
    "鸡": 8,
    "羊": 2,
    "蛇": 7,
    "龙": 2,
    "虎": 1,
    "狗": 2
  },
  "missing": {
    "马": 0,
    "羊": 4,
    "猴": 5,
    "鸡": 65,
    "狗": 17,
    "猪": 6,
    "鼠": 8,
    "牛": 9,
    "虎": 2,
    "兔": 11,
    "龙": 1,
    "蛇": 12
  },
  "fixedKillSet": [
    "马",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "兔",
    "牛",
    "羊",
    "猴",
    "鸡",
    "龙",
    "虎",
    "狗",
    "蛇"
  ],
  "oraclePool": [
    "马",
    "兔",
    "羊",
    "猴",
    "鸡",
    "龙",
    "虎",
    "狗",
    "蛇"
  ],
  "hechongPool": [
    "马",
    "牛",
    "羊",
    "猴",
    "龙",
    "虎",
    "狗",
    "鼠"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0
};