var predictionMaxData = {
  "time": "2026-07-15 21:32:32",
  "issue": "2026196",
  "code": "3,37,24,10,41,19,39",
  "zodiac": "龙,马,羊,鸡,虎,鼠,龙",
  "wave": "blue,blue,red,blue,blue,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026197",
  "ninePool": [
    "鸡",
    "猪",
    "猴",
    "羊",
    "鼠",
    "虎",
    "牛",
    "兔",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "猴",
    "羊",
    "鼠",
    "虎"
  ],
  "goldVotes": {
    "牛": 5,
    "鼠": 3,
    "猪": 8,
    "猴": 2,
    "龙": 5,
    "狗": 7,
    "羊": 2,
    "马": 6,
    "蛇": 7,
    "鸡": 2,
    "兔": 2
  },
  "missing": {
    "马": 1,
    "羊": 11,
    "猴": 10,
    "鸡": 20,
    "狗": 3,
    "猪": 24,
    "鼠": 15,
    "牛": 18,
    "虎": 5,
    "兔": 6,
    "龙": 0,
    "蛇": 2
  },
  "fixedKillSet": [
    "龙",
    "兔"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "牛",
    "马",
    "鸡",
    "兔",
    "鼠",
    "猪",
    "虎",
    "猴",
    "龙",
    "蛇",
    "羊"
  ],
  "oraclePool": [
    "狗",
    "马",
    "兔",
    "猴",
    "鸡",
    "虎",
    "龙",
    "蛇",
    "羊"
  ],
  "hechongPool": [
    "狗",
    "鸡",
    "猴",
    "马",
    "鼠",
    "兔",
    "虎",
    "龙"
  ],
  "dynamicRate9": 70.0,
  "dynamicRate6": 60.0
};