var predictionMaxData = {
  "time": "2026-09-23 21:32:32",
  "issue": "2026266",
  "code": "38,42,37,29,45,18,8",
  "zodiac": "蛇,牛,马,虎,狗,牛,猪",
  "wave": "green,blue,blue,red,red,red,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026267",
  "ninePool": [
    "虎",
    "龙",
    "蛇",
    "兔",
    "猴",
    "羊",
    "牛",
    "鼠",
    "鸡"
  ],
  "sixPool": [
    "虎",
    "龙",
    "蛇",
    "兔",
    "猴",
    "羊"
  ],
  "goldVotes": {
    "鼠": 9,
    "猪": 7,
    "马": 7,
    "狗": 7,
    "鸡": 6,
    "兔": 1,
    "龙": 3,
    "虎": 2,
    "牛": 2,
    "羊": 2,
    "猴": 1
  },
  "missing": {
    "马": 1,
    "羊": 5,
    "猴": 17,
    "鸡": 7,
    "狗": 2,
    "猪": 0,
    "鼠": 9,
    "牛": 4,
    "虎": 27,
    "兔": 13,
    "龙": 26,
    "蛇": 12
  },
  "fixedKillSet": [
    "狗",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "兔",
    "马",
    "蛇",
    "猴",
    "鸡",
    "虎",
    "龙",
    "狗",
    "猪"
  ],
  "oraclePool": [
    "鼠",
    "兔",
    "马",
    "羊",
    "牛",
    "蛇",
    "虎",
    "龙",
    "猪"
  ],
  "hechongPool": [
    "兔",
    "羊",
    "牛",
    "蛇",
    "猴",
    "鸡",
    "虎",
    "猪"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0
};