var predictionMaxData = {
  "time": "2026-06-05 21:32:32",
  "issue": "2026156",
  "code": "31,16,11,3,37,12,1",
  "zodiac": "鼠,兔,猴,龙,马,羊,马",
  "wave": "blue,green,green,blue,blue,red,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026157",
  "ninePool": [
    "鸡",
    "牛",
    "羊",
    "猴",
    "兔",
    "龙",
    "蛇",
    "猪",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "羊",
    "猴",
    "兔",
    "龙"
  ],
  "goldVotes": {
    "猪": 9,
    "狗": 4,
    "猴": 3,
    "鼠": 4,
    "蛇": 4,
    "马": 3,
    "龙": 1,
    "虎": 5,
    "鸡": 2,
    "兔": 2
  },
  "missing": {
    "马": 0,
    "羊": 8,
    "猴": 14,
    "鸡": 33,
    "狗": 4,
    "猪": 13,
    "鼠": 1,
    "牛": 10,
    "虎": 2,
    "兔": 16,
    "龙": 7,
    "蛇": 19
  },
  "fixedKillSet": [
    "鼠",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "蛇",
    "虎",
    "兔",
    "猴",
    "鼠",
    "马",
    "鸡",
    "猪",
    "龙",
    "牛"
  ],
  "oraclePool": [
    "羊",
    "猴",
    "虎",
    "鼠",
    "马",
    "鸡",
    "狗",
    "猪",
    "牛"
  ],
  "hechongPool": [
    "羊",
    "虎",
    "猴",
    "鼠",
    "马",
    "狗",
    "龙",
    "牛"
  ],
  "dynamicRate9": 77.27272727272727,
  "dynamicRate6": 63.63636363636363
};