var predictionMaxData = {
  "time": "2026-06-21 21:32:32",
  "issue": "2026172",
  "code": "28,34,42,37,45,8,44",
  "zodiac": "兔,鸡,牛,马,狗,猪,猪",
  "wave": "green,red,blue,blue,red,red,green",
  "teSx": "猪",
  "teWei": 4,
  "nextIssue": "2026173",
  "ninePool": [
    "鸡",
    "猴",
    "虎",
    "牛",
    "蛇",
    "马",
    "鼠",
    "羊",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "虎",
    "牛",
    "蛇",
    "马"
  ],
  "goldVotes": {
    "虎": 3,
    "狗": 9,
    "猪": 5,
    "猴": 5,
    "羊": 5,
    "马": 1,
    "蛇": 6,
    "龙": 5,
    "兔": 5,
    "鼠": 3,
    "鸡": 2
  },
  "missing": {
    "马": 9,
    "羊": 3,
    "猴": 30,
    "鸡": 49,
    "狗": 8,
    "猪": 0,
    "鼠": 5,
    "牛": 6,
    "虎": 18,
    "兔": 1,
    "龙": 2,
    "蛇": 12
  },
  "fixedKillSet": [
    "马",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "羊",
    "马",
    "猪",
    "兔",
    "蛇",
    "猴",
    "虎",
    "龙"
  ],
  "oraclePool": [
    "羊",
    "鼠",
    "马",
    "兔",
    "猪",
    "蛇",
    "牛",
    "虎",
    "龙"
  ],
  "hechongPool": [
    "鸡",
    "羊",
    "兔",
    "猪",
    "蛇",
    "猴",
    "牛",
    "虎"
  ],
  "dynamicRate9": 73.68421052631578,
  "dynamicRate6": 57.89473684210527
};