var predictionMaxData = {
  "time": "2026-06-07 21:32:32",
  "issue": "2026158",
  "code": "43,48,3,1,12,23,16",
  "zodiac": "鼠,羊,龙,马,羊,猴,兔",
  "wave": "green,blue,blue,red,red,red,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026159",
  "ninePool": [
    "鸡",
    "猪",
    "牛",
    "蛇",
    "猴",
    "羊",
    "龙",
    "鼠",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "牛",
    "蛇",
    "猴",
    "羊"
  ],
  "goldVotes": {
    "羊": 4,
    "虎": 6,
    "马": 4,
    "蛇": 4,
    "猴": 6,
    "狗": 3,
    "猪": 2,
    "牛": 1,
    "鼠": 2,
    "龙": 3,
    "兔": 1
  },
  "missing": {
    "马": 2,
    "羊": 10,
    "猴": 16,
    "鸡": 35,
    "狗": 6,
    "猪": 15,
    "鼠": 3,
    "牛": 12,
    "虎": 4,
    "兔": 0,
    "龙": 9,
    "蛇": 21
  },
  "fixedKillSet": [
    "蛇",
    "兔"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "鸡",
    "蛇",
    "马",
    "猪",
    "虎",
    "牛",
    "狗"
  ],
  "oraclePool": [
    "鸡",
    "羊",
    "猪",
    "猴",
    "牛",
    "虎",
    "兔",
    "狗",
    "鼠"
  ],
  "hechongPool": [
    "龙",
    "羊",
    "鸡",
    "蛇",
    "猪",
    "牛",
    "兔",
    "狗"
  ],
  "dynamicRate9": 79.16666666666666,
  "dynamicRate6": 66.66666666666666
};