var predictionMaxData = {
  "time": "2026-10-10 21:32:32",
  "issue": "2026283",
  "code": "35,8,15,6,21,1,18",
  "zodiac": "猴,猪,龙,牛,狗,马,牛",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026284",
  "ninePool": [
    "马",
    "猪",
    "鼠",
    "兔",
    "羊",
    "虎",
    "狗",
    "蛇",
    "龙"
  ],
  "sixPool": [
    "马",
    "猪",
    "鼠",
    "兔",
    "羊",
    "虎"
  ],
  "goldVotes": {
    "鸡": 8,
    "猴": 6,
    "蛇": 5,
    "狗": 4,
    "羊": 5,
    "牛": 6,
    "龙": 6,
    "猪": 1
  },
  "missing": {
    "马": 18,
    "羊": 22,
    "猴": 1,
    "鸡": 2,
    "狗": 9,
    "猪": 17,
    "鼠": 13,
    "牛": 0,
    "虎": 8,
    "兔": 15,
    "龙": 3,
    "蛇": 5
  },
  "fixedKillSet": [
    "牛",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "兔",
    "猴",
    "牛",
    "羊",
    "龙",
    "蛇",
    "猪",
    "鸡",
    "狗"
  ],
  "oraclePool": [
    "虎",
    "牛",
    "兔",
    "龙",
    "马",
    "狗",
    "蛇",
    "猪",
    "鼠"
  ],
  "hechongPool": [
    "牛",
    "兔",
    "羊",
    "马",
    "蛇",
    "猪",
    "鸡",
    "鼠"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};