var predictionMaxData = {
  "time": "2026-10-30 21:32:32",
  "issue": "2026303",
  "code": "8,28,40,3,38,49,17",
  "zodiac": "猪,兔,兔,龙,蛇,马,虎",
  "wave": "red,green,red,blue,green,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026304",
  "ninePool": [
    "龙",
    "鸡",
    "牛",
    "鼠",
    "羊",
    "兔",
    "猪",
    "猴",
    "马"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "牛",
    "鼠",
    "羊",
    "兔"
  ],
  "goldVotes": {
    "鸡": 5,
    "龙": 6,
    "牛": 4,
    "猴": 2,
    "羊": 1,
    "蛇": 5,
    "虎": 4,
    "马": 3,
    "狗": 3,
    "鼠": 2,
    "猪": 2
  },
  "missing": {
    "马": 6,
    "羊": 11,
    "猴": 4,
    "鸡": 22,
    "狗": 1,
    "猪": 5,
    "鼠": 18,
    "牛": 20,
    "虎": 0,
    "兔": 9,
    "龙": 23,
    "蛇": 3
  },
  "fixedKillSet": [
    "虎",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "鸡",
    "龙",
    "猴",
    "虎",
    "鼠",
    "羊",
    "牛",
    "马",
    "兔",
    "狗",
    "猪"
  ],
  "oraclePool": [
    "蛇",
    "鸡",
    "猴",
    "鼠",
    "羊",
    "牛",
    "马",
    "狗",
    "猪"
  ],
  "hechongPool": [
    "蛇",
    "龙",
    "猴",
    "虎",
    "鼠",
    "马",
    "狗",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};