var predictionMaxData = {
  "time": "2026-08-27 21:32:32",
  "issue": "2026239",
  "code": "47,43,34,17,22,7,5",
  "zodiac": "猴,鼠,鸡,虎,鸡,鼠,虎",
  "wave": "blue,green,red,green,green,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026240",
  "ninePool": [
    "鸡",
    "狗",
    "蛇",
    "鼠",
    "兔",
    "龙",
    "马",
    "猪",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "蛇",
    "鼠",
    "兔",
    "龙"
  ],
  "goldVotes": {
    "马": 5,
    "兔": 2,
    "猪": 3,
    "鸡": 3,
    "猴": 7,
    "羊": 6,
    "龙": 2,
    "牛": 5,
    "虎": 2,
    "蛇": 2
  },
  "missing": {
    "马": 14,
    "羊": 2,
    "猴": 3,
    "鸡": 63,
    "狗": 15,
    "猪": 4,
    "鼠": 6,
    "牛": 7,
    "虎": 0,
    "兔": 9,
    "龙": 5,
    "蛇": 10
  },
  "fixedKillSet": [
    "虎",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "龙",
    "虎",
    "猪",
    "鸡",
    "牛",
    "猴",
    "兔",
    "狗",
    "羊"
  ],
  "oraclePool": [
    "蛇",
    "龙",
    "虎",
    "猪",
    "鸡",
    "鼠",
    "牛",
    "兔",
    "狗"
  ],
  "hechongPool": [
    "蛇",
    "龙",
    "虎",
    "猪",
    "鼠",
    "猴",
    "狗",
    "马"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};