var predictionMaxData = {
  "time": "2026-09-21 21:32:32",
  "issue": "2026264",
  "code": "10,6,8,31,22,24,21",
  "zodiac": "鸡,牛,猪,鼠,鸡,羊,狗",
  "wave": "blue,green,red,blue,green,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026265",
  "ninePool": [
    "虎",
    "龙",
    "兔",
    "鸡",
    "鼠",
    "马",
    "猪",
    "猴",
    "羊"
  ],
  "sixPool": [
    "虎",
    "龙",
    "兔",
    "鸡",
    "鼠",
    "马"
  ],
  "goldVotes": {
    "猴": 7,
    "马": 2,
    "狗": 5,
    "鸡": 2,
    "龙": 7,
    "蛇": 4,
    "虎": 2,
    "牛": 2,
    "鼠": 2
  },
  "missing": {
    "马": 8,
    "羊": 3,
    "猴": 15,
    "鸡": 5,
    "狗": 0,
    "猪": 4,
    "鼠": 7,
    "牛": 2,
    "虎": 25,
    "兔": 11,
    "龙": 24,
    "蛇": 10
  },
  "fixedKillSet": [
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "马",
    "猪",
    "蛇",
    "龙",
    "牛",
    "虎",
    "鼠",
    "羊"
  ],
  "oraclePool": [
    "猪",
    "鸡",
    "蛇",
    "龙",
    "牛",
    "虎",
    "鼠",
    "狗",
    "兔"
  ],
  "hechongPool": [
    "猴",
    "马",
    "鸡",
    "龙",
    "虎",
    "鼠",
    "狗",
    "兔"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0
};