var predictionMaxData = {
  "time": "2026-08-20 21:32:32",
  "issue": "2026232",
  "code": "29,10,17,4,46,20,42",
  "zodiac": "虎,鸡,虎,兔,鸡,猪,牛",
  "wave": "red,blue,green,blue,red,blue,blue",
  "teSx": "牛",
  "teWei": 2,
  "nextIssue": "2026233",
  "ninePool": [
    "鸡",
    "龙",
    "鼠",
    "狗",
    "虎",
    "兔",
    "猪",
    "羊",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "鼠",
    "狗",
    "虎",
    "兔"
  ],
  "goldVotes": {
    "鼠": 2,
    "猴": 3,
    "蛇": 6,
    "虎": 1,
    "龙": 1,
    "羊": 8,
    "马": 4,
    "兔": 2,
    "牛": 5,
    "猪": 2,
    "鸡": 3
  },
  "missing": {
    "马": 7,
    "羊": 12,
    "猴": 4,
    "鸡": 56,
    "狗": 8,
    "猪": 1,
    "鼠": 13,
    "牛": 0,
    "虎": 6,
    "兔": 2,
    "龙": 27,
    "蛇": 3
  },
  "fixedKillSet": [
    "牛",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "猪",
    "鸡",
    "虎",
    "龙",
    "猴",
    "羊",
    "兔",
    "蛇"
  ],
  "oraclePool": [
    "牛",
    "猪",
    "虎",
    "龙",
    "狗",
    "兔",
    "鼠",
    "蛇",
    "马"
  ],
  "hechongPool": [
    "牛",
    "猪",
    "蛇",
    "羊",
    "兔",
    "鼠",
    "鸡",
    "马"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};