var predictionMaxData = {
  "time": "2026-10-18 21:32:32",
  "issue": "2026291",
  "code": "32,10,41,38,22,2,17",
  "zodiac": "猪,鸡,虎,蛇,鸡,蛇,虎",
  "wave": "green,blue,blue,green,green,red,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026292",
  "ninePool": [
    "狗",
    "龙",
    "鼠",
    "猴",
    "鸡",
    "猪",
    "兔",
    "蛇",
    "牛"
  ],
  "sixPool": [
    "狗",
    "龙",
    "鼠",
    "猴",
    "鸡",
    "猪"
  ],
  "goldVotes": {
    "鸡": 3,
    "龙": 3,
    "牛": 9,
    "马": 1,
    "虎": 3,
    "猪": 2,
    "鼠": 1,
    "羊": 3,
    "猴": 2,
    "蛇": 3
  },
  "missing": {
    "马": 3,
    "羊": 5,
    "猴": 9,
    "鸡": 10,
    "狗": 17,
    "猪": 4,
    "鼠": 6,
    "牛": 8,
    "虎": 0,
    "兔": 1,
    "龙": 11,
    "蛇": 2
  },
  "fixedKillSet": [
    "虎",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "龙",
    "兔",
    "马",
    "猪",
    "蛇",
    "羊",
    "猴",
    "鼠",
    "鸡",
    "虎"
  ],
  "oraclePool": [
    "牛",
    "狗",
    "龙",
    "兔",
    "猪",
    "鼠",
    "蛇",
    "鸡",
    "虎"
  ],
  "hechongPool": [
    "狗",
    "龙",
    "马",
    "猪",
    "鼠",
    "蛇",
    "猴",
    "虎"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};