var predictionMaxData = {
  "time": "2026-10-20 21:32:32",
  "issue": "2026293",
  "code": "38,10,48,49,13,9,5",
  "zodiac": "蛇,鸡,羊,马,马,狗,虎",
  "wave": "green,blue,blue,green,red,blue,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026294",
  "ninePool": [
    "狗",
    "猴",
    "鸡",
    "蛇",
    "鼠",
    "龙",
    "羊",
    "牛",
    "猪"
  ],
  "sixPool": [
    "狗",
    "猴",
    "鸡",
    "蛇",
    "鼠",
    "龙"
  ],
  "goldVotes": {
    "龙": 4,
    "兔": 4,
    "牛": 10,
    "猪": 5,
    "狗": 1,
    "马": 4,
    "虎": 2,
    "羊": 1,
    "猴": 1,
    "蛇": 1,
    "鼠": 4,
    "鸡": 1
  },
  "missing": {
    "马": 5,
    "羊": 1,
    "猴": 11,
    "鸡": 12,
    "狗": 19,
    "猪": 6,
    "鼠": 8,
    "牛": 10,
    "虎": 0,
    "兔": 3,
    "龙": 13,
    "蛇": 4
  },
  "fixedKillSet": [
    "马",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "虎",
    "狗",
    "龙",
    "马",
    "猴",
    "鸡",
    "牛",
    "猪",
    "兔",
    "蛇",
    "羊"
  ],
  "oraclePool": [
    "鼠",
    "虎",
    "狗",
    "马",
    "猴",
    "鸡",
    "牛",
    "猪",
    "羊"
  ],
  "hechongPool": [
    "鼠",
    "虎",
    "狗",
    "龙",
    "马",
    "猴",
    "猪",
    "蛇"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};