var predictionMaxData = {
  "time": "2026-10-14 21:32:32",
  "issue": "2026287",
  "code": "19,47,38,35,6,17,8",
  "zodiac": "鼠,猴,蛇,猴,牛,虎,猪",
  "wave": "red,blue,green,red,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026288",
  "ninePool": [
    "马",
    "兔",
    "虎",
    "牛",
    "蛇",
    "猴",
    "羊",
    "鼠",
    "狗"
  ],
  "sixPool": [
    "马",
    "兔",
    "虎",
    "牛",
    "蛇",
    "猴"
  ],
  "goldVotes": {
    "狗": 4,
    "鸡": 6,
    "虎": 1,
    "蛇": 3,
    "龙": 6,
    "猪": 2,
    "猴": 3,
    "兔": 2,
    "鼠": 2,
    "羊": 2
  },
  "missing": {
    "马": 22,
    "羊": 1,
    "猴": 5,
    "鸡": 6,
    "狗": 13,
    "猪": 0,
    "鼠": 2,
    "牛": 4,
    "虎": 12,
    "兔": 19,
    "龙": 7,
    "蛇": 9
  },
  "fixedKillSet": [
    "马",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "羊",
    "猪",
    "狗",
    "兔",
    "鸡",
    "蛇",
    "牛",
    "龙",
    "虎"
  ],
  "oraclePool": [
    "猴",
    "羊",
    "兔",
    "马",
    "鸡",
    "蛇",
    "牛",
    "龙",
    "虎"
  ],
  "hechongPool": [
    "猴",
    "羊",
    "猪",
    "兔",
    "鸡",
    "蛇",
    "牛",
    "虎"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0
};