var predictionMaxData = {
  "time": "2026-10-01 21:32:32",
  "issue": "2026274",
  "code": "12,16,32,5,39,36,33",
  "zodiac": "羊,兔,猪,虎,龙,羊,狗",
  "wave": "red,green,green,green,green,blue,green",
  "teSx": "狗",
  "teWei": 3,
  "nextIssue": "2026275",
  "ninePool": [
    "龙",
    "羊",
    "牛",
    "猪",
    "猴",
    "马",
    "鼠",
    "鸡",
    "虎"
  ],
  "sixPool": [
    "龙",
    "羊",
    "牛",
    "猪",
    "猴",
    "马"
  ],
  "goldVotes": {
    "马": 6,
    "兔": 6,
    "猪": 2,
    "牛": 1,
    "鸡": 4,
    "虎": 2,
    "猴": 2,
    "龙": 5,
    "鼠": 1,
    "狗": 1,
    "蛇": 3
  },
  "missing": {
    "马": 9,
    "羊": 13,
    "猴": 3,
    "鸡": 5,
    "狗": 0,
    "猪": 8,
    "鼠": 4,
    "牛": 12,
    "虎": 1,
    "兔": 6,
    "龙": 34,
    "蛇": 2
  },
  "fixedKillSet": [
    "鼠",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "虎",
    "鼠",
    "龙",
    "马",
    "狗",
    "兔",
    "羊",
    "猴",
    "猪"
  ],
  "oraclePool": [
    "蛇",
    "鼠",
    "龙",
    "马",
    "狗",
    "鸡",
    "羊",
    "猴",
    "猪"
  ],
  "hechongPool": [
    "虎",
    "鼠",
    "龙",
    "马",
    "狗",
    "兔",
    "鸡",
    "猴"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.0
};