var predictionMaxData = {
  "time": "2026-08-09 21:32:32",
  "issue": "2026221",
  "code": "24,14,18,48,46,28,1",
  "zodiac": "羊,蛇,牛,羊,鸡,兔,马",
  "wave": "red,blue,red,blue,red,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026222",
  "ninePool": [
    "鸡",
    "狗",
    "龙",
    "猴",
    "兔",
    "牛",
    "猪",
    "虎",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "龙",
    "猴",
    "兔",
    "牛"
  ],
  "goldVotes": {
    "猪": 5,
    "鸡": 5,
    "猴": 3,
    "马": 3,
    "蛇": 5,
    "牛": 4,
    "鼠": 5,
    "狗": 2,
    "羊": 2,
    "兔": 3,
    "虎": 2
  },
  "missing": {
    "马": 0,
    "羊": 1,
    "猴": 8,
    "鸡": 45,
    "狗": 28,
    "猪": 12,
    "鼠": 2,
    "牛": 9,
    "虎": 3,
    "兔": 7,
    "龙": 16,
    "蛇": 4
  },
  "fixedKillSet": [
    "马",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "猪",
    "狗",
    "龙",
    "虎",
    "鼠",
    "羊",
    "马",
    "猴",
    "蛇",
    "鸡"
  ],
  "oraclePool": [
    "牛",
    "狗",
    "虎",
    "龙",
    "鼠",
    "兔",
    "马",
    "猪",
    "蛇"
  ],
  "hechongPool": [
    "牛",
    "狗",
    "虎",
    "龙",
    "鼠",
    "羊",
    "马",
    "猴"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 64.0
};