var predictionMaxData = {
  "time": "2026-09-29 21:32:32",
  "issue": "2026272",
  "code": "43,15,4,6,32,36,2",
  "zodiac": "鼠,龙,兔,牛,猪,羊,蛇",
  "wave": "green,blue,blue,green,green,blue,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026273",
  "ninePool": [
    "虎",
    "龙",
    "羊",
    "牛",
    "猪",
    "马",
    "鼠",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "虎",
    "龙",
    "羊",
    "牛",
    "猪",
    "马"
  ],
  "goldVotes": {
    "猪": 2,
    "蛇": 1,
    "兔": 4,
    "鼠": 3,
    "狗": 4,
    "鸡": 6,
    "龙": 5,
    "猴": 3,
    "马": 3,
    "羊": 2
  },
  "missing": {
    "马": 7,
    "羊": 11,
    "猴": 1,
    "鸡": 3,
    "狗": 8,
    "猪": 6,
    "鼠": 2,
    "牛": 10,
    "虎": 33,
    "兔": 4,
    "龙": 32,
    "蛇": 0
  },
  "fixedKillSet": [
    "蛇",
    "牛"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "虎",
    "猴",
    "蛇",
    "马",
    "猪",
    "鼠",
    "兔",
    "狗",
    "鸡"
  ],
  "oraclePool": [
    "龙",
    "羊",
    "虎",
    "蛇",
    "牛",
    "鼠",
    "兔",
    "猪",
    "马"
  ],
  "hechongPool": [
    "羊",
    "虎",
    "猴",
    "蛇",
    "牛",
    "猪",
    "兔",
    "鸡"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0
};