var predictionMaxData = {
  "time": "2026-10-03 21:32:32",
  "issue": "2026276",
  "code": "2,21,17,40,11,24,14",
  "zodiac": "蛇,狗,虎,兔,猴,羊,蛇",
  "wave": "red,green,green,red,green,red,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026277",
  "ninePool": [
    "龙",
    "牛",
    "马",
    "鼠",
    "猴",
    "虎",
    "猪",
    "兔",
    "鸡"
  ],
  "sixPool": [
    "龙",
    "牛",
    "马",
    "鼠",
    "猴",
    "虎"
  ],
  "goldVotes": {
    "龙": 7,
    "狗": 8,
    "羊": 5,
    "猪": 5,
    "鸡": 4,
    "蛇": 4,
    "兔": 6,
    "马": 1,
    "猴": 2
  },
  "missing": {
    "马": 11,
    "羊": 15,
    "猴": 5,
    "鸡": 7,
    "狗": 2,
    "猪": 10,
    "鼠": 6,
    "牛": 14,
    "虎": 1,
    "兔": 8,
    "龙": 36,
    "蛇": 0
  },
  "fixedKillSet": [
    "蛇",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "牛",
    "鼠",
    "猴",
    "蛇",
    "兔",
    "猪",
    "龙",
    "狗",
    "羊",
    "虎"
  ],
  "oraclePool": [
    "鸡",
    "鼠",
    "猴",
    "兔",
    "猪",
    "龙",
    "狗",
    "牛",
    "虎"
  ],
  "hechongPool": [
    "鸡",
    "羊",
    "猴",
    "蛇",
    "兔",
    "猪",
    "牛",
    "虎"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.0
};