var predictionMaxData = {
  "time": "2026-08-25 21:32:32",
  "issue": "2026237",
  "code": "47,36,14,6,41,25,12",
  "zodiac": "猴,羊,蛇,牛,虎,马,羊",
  "wave": "blue,blue,blue,green,blue,blue,red",
  "teSx": "羊",
  "teWei": 2,
  "nextIssue": "2026238",
  "ninePool": [
    "鸡",
    "狗",
    "马",
    "兔",
    "鼠",
    "猪",
    "牛",
    "蛇",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "马",
    "兔",
    "鼠",
    "猪"
  ],
  "goldVotes": {
    "虎": 9,
    "狗": 2,
    "鸡": 2,
    "羊": 2,
    "马": 3,
    "鼠": 2,
    "猴": 6,
    "龙": 2,
    "牛": 2,
    "蛇": 4,
    "兔": 2
  },
  "missing": {
    "马": 12,
    "羊": 0,
    "猴": 1,
    "鸡": 61,
    "狗": 13,
    "猪": 2,
    "鼠": 4,
    "牛": 5,
    "虎": 11,
    "兔": 7,
    "龙": 3,
    "蛇": 8
  },
  "fixedKillSet": [
    "龙",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "兔",
    "鸡",
    "猴",
    "虎",
    "羊",
    "牛",
    "狗",
    "龙",
    "猪",
    "蛇",
    "马"
  ],
  "oraclePool": [
    "兔",
    "鸡",
    "猴",
    "虎",
    "羊",
    "狗",
    "龙",
    "蛇",
    "马"
  ],
  "hechongPool": [
    "蛇",
    "兔",
    "鸡",
    "鼠",
    "牛",
    "猪",
    "羊",
    "马"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};