var predictionMaxData = {
  "time": "2026-06-16 21:32:32",
  "issue": "2026167",
  "code": "23,3,40,39,7,11,19",
  "zodiac": "猴,龙,兔,龙,鼠,猴,鼠",
  "wave": "red,blue,red,green,red,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026168",
  "ninePool": [
    "鸡",
    "猴",
    "羊",
    "虎",
    "兔",
    "蛇",
    "龙",
    "鼠",
    "马"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "羊",
    "虎",
    "兔",
    "蛇"
  ],
  "goldVotes": {
    "猪": 5,
    "马": 4,
    "蛇": 2,
    "龙": 3,
    "狗": 5,
    "猴": 5,
    "羊": 2,
    "虎": 1,
    "鼠": 1,
    "牛": 2
  },
  "missing": {
    "马": 4,
    "羊": 19,
    "猴": 25,
    "鸡": 44,
    "狗": 3,
    "猪": 5,
    "鼠": 0,
    "牛": 1,
    "虎": 13,
    "兔": 9,
    "龙": 2,
    "蛇": 7
  },
  "fixedKillSet": [
    "鼠",
    "牛"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "鸡",
    "马",
    "猪",
    "虎",
    "猴",
    "龙",
    "牛",
    "蛇",
    "兔"
  ],
  "oraclePool": [
    "马",
    "虎",
    "鼠",
    "猴",
    "羊",
    "龙",
    "牛",
    "蛇",
    "兔"
  ],
  "hechongPool": [
    "狗",
    "马",
    "猴",
    "鼠",
    "虎",
    "羊",
    "龙",
    "牛"
  ],
  "dynamicRate9": 72.72727272727273,
  "dynamicRate6": 57.57575757575758
};