var predictionMaxData = {
  "time": "2026-06-23 21:32:32",
  "issue": "2026174",
  "code": "15,8,34,13,28,21,41",
  "zodiac": "龙,猪,鸡,马,兔,狗,虎",
  "wave": "blue,red,red,red,green,green,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026175",
  "ninePool": [
    "鸡",
    "猴",
    "狗",
    "马",
    "龙",
    "兔",
    "蛇",
    "鼠",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "狗",
    "马",
    "龙",
    "兔"
  ],
  "goldVotes": {
    "牛": 12,
    "鼠": 4,
    "羊": 6,
    "蛇": 2,
    "猴": 3,
    "虎": 3,
    "马": 1,
    "龙": 2,
    "兔": 2,
    "猪": 4
  },
  "missing": {
    "马": 11,
    "羊": 5,
    "猴": 32,
    "鸡": 51,
    "狗": 10,
    "猪": 2,
    "鼠": 7,
    "牛": 8,
    "虎": 0,
    "兔": 3,
    "龙": 4,
    "蛇": 1
  },
  "fixedKillSet": [
    "虎",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "猪",
    "猴",
    "鸡",
    "蛇",
    "龙",
    "羊",
    "马",
    "牛",
    "虎"
  ],
  "oraclePool": [
    "狗",
    "猴",
    "猪",
    "鸡",
    "蛇",
    "龙",
    "羊",
    "马",
    "兔"
  ],
  "hechongPool": [
    "狗",
    "猴",
    "猪",
    "蛇",
    "龙",
    "马",
    "虎",
    "鼠"
  ],
  "dynamicRate9": 75.0,
  "dynamicRate6": 60.0
};