var predictionMaxData = {
  "time": "2026-07-22 21:32:32",
  "issue": "2026203",
  "code": "12,11,31,3,44,37,25",
  "zodiac": "羊,猴,鼠,龙,猪,马,马",
  "wave": "red,green,blue,blue,green,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026204",
  "ninePool": [
    "牛",
    "鸡",
    "虎",
    "猴",
    "龙",
    "狗",
    "羊",
    "鼠",
    "蛇"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "虎",
    "猴",
    "龙",
    "狗"
  ],
  "goldVotes": {
    "猪": 7,
    "鸡": 4,
    "猴": 5,
    "马": 4,
    "蛇": 4,
    "兔": 6,
    "狗": 3,
    "牛": 2,
    "羊": 3,
    "虎": 2,
    "鼠": 4
  },
  "missing": {
    "马": 0,
    "羊": 4,
    "猴": 17,
    "鸡": 27,
    "狗": 10,
    "猪": 2,
    "鼠": 5,
    "牛": 25,
    "虎": 12,
    "兔": 1,
    "龙": 3,
    "蛇": 9
  },
  "fixedKillSet": [
    "马",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "蛇",
    "龙",
    "羊",
    "鼠",
    "牛",
    "兔",
    "马",
    "猴",
    "虎",
    "猪"
  ],
  "oraclePool": [
    "蛇",
    "龙",
    "羊",
    "兔",
    "鼠",
    "牛",
    "马",
    "猴",
    "虎"
  ],
  "hechongPool": [
    "龙",
    "羊",
    "狗",
    "鼠",
    "牛",
    "马",
    "猴",
    "虎"
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 60.0
};