var predictionMaxData = {
  "time": "2026-08-02 21:32:32",
  "issue": "2026214",
  "code": "29,30,27,38,43,31,4",
  "zodiac": "虎,牛,龙,蛇,鼠,鼠,兔",
  "wave": "red,red,green,green,green,blue,blue",
  "teSx": "兔",
  "teWei": 4,
  "nextIssue": "2026215",
  "ninePool": [
    "鸡",
    "蛇",
    "羊",
    "狗",
    "牛",
    "马",
    "龙",
    "鼠",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "羊",
    "狗",
    "牛",
    "马"
  ],
  "goldVotes": {
    "猪": 3,
    "狗": 7,
    "鸡": 2,
    "猴": 2,
    "蛇": 3,
    "兔": 2,
    "虎": 8,
    "马": 1,
    "羊": 3,
    "龙": 4
  },
  "missing": {
    "马": 3,
    "羊": 15,
    "猴": 1,
    "鸡": 38,
    "狗": 21,
    "猪": 5,
    "鼠": 6,
    "牛": 2,
    "虎": 10,
    "兔": 0,
    "龙": 9,
    "蛇": 20
  },
  "fixedKillSet": [
    "狗",
    "兔"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "虎",
    "牛",
    "猴",
    "狗",
    "猪",
    "鼠",
    "蛇"
  ],
  "oraclePool": [
    "龙",
    "鸡",
    "兔",
    "虎",
    "牛",
    "猴",
    "羊",
    "马",
    "蛇"
  ],
  "hechongPool": [
    "龙",
    "鸡",
    "兔",
    "牛",
    "羊",
    "狗",
    "猪",
    "蛇"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};