var predictionMaxData = {
  "time": "2026-10-11 21:32:32",
  "issue": "2026284",
  "code": "4,35,22,48,3,18,32",
  "zodiac": "兔,猴,鸡,羊,龙,牛,猪",
  "wave": "blue,red,green,blue,blue,red,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026285",
  "ninePool": [
    "羊",
    "兔",
    "马",
    "猴",
    "鼠",
    "牛",
    "狗",
    "虎",
    "蛇"
  ],
  "sixPool": [
    "羊",
    "兔",
    "马",
    "猴",
    "鼠",
    "牛"
  ],
  "goldVotes": {
    "虎": 8,
    "狗": 6,
    "猪": 4,
    "猴": 2,
    "羊": 2,
    "马": 3,
    "蛇": 3,
    "龙": 6,
    "鼠": 6,
    "鸡": 6,
    "兔": 2,
    "牛": 1
  },
  "missing": {
    "马": 19,
    "羊": 23,
    "猴": 2,
    "鸡": 3,
    "狗": 10,
    "猪": 0,
    "鼠": 14,
    "牛": 1,
    "虎": 9,
    "兔": 16,
    "龙": 4,
    "蛇": 6
  },
  "fixedKillSet": [
    "猪",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "鸡",
    "狗",
    "虎",
    "牛",
    "马",
    "蛇",
    "猴",
    "羊",
    "猪",
    "鼠"
  ],
  "oraclePool": [
    "龙",
    "鸡",
    "狗",
    "马",
    "蛇",
    "猴",
    "羊",
    "猪",
    "鼠"
  ],
  "hechongPool": [
    "鸡",
    "虎",
    "牛",
    "兔",
    "蛇",
    "猴",
    "羊",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};