var predictionMaxData = {
  "time": "2026-09-05 21:32:32",
  "issue": "2026248",
  "code": "43,26,49,39,14,27,20",
  "zodiac": "鼠,蛇,马,龙,蛇,龙,猪",
  "wave": "green,blue,green,green,blue,green,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026249",
  "ninePool": [
    "蛇",
    "鼠",
    "羊",
    "牛",
    "猴",
    "兔",
    "鸡",
    "马",
    "龙"
  ],
  "sixPool": [
    "蛇",
    "鼠",
    "羊",
    "牛",
    "猴",
    "兔"
  ],
  "goldVotes": {
    "狗": 11,
    "鸡": 4,
    "虎": 4,
    "羊": 2,
    "马": 5,
    "龙": 6,
    "兔": 2,
    "猴": 6,
    "猪": 2
  },
  "missing": {
    "马": 7,
    "羊": 11,
    "猴": 12,
    "鸡": 4,
    "狗": 5,
    "猪": 0,
    "鼠": 15,
    "牛": 2,
    "虎": 9,
    "兔": 1,
    "龙": 8,
    "蛇": 19
  },
  "fixedKillSet": [
    "猪",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "龙",
    "兔",
    "狗",
    "马",
    "羊",
    "鸡",
    "蛇",
    "牛",
    "虎"
  ],
  "oraclePool": [
    "猪",
    "猴",
    "鼠",
    "狗",
    "马",
    "羊",
    "鸡",
    "蛇",
    "牛"
  ],
  "hechongPool": [
    "猪",
    "兔",
    "猴",
    "羊",
    "鸡",
    "蛇",
    "牛",
    "虎"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};