var predictionMaxData = {
  "time": "2026-05-30 21:32:32",
  "issue": "2026150",
  "code": "11,4,22,25,44,19,9",
  "zodiac": "猴,兔,鸡,马,猪,鼠,狗",
  "wave": "green,blue,green,blue,green,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026151",
  "ninePool": [
    "鸡",
    "猴",
    "兔",
    "龙",
    "羊",
    "虎",
    "马",
    "蛇",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "兔",
    "龙",
    "羊",
    "虎"
  ],
  "goldVotes": {
    "虎": 3,
    "狗": 2,
    "鼠": 4,
    "马": 3,
    "兔": 3,
    "猴": 2,
    "蛇": 6,
    "猪": 6,
    "牛": 4,
    "鸡": 4
  },
  "missing": {
    "马": 3,
    "羊": 2,
    "猴": 8,
    "鸡": 27,
    "狗": 0,
    "猪": 7,
    "鼠": 6,
    "牛": 4,
    "虎": 5,
    "兔": 10,
    "龙": 1,
    "蛇": 13
  },
  "fixedKillSet": [
    "狗",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "狗",
    "蛇",
    "龙",
    "兔",
    "鼠",
    "猪",
    "虎",
    "鸡",
    "羊"
  ],
  "oraclePool": [
    "马",
    "蛇",
    "龙",
    "兔",
    "鼠",
    "猴",
    "牛",
    "虎",
    "羊"
  ],
  "hechongPool": [
    "马",
    "狗",
    "兔",
    "龙",
    "鼠",
    "猴",
    "虎",
    "鸡"
  ],
  "dynamicRate9": 93.75,
  "dynamicRate6": 75.0
};