var predictionMaxData = {
  "time": "2026-10-04 21:32:32",
  "issue": "2026277",
  "code": "41,23,14,31,13,32,11",
  "zodiac": "虎,猴,蛇,鼠,马,猪,猴",
  "wave": "blue,red,blue,blue,red,green,green",
  "teSx": "猴",
  "teWei": 1,
  "nextIssue": "2026278",
  "ninePool": [
    "龙",
    "羊",
    "猪",
    "牛",
    "马",
    "兔",
    "鸡",
    "鼠",
    "狗"
  ],
  "sixPool": [
    "龙",
    "羊",
    "猪",
    "牛",
    "马",
    "兔"
  ],
  "goldVotes": {
    "鼠": 6,
    "牛": 2,
    "马": 3,
    "蛇": 5,
    "龙": 5,
    "虎": 4,
    "狗": 5,
    "鸡": 6,
    "猴": 1,
    "兔": 1
  },
  "missing": {
    "马": 12,
    "羊": 16,
    "猴": 0,
    "鸡": 8,
    "狗": 3,
    "猪": 11,
    "鼠": 7,
    "牛": 15,
    "虎": 2,
    "兔": 9,
    "龙": 37,
    "蛇": 1
  },
  "fixedKillSet": [
    "猴",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "鸡",
    "鼠",
    "羊",
    "龙",
    "蛇",
    "兔",
    "虎",
    "牛",
    "猪",
    "狗",
    "猴"
  ],
  "oraclePool": [
    "马",
    "鸡",
    "羊",
    "牛",
    "虎",
    "猴",
    "猪",
    "狗",
    "鼠"
  ],
  "hechongPool": [
    "马",
    "龙",
    "蛇",
    "虎",
    "猴",
    "猪",
    "狗",
    "鼠"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.0
};