var predictionMaxData = {
  "time": "2026-07-21 21:32:32",
  "issue": "2026202",
  "code": "21,15,25,47,13,45,40",
  "zodiac": "狗,龙,马,猴,马,狗,兔",
  "wave": "green,blue,blue,blue,red,red,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026203",
  "ninePool": [
    "鸡",
    "牛",
    "猴",
    "羊",
    "蛇",
    "鼠",
    "狗",
    "猪",
    "马"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猴",
    "羊",
    "蛇",
    "鼠"
  ],
  "goldVotes": {
    "马": 3,
    "龙": 4,
    "虎": 7,
    "狗": 4,
    "鼠": 1,
    "兔": 2,
    "牛": 3,
    "蛇": 2,
    "猪": 2,
    "猴": 2
  },
  "missing": {
    "马": 7,
    "羊": 3,
    "猴": 16,
    "鸡": 26,
    "狗": 9,
    "猪": 1,
    "鼠": 4,
    "牛": 24,
    "虎": 11,
    "兔": 0,
    "龙": 2,
    "蛇": 8
  },
  "fixedKillSet": [
    "兔",
    "牛"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "羊",
    "狗",
    "牛",
    "虎",
    "龙",
    "猴",
    "蛇",
    "猪",
    "马",
    "鼠"
  ],
  "oraclePool": [
    "鸡",
    "羊",
    "狗",
    "牛",
    "虎",
    "猴",
    "猪",
    "马",
    "鼠"
  ],
  "hechongPool": [
    "鸡",
    "羊",
    "狗",
    "牛",
    "龙",
    "猪",
    "蛇",
    "兔"
  ],
  "dynamicRate9": 70.0,
  "dynamicRate6": 57.99999999999999
};