var predictionMaxData = {
  "time": "2026-06-17 21:32:32",
  "issue": "2026168",
  "code": "27,11,24,5,40,33,15",
  "zodiac": "龙,猴,羊,虎,兔,狗,龙",
  "wave": "green,green,red,green,red,green,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026169",
  "ninePool": [
    "鸡",
    "猴",
    "羊",
    "兔",
    "虎",
    "牛",
    "马",
    "狗",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "羊",
    "兔",
    "虎",
    "牛"
  ],
  "goldVotes": {
    "牛": 1,
    "鼠": 5,
    "猪": 5,
    "猴": 3,
    "龙": 4,
    "虎": 4,
    "狗": 4,
    "鸡": 6,
    "马": 4,
    "蛇": 4,
    "兔": 2,
    "羊": 1
  },
  "missing": {
    "马": 5,
    "羊": 20,
    "猴": 26,
    "鸡": 45,
    "狗": 4,
    "猪": 6,
    "鼠": 1,
    "牛": 2,
    "虎": 14,
    "兔": 10,
    "龙": 0,
    "蛇": 8
  },
  "fixedKillSet": [
    "蛇",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "羊",
    "狗",
    "虎",
    "牛",
    "猪",
    "蛇",
    "龙",
    "马",
    "兔",
    "鸡"
  ],
  "oraclePool": [
    "羊",
    "狗",
    "猪",
    "猴",
    "蛇",
    "龙",
    "马",
    "兔",
    "鸡"
  ],
  "hechongPool": [
    "鼠",
    "狗",
    "虎",
    "猴",
    "龙",
    "马",
    "兔",
    "鸡"
  ],
  "dynamicRate9": 73.52941176470588,
  "dynamicRate6": 58.82352941176471
};