var predictionMaxData = {
  "time": "2026-06-22 21:32:32",
  "issue": "2026173",
  "code": "39,6,16,40,13,19,26",
  "zodiac": "龙,牛,兔,兔,马,鼠,蛇",
  "wave": "green,green,green,red,red,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026174",
  "ninePool": [
    "鸡",
    "猴",
    "虎",
    "马",
    "牛",
    "鼠",
    "兔",
    "羊",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "虎",
    "马",
    "牛",
    "鼠"
  ],
  "goldVotes": {
    "猪": 8,
    "狗": 6,
    "鸡": 6,
    "猴": 3,
    "羊": 3,
    "龙": 6,
    "牛": 2,
    "虎": 3,
    "马": 2,
    "蛇": 2,
    "鼠": 1
  },
  "missing": {
    "马": 10,
    "羊": 4,
    "猴": 31,
    "鸡": 50,
    "狗": 9,
    "猪": 1,
    "鼠": 6,
    "牛": 7,
    "虎": 19,
    "兔": 2,
    "龙": 3,
    "蛇": 0
  },
  "fixedKillSet": [
    "狗",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "鼠",
    "猪",
    "马",
    "虎",
    "鸡",
    "狗",
    "猴",
    "蛇",
    "牛"
  ],
  "oraclePool": [
    "羊",
    "鼠",
    "马",
    "猪",
    "虎",
    "鸡",
    "狗",
    "猴",
    "牛"
  ],
  "hechongPool": [
    "羊",
    "猪",
    "虎",
    "鸡",
    "兔",
    "猴",
    "牛",
    "蛇"
  ],
  "dynamicRate9": 74.35897435897436,
  "dynamicRate6": 58.97435897435898
};