var predictionMaxData = {
  "time": "2026-09-16 21:32:32",
  "issue": "2026259",
  "code": "43,33,49,36,19,30,22",
  "zodiac": "鼠,狗,马,羊,鼠,牛,鸡",
  "wave": "green,green,green,blue,red,red,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026260",
  "ninePool": [
    "羊",
    "虎",
    "龙",
    "狗",
    "兔",
    "鼠",
    "牛",
    "猴",
    "猪"
  ],
  "sixPool": [
    "羊",
    "虎",
    "龙",
    "狗",
    "兔",
    "鼠"
  ],
  "goldVotes": {
    "猴": 7,
    "蛇": 6,
    "虎": 2,
    "鸡": 2,
    "马": 10,
    "牛": 4,
    "兔": 3,
    "狗": 2,
    "猪": 3,
    "龙": 1
  },
  "missing": {
    "马": 3,
    "羊": 22,
    "猴": 10,
    "鸡": 0,
    "狗": 16,
    "猪": 4,
    "鼠": 2,
    "牛": 8,
    "虎": 20,
    "兔": 6,
    "龙": 19,
    "蛇": 5
  },
  "fixedKillSet": [
    "鸡",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "羊",
    "龙",
    "鸡",
    "牛",
    "鼠",
    "马",
    "狗",
    "蛇",
    "猪",
    "虎"
  ],
  "oraclePool": [
    "猴",
    "羊",
    "龙",
    "牛",
    "鼠",
    "马",
    "兔",
    "蛇",
    "虎"
  ],
  "hechongPool": [
    "羊",
    "龙",
    "鸡",
    "牛",
    "兔",
    "狗",
    "蛇",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 66.0
};