var predictionMaxData = {
  "time": "2026-08-03 21:32:32",
  "issue": "2026215",
  "code": "19,38,30,13,1,11,14",
  "zodiac": "鼠,蛇,牛,马,马,猴,蛇",
  "wave": "red,green,red,red,red,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026216",
  "ninePool": [
    "鸡",
    "狗",
    "羊",
    "虎",
    "龙",
    "猴",
    "牛",
    "猪",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "羊",
    "虎",
    "龙",
    "猴"
  ],
  "goldVotes": {
    "猪": 9,
    "蛇": 3,
    "兔": 6,
    "鼠": 8,
    "牛": 2,
    "狗": 6,
    "鸡": 6,
    "羊": 3,
    "马": 6,
    "猴": 1
  },
  "missing": {
    "马": 4,
    "羊": 16,
    "猴": 2,
    "鸡": 39,
    "狗": 22,
    "猪": 6,
    "鼠": 7,
    "牛": 3,
    "虎": 11,
    "兔": 1,
    "龙": 10,
    "蛇": 0
  },
  "fixedKillSet": [
    "虎",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "猪",
    "马",
    "龙",
    "猴",
    "鸡",
    "羊",
    "蛇",
    "鼠",
    "牛",
    "兔"
  ],
  "oraclePool": [
    "虎",
    "猪",
    "马",
    "狗",
    "猴",
    "鸡",
    "羊",
    "鼠",
    "牛"
  ],
  "hechongPool": [
    "虎",
    "猪",
    "猴",
    "鸡",
    "羊",
    "蛇",
    "牛",
    "兔"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};