var predictionMaxData = {
  "time": "2026-09-10 21:32:32",
  "issue": "2026253",
  "code": "5,35,15,28,13,49,16",
  "zodiac": "虎,猴,龙,兔,马,马,兔",
  "wave": "green,red,blue,green,red,green,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026254",
  "ninePool": [
    "鼠",
    "羊",
    "龙",
    "马",
    "虎",
    "牛",
    "狗",
    "猴",
    "鸡"
  ],
  "sixPool": [
    "鼠",
    "羊",
    "龙",
    "马",
    "虎",
    "牛"
  ],
  "goldVotes": {
    "猪": 6,
    "狗": 8,
    "鸡": 3,
    "猴": 1,
    "鼠": 2,
    "虎": 2,
    "马": 1,
    "蛇": 3,
    "羊": 1,
    "兔": 1
  },
  "missing": {
    "马": 12,
    "羊": 16,
    "猴": 4,
    "鸡": 1,
    "狗": 10,
    "猪": 5,
    "鼠": 20,
    "牛": 2,
    "虎": 14,
    "兔": 0,
    "龙": 13,
    "蛇": 3
  },
  "fixedKillSet": [
    "兔",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "鸡",
    "猪",
    "兔",
    "蛇",
    "龙",
    "猴",
    "牛",
    "虎",
    "马",
    "羊"
  ],
  "oraclePool": [
    "狗",
    "鼠",
    "鸡",
    "猪",
    "猴",
    "牛",
    "虎",
    "马",
    "羊"
  ],
  "hechongPool": [
    "狗",
    "鸡",
    "兔",
    "猪",
    "蛇",
    "龙",
    "牛",
    "羊"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};