var predictionMaxData = {
  "time": "2026-07-05 21:32:32",
  "issue": "2026186",
  "code": "17,29,22,1,5,38,23",
  "zodiac": "虎,虎,鸡,马,虎,蛇,猴",
  "wave": "green,red,green,red,green,green,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026187",
  "ninePool": [
    "兔",
    "龙",
    "狗",
    "马",
    "鼠",
    "蛇",
    "牛",
    "鸡",
    "虎"
  ],
  "sixPool": [
    "兔",
    "龙",
    "狗",
    "马",
    "鼠",
    "蛇"
  ],
  "goldVotes": {
    "鼠": 2,
    "蛇": 5,
    "牛": 3,
    "猪": 7,
    "狗": 3,
    "鸡": 7,
    "猴": 7,
    "羊": 5,
    "虎": 4,
    "龙": 2,
    "马": 2
  },
  "missing": {
    "马": 2,
    "羊": 1,
    "猴": 0,
    "鸡": 10,
    "狗": 6,
    "猪": 14,
    "鼠": 5,
    "牛": 8,
    "虎": 4,
    "兔": 15,
    "龙": 7,
    "蛇": 9
  },
  "fixedKillSet": [
    "猪",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "龙",
    "马",
    "牛",
    "鸡",
    "虎",
    "蛇",
    "猴",
    "羊"
  ],
  "oraclePool": [
    "龙",
    "马",
    "鸡",
    "虎",
    "蛇",
    "猴",
    "羊",
    "兔",
    "狗"
  ],
  "hechongPool": [
    "猪",
    "龙",
    "马",
    "鼠",
    "虎",
    "蛇",
    "猴",
    "狗"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0
};