var predictionMaxData = {
  "time": "2026-08-16 21:32:32",
  "issue": "2026228",
  "code": "38,26,8,6,29,18,23",
  "zodiac": "蛇,蛇,猪,牛,虎,牛,猴",
  "wave": "green,blue,red,green,red,red,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026229",
  "ninePool": [
    "鸡",
    "龙",
    "猪",
    "牛",
    "蛇",
    "鼠",
    "狗",
    "羊",
    "马"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "猪",
    "牛",
    "蛇",
    "鼠"
  ],
  "goldVotes": {
    "龙": 4,
    "兔": 4,
    "虎": 6,
    "猪": 2,
    "猴": 4,
    "马": 6,
    "鼠": 2,
    "狗": 2,
    "羊": 6,
    "鸡": 2,
    "蛇": 1,
    "牛": 1
  },
  "missing": {
    "马": 3,
    "羊": 8,
    "猴": 0,
    "鸡": 52,
    "狗": 4,
    "猪": 19,
    "鼠": 9,
    "牛": 16,
    "虎": 2,
    "兔": 1,
    "龙": 23,
    "蛇": 6
  },
  "fixedKillSet": [
    "虎",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "兔",
    "鸡",
    "鼠",
    "蛇",
    "马",
    "猪",
    "虎",
    "狗",
    "龙",
    "牛",
    "猴"
  ],
  "oraclePool": [
    "羊",
    "兔",
    "鸡",
    "蛇",
    "马",
    "虎",
    "狗",
    "龙",
    "猴"
  ],
  "hechongPool": [
    "鼠",
    "蛇",
    "马",
    "猪",
    "虎",
    "狗",
    "龙",
    "猴"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};