var predictionMaxData = {
  "time": "2026-08-11 21:32:32",
  "issue": "2026223",
  "code": "21,43,1,38,29,44,23",
  "zodiac": "狗,鼠,马,蛇,虎,猪,猴",
  "wave": "green,green,red,green,red,green,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026224",
  "ninePool": [
    "鸡",
    "狗",
    "龙",
    "猪",
    "兔",
    "牛",
    "虎",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "龙",
    "猪",
    "兔",
    "牛"
  ],
  "goldVotes": {
    "狗": 5,
    "羊": 3,
    "鸡": 5,
    "马": 4,
    "鼠": 3,
    "虎": 3,
    "牛": 1,
    "兔": 2,
    "猴": 2,
    "蛇": 2,
    "龙": 1
  },
  "missing": {
    "马": 2,
    "羊": 3,
    "猴": 0,
    "鸡": 47,
    "狗": 30,
    "猪": 14,
    "鼠": 4,
    "牛": 11,
    "虎": 5,
    "兔": 9,
    "龙": 18,
    "蛇": 1
  },
  "fixedKillSet": [
    "鸡",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "蛇",
    "兔",
    "马",
    "羊",
    "虎",
    "猴",
    "鼠",
    "鸡",
    "猪",
    "牛",
    "龙"
  ],
  "oraclePool": [
    "狗",
    "蛇",
    "兔",
    "马",
    "虎",
    "猴",
    "鸡",
    "羊",
    "龙"
  ],
  "hechongPool": [
    "狗",
    "蛇",
    "马",
    "虎",
    "猴",
    "鼠",
    "猪",
    "龙"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};