var predictionMaxData = {
  "time": "2026-05-26 21:32:32",
  "issue": "2026146",
  "code": "11,30,20,19,5,16,42",
  "zodiac": "猴,牛,猪,鼠,虎,兔,牛",
  "wave": "green,red,blue,red,green,green,blue",
  "teSx": "牛",
  "teWei": 2,
  "nextIssue": "2026147",
  "ninePool": [
    "龙",
    "鸡",
    "马",
    "羊",
    "兔",
    "鼠",
    "蛇",
    "猪",
    "狗"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "马",
    "羊",
    "兔",
    "鼠"
  ],
  "goldVotes": {
    "鸡": 3,
    "猴": 4,
    "蛇": 11,
    "牛": 1,
    "猪": 2,
    "虎": 4,
    "马": 2,
    "兔": 3,
    "羊": 1,
    "狗": 1
  },
  "missing": {
    "马": 8,
    "羊": 7,
    "猴": 4,
    "鸡": 23,
    "狗": 5,
    "猪": 3,
    "鼠": 2,
    "牛": 0,
    "虎": 1,
    "兔": 6,
    "龙": 22,
    "蛇": 9
  },
  "fixedKillSet": [
    "牛",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "狗",
    "龙",
    "羊",
    "虎",
    "猪",
    "鸡",
    "马",
    "蛇",
    "兔",
    "猴"
  ],
  "oraclePool": [
    "龙",
    "狗",
    "羊",
    "虎",
    "鸡",
    "马",
    "蛇",
    "兔",
    "猴"
  ],
  "hechongPool": [
    "鼠",
    "羊",
    "牛",
    "鸡",
    "猪",
    "马",
    "蛇",
    "兔"
  ],
  "dynamicRate9": 92.3076923076923,
  "dynamicRate6": 69.23076923076923
};