var predictionMaxData = {
  "time": "2026-07-18 21:32:32",
  "issue": "2026199",
  "code": "17,49,42,45,5,38,36",
  "zodiac": "虎,马,牛,狗,虎,蛇,羊",
  "wave": "green,green,blue,red,green,green,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026200",
  "ninePool": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "兔",
    "猪",
    "鼠",
    "龙",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "兔",
    "猪"
  ],
  "goldVotes": {
    "牛": 4,
    "鼠": 2,
    "狗": 2,
    "鸡": 1,
    "蛇": 5,
    "马": 8,
    "虎": 7,
    "羊": 4,
    "兔": 5,
    "猴": 2,
    "龙": 1,
    "猪": 1
  },
  "missing": {
    "马": 4,
    "羊": 0,
    "猴": 13,
    "鸡": 23,
    "狗": 6,
    "猪": 2,
    "鼠": 1,
    "牛": 21,
    "虎": 8,
    "兔": 9,
    "龙": 3,
    "蛇": 5
  },
  "fixedKillSet": [
    "羊",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "猴",
    "牛",
    "鸡",
    "马",
    "虎",
    "猪",
    "兔"
  ],
  "oraclePool": [
    "羊",
    "蛇",
    "龙",
    "狗",
    "猴",
    "鸡",
    "马",
    "虎",
    "兔"
  ],
  "hechongPool": [
    "羊",
    "蛇",
    "鼠",
    "牛",
    "鸡",
    "马",
    "猪",
    "兔"
  ],
  "dynamicRate9": 70.0,
  "dynamicRate6": 60.0
};