var predictionMaxData = {
  "time": "2026-07-03 21:32:32",
  "issue": "2026184",
  "code": "44,24,11,36,25,20,1",
  "zodiac": "猪,羊,猴,羊,马,猪,马",
  "wave": "green,red,green,blue,blue,blue,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026185",
  "ninePool": [
    "猴",
    "牛",
    "兔",
    "鼠",
    "猪",
    "鸡",
    "龙",
    "狗",
    "虎"
  ],
  "sixPool": [
    "猴",
    "牛",
    "兔",
    "鼠",
    "猪",
    "鸡"
  ],
  "goldVotes": {
    "狗": 5,
    "鸡": 5,
    "羊": 4,
    "蛇": 6,
    "马": 7,
    "虎": 5,
    "猪": 6,
    "龙": 1,
    "兔": 1
  },
  "missing": {
    "马": 0,
    "羊": 1,
    "猴": 42,
    "鸡": 8,
    "狗": 4,
    "猪": 12,
    "鼠": 3,
    "牛": 6,
    "虎": 2,
    "兔": 13,
    "龙": 5,
    "蛇": 7
  },
  "fixedKillSet": [
    "龙",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "蛇",
    "虎",
    "马",
    "兔",
    "龙",
    "鸡",
    "猴",
    "猪",
    "鼠",
    "牛",
    "羊"
  ],
  "oraclePool": [
    "狗",
    "虎",
    "马",
    "鸡",
    "猴",
    "猪",
    "鼠",
    "牛",
    "羊"
  ],
  "hechongPool": [
    "狗",
    "马",
    "牛",
    "龙",
    "猴",
    "鼠",
    "虎",
    "羊"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};