var predictionMaxData = {
  "time": "2026-09-08 21:32:32",
  "issue": "2026251",
  "code": "9,6,11,25,8,45,30",
  "zodiac": "狗,牛,猴,马,猪,狗,牛",
  "wave": "blue,green,green,blue,red,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026252",
  "ninePool": [
    "鼠",
    "虎",
    "猪",
    "羊",
    "兔",
    "鸡",
    "马",
    "猴",
    "龙"
  ],
  "sixPool": [
    "鼠",
    "虎",
    "猪",
    "羊",
    "兔",
    "鸡"
  ],
  "goldVotes": {
    "羊": 6,
    "马": 5,
    "蛇": 3,
    "牛": 5,
    "猪": 1,
    "龙": 4,
    "猴": 1,
    "狗": 5,
    "鸡": 1,
    "兔": 2,
    "鼠": 3
  },
  "missing": {
    "马": 10,
    "羊": 14,
    "猴": 2,
    "鸡": 7,
    "狗": 8,
    "猪": 3,
    "鼠": 18,
    "牛": 0,
    "虎": 12,
    "兔": 4,
    "龙": 11,
    "蛇": 1
  },
  "fixedKillSet": [
    "狗",
    "牛"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "狗",
    "虎",
    "鼠",
    "兔",
    "马",
    "鸡",
    "羊",
    "猪",
    "龙",
    "蛇"
  ],
  "oraclePool": [
    "牛",
    "鼠",
    "虎",
    "兔",
    "马",
    "羊",
    "猪",
    "龙",
    "蛇"
  ],
  "hechongPool": [
    "牛",
    "鼠",
    "兔",
    "马",
    "鸡",
    "羊",
    "猪",
    "蛇"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};