var predictionMaxData = {
  "time": "2026-07-30 21:32:32",
  "issue": "2026211",
  "code": "13,12,39,37,38,8,1",
  "zodiac": "马,羊,龙,马,蛇,猪,马",
  "wave": "red,red,green,blue,green,red,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026212",
  "ninePool": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "猴",
    "鼠",
    "蛇",
    "猪",
    "虎"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "猴",
    "鼠"
  ],
  "goldVotes": {
    "蛇": 4,
    "龙": 4,
    "鸡": 6,
    "马": 6,
    "虎": 2,
    "狗": 4,
    "鼠": 2,
    "羊": 2,
    "兔": 3,
    "牛": 2,
    "猪": 1
  },
  "missing": {
    "马": 0,
    "羊": 12,
    "猴": 5,
    "鸡": 35,
    "狗": 18,
    "猪": 2,
    "鼠": 3,
    "牛": 33,
    "虎": 7,
    "兔": 9,
    "龙": 6,
    "蛇": 17
  },
  "fixedKillSet": [
    "马",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "鸡",
    "蛇",
    "狗",
    "羊",
    "龙",
    "兔",
    "猪",
    "马",
    "虎",
    "牛"
  ],
  "oraclePool": [
    "猴",
    "鸡",
    "鼠",
    "蛇",
    "狗",
    "羊",
    "猪",
    "马",
    "牛"
  ],
  "hechongPool": [
    "猴",
    "鼠",
    "狗",
    "羊",
    "龙",
    "马",
    "虎",
    "牛"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};