var predictionMaxData = {
  "time": "2026-06-01 21:32:32",
  "issue": "2026152",
  "code": "34,47,16,36,44,1,45",
  "zodiac": "鸡,猴,兔,羊,猪,马,狗",
  "wave": "red,blue,green,blue,green,red,red",
  "teSx": "狗",
  "teWei": 5,
  "nextIssue": "2026153",
  "ninePool": [
    "鸡",
    "兔",
    "羊",
    "虎",
    "蛇",
    "猴",
    "鼠",
    "猪",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "羊",
    "虎",
    "蛇",
    "猴"
  ],
  "goldVotes": {
    "猴": 7,
    "马": 5,
    "龙": 4,
    "虎": 3,
    "兔": 9,
    "牛": 7,
    "猪": 3,
    "鸡": 3,
    "蛇": 5,
    "狗": 1,
    "鼠": 2,
    "羊": 1
  },
  "missing": {
    "马": 5,
    "羊": 4,
    "猴": 10,
    "鸡": 29,
    "狗": 0,
    "猪": 9,
    "鼠": 1,
    "牛": 6,
    "虎": 7,
    "兔": 12,
    "龙": 3,
    "蛇": 15
  },
  "fixedKillSet": [
    "狗",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "羊",
    "虎",
    "鸡",
    "兔",
    "马",
    "蛇",
    "猪",
    "猴"
  ],
  "oraclePool": [
    "鼠",
    "羊",
    "虎",
    "牛",
    "兔",
    "蛇",
    "马",
    "龙",
    "猴"
  ],
  "hechongPool": [
    "鼠",
    "虎",
    "鸡",
    "兔",
    "马",
    "狗",
    "龙",
    "猴"
  ],
  "dynamicRate9": 88.88888888888889,
  "dynamicRate6": 72.22222222222221
};