var predictionMaxData = {
  "time": "2026-10-07 21:32:32",
  "issue": "2026280",
  "code": "1,26,28,29,3,5,15",
  "zodiac": "马,蛇,兔,虎,龙,虎,龙",
  "wave": "red,blue,green,red,blue,green,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026281",
  "ninePool": [
    "鼠",
    "马",
    "猪",
    "兔",
    "牛",
    "羊",
    "猴",
    "蛇",
    "鸡"
  ],
  "sixPool": [
    "鼠",
    "马",
    "猪",
    "兔",
    "牛",
    "羊"
  ],
  "goldVotes": {
    "羊": 4,
    "牛": 3,
    "狗": 5,
    "马": 2,
    "鸡": 2,
    "兔": 1,
    "龙": 3,
    "虎": 1,
    "猴": 1,
    "蛇": 1
  },
  "missing": {
    "马": 15,
    "羊": 19,
    "猴": 3,
    "鸡": 1,
    "狗": 6,
    "猪": 14,
    "鼠": 10,
    "牛": 18,
    "虎": 5,
    "兔": 12,
    "龙": 0,
    "蛇": 2
  },
  "fixedKillSet": [
    "虎",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "猪",
    "龙",
    "猴",
    "狗",
    "马",
    "鸡",
    "羊",
    "牛",
    "虎",
    "兔"
  ],
  "oraclePool": [
    "蛇",
    "猪",
    "龙",
    "猴",
    "狗",
    "羊",
    "马",
    "鸡",
    "鼠"
  ],
  "hechongPool": [
    "兔",
    "龙",
    "猴",
    "狗",
    "鸡",
    "马",
    "虎",
    "鼠"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};