var predictionMaxData = {
  "time": "2026-07-29 21:32:32",
  "issue": "2026210",
  "code": "40,37,15,17,42,48,49",
  "zodiac": "兔,马,龙,虎,牛,羊,马",
  "wave": "red,blue,blue,green,blue,blue,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026211",
  "ninePool": [
    "牛",
    "鸡",
    "羊",
    "龙",
    "猴",
    "狗",
    "虎",
    "蛇",
    "鼠"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "羊",
    "龙",
    "猴",
    "狗"
  ],
  "goldVotes": {
    "鼠": 2,
    "狗": 6,
    "鸡": 7,
    "羊": 2,
    "蛇": 4,
    "猪": 5,
    "马": 4,
    "兔": 2,
    "虎": 2
  },
  "missing": {
    "马": 0,
    "羊": 11,
    "猴": 4,
    "鸡": 34,
    "狗": 17,
    "猪": 1,
    "鼠": 2,
    "牛": 32,
    "虎": 6,
    "兔": 8,
    "龙": 5,
    "蛇": 16
  },
  "fixedKillSet": [
    "兔",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "牛",
    "狗",
    "鸡",
    "虎",
    "龙",
    "猴",
    "蛇",
    "羊",
    "兔"
  ],
  "oraclePool": [
    "马",
    "龙",
    "鸡",
    "虎",
    "狗",
    "猴",
    "蛇",
    "羊",
    "兔"
  ],
  "hechongPool": [
    "牛",
    "马",
    "狗",
    "龙",
    "虎",
    "鼠",
    "猴",
    "羊"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};