var predictionMaxData = {
  "time": "2026-06-25 21:32:32",
  "issue": "2026176",
  "code": "30,31,2,36,38,15,10",
  "zodiac": "牛,鼠,蛇,羊,蛇,龙,鸡",
  "wave": "red,blue,red,blue,green,blue,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026177",
  "ninePool": [
    "猴",
    "狗",
    "龙",
    "羊",
    "牛",
    "马",
    "鼠",
    "猪",
    "虎"
  ],
  "sixPool": [
    "猴",
    "狗",
    "龙",
    "羊",
    "牛",
    "马"
  ],
  "goldVotes": {
    "鼠": 7,
    "鸡": 6,
    "马": 4,
    "蛇": 9,
    "羊": 3,
    "牛": 5,
    "猪": 4,
    "狗": 3,
    "兔": 8,
    "猴": 2,
    "虎": 2
  },
  "missing": {
    "马": 13,
    "羊": 7,
    "猴": 34,
    "鸡": 0,
    "狗": 12,
    "猪": 4,
    "鼠": 9,
    "牛": 10,
    "虎": 2,
    "兔": 5,
    "龙": 6,
    "蛇": 1
  },
  "fixedKillSet": [
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "羊",
    "鸡",
    "兔",
    "虎",
    "牛",
    "狗",
    "猴",
    "蛇",
    "猪",
    "鼠"
  ],
  "oraclePool": [
    "马",
    "鸡",
    "狗",
    "牛",
    "猴",
    "猪",
    "蛇",
    "羊",
    "鼠"
  ],
  "hechongPool": [
    "羊",
    "龙",
    "鸡",
    "兔",
    "牛",
    "狗",
    "蛇",
    "猪"
  ],
  "dynamicRate9": 76.19047619047619,
  "dynamicRate6": 59.523809523809526
};