var predictionMaxData = {
  "time": "2026-08-15 21:32:32",
  "issue": "2026227",
  "code": "23,24,29,7,13,31,16",
  "zodiac": "猴,羊,虎,鼠,马,鼠,兔",
  "wave": "red,red,red,red,red,blue,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026228",
  "ninePool": [
    "鸡",
    "龙",
    "牛",
    "猪",
    "羊",
    "鼠",
    "马",
    "狗",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "牛",
    "猪",
    "羊",
    "鼠"
  ],
  "goldVotes": {
    "猴": 7,
    "兔": 4,
    "鼠": 3,
    "猪": 4,
    "狗": 5,
    "马": 2,
    "蛇": 4,
    "虎": 5,
    "羊": 1,
    "龙": 2
  },
  "missing": {
    "马": 2,
    "羊": 7,
    "猴": 4,
    "鸡": 51,
    "狗": 3,
    "猪": 18,
    "鼠": 8,
    "牛": 15,
    "虎": 1,
    "兔": 0,
    "龙": 22,
    "蛇": 5
  },
  "fixedKillSet": [
    "兔",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "兔",
    "虎",
    "猴",
    "牛",
    "鸡",
    "猪",
    "羊",
    "马",
    "蛇",
    "鼠"
  ],
  "oraclePool": [
    "狗",
    "鼠",
    "牛",
    "猴",
    "虎",
    "猪",
    "羊",
    "马",
    "鸡"
  ],
  "hechongPool": [
    "狗",
    "兔",
    "牛",
    "龙",
    "猪",
    "羊",
    "蛇",
    "鸡"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};