var predictionMaxData = {
  "time": "2026-10-17 21:32:32",
  "issue": "2026290",
  "code": "8,9,17,15,7,2,40",
  "zodiac": "猪,狗,虎,龙,鼠,蛇,兔",
  "wave": "red,blue,green,blue,red,red,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026291",
  "ninePool": [
    "狗",
    "龙",
    "牛",
    "虎",
    "猴",
    "鸡",
    "羊",
    "鼠",
    "兔"
  ],
  "sixPool": [
    "狗",
    "龙",
    "牛",
    "虎",
    "猴",
    "鸡"
  ],
  "goldVotes": {
    "猴": 5,
    "马": 4,
    "蛇": 5,
    "龙": 3,
    "虎": 8,
    "猪": 4,
    "鼠": 4,
    "鸡": 4,
    "牛": 2,
    "羊": 3,
    "兔": 2,
    "狗": 2
  },
  "missing": {
    "马": 2,
    "羊": 4,
    "猴": 8,
    "鸡": 9,
    "狗": 16,
    "猪": 3,
    "鼠": 5,
    "牛": 7,
    "虎": 15,
    "兔": 0,
    "龙": 10,
    "蛇": 1
  },
  "fixedKillSet": [
    "兔",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "狗",
    "鸡",
    "羊",
    "虎",
    "蛇",
    "龙",
    "猪",
    "牛",
    "马"
  ],
  "oraclePool": [
    "猴",
    "兔",
    "羊",
    "虎",
    "蛇",
    "鼠",
    "龙",
    "马",
    "牛"
  ],
  "hechongPool": [
    "牛",
    "兔",
    "鸡",
    "羊",
    "蛇",
    "龙",
    "猪",
    "狗"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};