var predictionMaxData = {
  "time": "2026-07-04 21:32:32",
  "issue": "2026185",
  "code": "18,35,9,41,12,30,36",
  "zodiac": "牛,猴,狗,虎,羊,牛,羊",
  "wave": "red,red,blue,blue,red,red,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026186",
  "ninePool": [
    "猴",
    "兔",
    "鸡",
    "猪",
    "鼠",
    "虎",
    "牛",
    "狗",
    "蛇"
  ],
  "sixPool": [
    "猴",
    "兔",
    "鸡",
    "猪",
    "鼠",
    "虎"
  ],
  "goldVotes": {
    "牛": 4,
    "马": 6,
    "蛇": 5,
    "猪": 3,
    "兔": 2,
    "龙": 8,
    "狗": 4,
    "羊": 5,
    "虎": 1
  },
  "missing": {
    "马": 1,
    "羊": 0,
    "猴": 43,
    "鸡": 9,
    "狗": 5,
    "猪": 13,
    "鼠": 4,
    "牛": 7,
    "虎": 3,
    "兔": 14,
    "龙": 6,
    "蛇": 8
  },
  "fixedKillSet": [
    "蛇",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "鸡",
    "猪",
    "兔",
    "鼠",
    "猴",
    "牛",
    "马",
    "虎",
    "狗",
    "羊",
    "龙"
  ],
  "oraclePool": [
    "鸡",
    "猪",
    "兔",
    "猴",
    "鼠",
    "牛",
    "虎",
    "狗",
    "羊"
  ],
  "hechongPool": [
    "蛇",
    "鸡",
    "猪",
    "兔",
    "鼠",
    "牛",
    "马",
    "羊"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};