var predictionMaxData = {
  "time": "2026-09-17 21:32:32",
  "issue": "2026260",
  "code": "25,26,44,32,6,48,20",
  "zodiac": "马,蛇,猪,猪,牛,羊,猪",
  "wave": "blue,blue,green,green,green,blue,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026261",
  "ninePool": [
    "虎",
    "羊",
    "龙",
    "猴",
    "牛",
    "狗",
    "蛇",
    "鸡",
    "兔"
  ],
  "sixPool": [
    "虎",
    "羊",
    "龙",
    "猴",
    "牛",
    "狗"
  ],
  "goldVotes": {
    "牛": 2,
    "羊": 5,
    "马": 5,
    "龙": 9,
    "兔": 4,
    "狗": 2,
    "猪": 3,
    "猴": 1,
    "鼠": 4,
    "蛇": 2,
    "鸡": 1
  },
  "missing": {
    "马": 4,
    "羊": 23,
    "猴": 11,
    "鸡": 1,
    "狗": 17,
    "猪": 0,
    "鼠": 3,
    "牛": 9,
    "虎": 21,
    "兔": 7,
    "龙": 20,
    "蛇": 6
  },
  "fixedKillSet": [
    "虎",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "兔",
    "猴",
    "羊",
    "牛",
    "狗",
    "鸡",
    "虎",
    "马",
    "猪",
    "龙",
    "蛇",
    "鼠"
  ],
  "oraclePool": [
    "兔",
    "猴",
    "羊",
    "牛",
    "鸡",
    "虎",
    "马",
    "龙",
    "蛇"
  ],
  "hechongPool": [
    "兔",
    "猴",
    "羊",
    "牛",
    "鸡",
    "虎",
    "猪",
    "蛇"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 66.0
};