var predictionMaxData = {
  "time": "2026-08-30 21:32:32",
  "issue": "2026242",
  "code": "29,35,46,32,13,31,9",
  "zodiac": "虎,猴,鸡,猪,马,鼠,狗",
  "wave": "red,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026243",
  "ninePool": [
    "鸡",
    "鼠",
    "虎",
    "龙",
    "羊",
    "兔",
    "牛",
    "马",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "鼠",
    "虎",
    "龙",
    "羊",
    "兔"
  ],
  "goldVotes": {
    "牛": 6,
    "猪": 8,
    "狗": 2,
    "鸡": 6,
    "马": 3,
    "兔": 4,
    "猴": 4,
    "蛇": 4,
    "虎": 1,
    "羊": 2
  },
  "missing": {
    "马": 1,
    "羊": 5,
    "猴": 6,
    "鸡": 66,
    "狗": 0,
    "猪": 7,
    "鼠": 9,
    "牛": 10,
    "虎": 3,
    "兔": 12,
    "龙": 2,
    "蛇": 13
  },
  "fixedKillSet": [
    "狗",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "兔",
    "鸡",
    "狗",
    "猪",
    "蛇",
    "虎",
    "鼠",
    "猴",
    "羊",
    "马"
  ],
  "oraclePool": [
    "牛",
    "鸡",
    "狗",
    "猪",
    "鼠",
    "虎",
    "猴",
    "羊",
    "马"
  ],
  "hechongPool": [
    "兔",
    "鸡",
    "狗",
    "虎",
    "龙",
    "鼠",
    "猴",
    "马"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};