var predictionMaxData = {
  "time": "2026-10-26 21:32:32",
  "issue": "2026299",
  "code": "12,19,28,32,5,42,23",
  "zodiac": "羊,鼠,兔,猪,虎,牛,猴",
  "wave": "red,red,green,green,green,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026300",
  "ninePool": [
    "狗",
    "龙",
    "蛇",
    "牛",
    "马",
    "羊",
    "鼠",
    "鸡",
    "兔"
  ],
  "sixPool": [
    "狗",
    "龙",
    "蛇",
    "牛",
    "马",
    "羊"
  ],
  "goldVotes": {
    "鼠": 5,
    "猪": 4,
    "鸡": 5,
    "兔": 3,
    "虎": 5,
    "牛": 2,
    "龙": 2,
    "狗": 1,
    "猴": 1,
    "羊": 1,
    "马": 1
  },
  "missing": {
    "马": 2,
    "羊": 7,
    "猴": 0,
    "鸡": 18,
    "狗": 25,
    "猪": 1,
    "鼠": 14,
    "牛": 16,
    "虎": 6,
    "兔": 5,
    "龙": 19,
    "蛇": 10
  },
  "fixedKillSet": [
    "猴",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "狗",
    "蛇",
    "鸡",
    "猪",
    "鼠",
    "兔",
    "马",
    "猴",
    "龙"
  ],
  "oraclePool": [
    "羊",
    "狗",
    "蛇",
    "鸡",
    "虎",
    "兔",
    "马",
    "猴",
    "龙"
  ],
  "hechongPool": [
    "狗",
    "蛇",
    "猪",
    "虎",
    "鼠",
    "马",
    "猴",
    "龙"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};