var predictionMaxData = {
  "time": "2026-08-07 21:32:32",
  "issue": "2026219",
  "code": "31,41,7,8,29,22,43",
  "zodiac": "鼠,虎,鼠,猪,虎,鸡,鼠",
  "wave": "blue,blue,red,red,red,green,green",
  "teSx": "鼠",
  "teWei": 3,
  "nextIssue": "2026220",
  "ninePool": [
    "鸡",
    "狗",
    "羊",
    "龙",
    "马",
    "牛",
    "猴",
    "兔",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "羊",
    "龙",
    "马",
    "牛"
  ],
  "goldVotes": {
    "猴": 6,
    "蛇": 8,
    "兔": 9,
    "鸡": 3,
    "虎": 4,
    "鼠": 7,
    "猪": 6,
    "羊": 4,
    "狗": 2
  },
  "missing": {
    "马": 3,
    "羊": 20,
    "猴": 6,
    "鸡": 43,
    "狗": 26,
    "猪": 10,
    "鼠": 0,
    "牛": 7,
    "虎": 1,
    "兔": 5,
    "龙": 14,
    "蛇": 2
  },
  "fixedKillSet": [
    "猪",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "鸡",
    "虎",
    "蛇",
    "马",
    "羊",
    "牛",
    "龙",
    "狗",
    "猴"
  ],
  "oraclePool": [
    "兔",
    "马",
    "虎",
    "蛇",
    "鸡",
    "羊",
    "龙",
    "狗",
    "猴"
  ],
  "hechongPool": [
    "马",
    "虎",
    "羊",
    "牛",
    "鼠",
    "龙",
    "狗",
    "猴"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};