var predictionMaxData = {
  "time": "2026-08-12 21:32:32",
  "issue": "2026224",
  "code": "25,19,8,49,18,36,9",
  "zodiac": "马,鼠,猪,马,牛,羊,狗",
  "wave": "blue,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026225",
  "ninePool": [
    "鸡",
    "兔",
    "龙",
    "牛",
    "虎",
    "猪",
    "马",
    "羊",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "龙",
    "牛",
    "虎",
    "猪"
  ],
  "goldVotes": {
    "兔": 1,
    "牛": 3,
    "猴": 4,
    "鸡": 5,
    "龙": 4,
    "猪": 2,
    "狗": 1,
    "马": 1,
    "蛇": 4,
    "鼠": 1
  },
  "missing": {
    "马": 3,
    "羊": 4,
    "猴": 1,
    "鸡": 48,
    "狗": 0,
    "猪": 15,
    "鼠": 5,
    "牛": 12,
    "虎": 6,
    "兔": 10,
    "龙": 19,
    "蛇": 2
  },
  "fixedKillSet": [
    "狗",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "兔",
    "狗",
    "鸡",
    "马",
    "鼠",
    "猪",
    "猴",
    "羊",
    "虎",
    "龙"
  ],
  "oraclePool": [
    "蛇",
    "兔",
    "牛",
    "鸡",
    "马",
    "猴",
    "羊",
    "虎",
    "龙"
  ],
  "hechongPool": [
    "兔",
    "狗",
    "鸡",
    "马",
    "鼠",
    "猴",
    "虎",
    "龙"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};