var predictionMaxData = {
  "time": "2026-09-27 21:32:32",
  "issue": "2026270",
  "code": "39,34,20,24,17,6,19",
  "zodiac": "龙,鸡,猪,羊,虎,牛,鼠",
  "wave": "green,red,blue,red,green,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026271",
  "ninePool": [
    "龙",
    "虎",
    "猴",
    "蛇",
    "牛",
    "狗",
    "马",
    "羊",
    "兔"
  ],
  "sixPool": [
    "龙",
    "虎",
    "猴",
    "蛇",
    "牛",
    "狗"
  ],
  "goldVotes": {
    "羊": 6,
    "猴": 4,
    "鼠": 7,
    "猪": 7,
    "虎": 3,
    "鸡": 4,
    "蛇": 2,
    "兔": 2,
    "龙": 2
  },
  "missing": {
    "马": 5,
    "羊": 9,
    "猴": 21,
    "鸡": 1,
    "狗": 6,
    "猪": 4,
    "鼠": 0,
    "牛": 8,
    "虎": 31,
    "兔": 2,
    "龙": 30,
    "蛇": 16
  },
  "fixedKillSet": [
    "鼠",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "虎",
    "羊",
    "龙",
    "马",
    "狗",
    "鼠",
    "蛇",
    "鸡",
    "兔",
    "猪"
  ],
  "oraclePool": [
    "虎",
    "羊",
    "猴",
    "龙",
    "马",
    "狗",
    "鸡",
    "蛇",
    "兔"
  ],
  "hechongPool": [
    "猴",
    "虎",
    "羊",
    "龙",
    "马",
    "狗",
    "鼠",
    "牛"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0
};