var predictionMaxData = {
  "time": "2026-10-31 21:32:32",
  "issue": "2026304",
  "code": "23,24,10,43,13,36,21",
  "zodiac": "猴,羊,鸡,鼠,马,羊,狗",
  "wave": "red,red,blue,green,red,blue,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026305",
  "ninePool": [
    "鸡",
    "牛",
    "鼠",
    "龙",
    "羊",
    "马",
    "猪",
    "兔",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "鼠",
    "龙",
    "羊",
    "马"
  ],
  "goldVotes": {
    "虎": 3,
    "狗": 4,
    "猴": 7,
    "龙": 3,
    "兔": 4,
    "鼠": 1,
    "蛇": 4,
    "牛": 2,
    "猪": 2,
    "鸡": 2,
    "羊": 2,
    "马": 1
  },
  "missing": {
    "马": 7,
    "羊": 12,
    "猴": 5,
    "鸡": 23,
    "狗": 0,
    "猪": 6,
    "鼠": 19,
    "牛": 21,
    "虎": 1,
    "兔": 10,
    "龙": 24,
    "蛇": 4
  },
  "fixedKillSet": [
    "狗",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "牛",
    "蛇",
    "猪",
    "羊",
    "鸡",
    "猴",
    "龙",
    "虎",
    "马",
    "鼠"
  ],
  "oraclePool": [
    "狗",
    "牛",
    "虎",
    "猪",
    "猴",
    "羊",
    "鸡",
    "马",
    "鼠"
  ],
  "hechongPool": [
    "狗",
    "兔",
    "猴",
    "鸡",
    "龙",
    "虎",
    "马",
    "鼠"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 57.99999999999999
};