var predictionMaxData = {
  "time": "2026-05-31 21:32:32",
  "issue": "2026151",
  "code": "27,15,29,42,20,41,31",
  "zodiac": "龙,龙,虎,牛,猪,虎,鼠",
  "wave": "green,blue,red,blue,blue,blue,blue",
  "teSx": "鼠",
  "teWei": 1,
  "nextIssue": "2026152",
  "ninePool": [
    "鸡",
    "蛇",
    "兔",
    "马",
    "虎",
    "龙",
    "牛",
    "羊",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "兔",
    "马",
    "虎",
    "龙"
  ],
  "goldVotes": {
    "羊": 3,
    "猴": 5,
    "猪": 7,
    "鼠": 2,
    "鸡": 1,
    "狗": 2,
    "龙": 1
  },
  "missing": {
    "马": 4,
    "羊": 3,
    "猴": 9,
    "鸡": 28,
    "狗": 1,
    "猪": 8,
    "鼠": 0,
    "牛": 5,
    "虎": 6,
    "兔": 11,
    "龙": 2,
    "蛇": 14
  },
  "fixedKillSet": [
    "牛",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "狗",
    "虎",
    "龙",
    "鸡",
    "蛇",
    "兔",
    "羊",
    "猴",
    "牛",
    "猪"
  ],
  "oraclePool": [
    "鼠",
    "虎",
    "龙",
    "蛇",
    "兔",
    "马",
    "羊",
    "牛",
    "猪"
  ],
  "hechongPool": [
    "鼠",
    "狗",
    "虎",
    "龙",
    "马",
    "羊",
    "猴",
    "牛"
  ],
  "dynamicRate9": 94.11764705882352,
  "dynamicRate6": 76.47058823529412
};