var predictionMaxData = {
  "time": "2026-07-16 21:32:32",
  "issue": "2026197",
  "code": "40,19,30,48,44,28,8",
  "zodiac": "兔,鼠,牛,羊,猪,兔,猪",
  "wave": "red,red,red,blue,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026198",
  "ninePool": [
    "牛",
    "鸡",
    "鼠",
    "蛇",
    "羊",
    "猴",
    "兔",
    "龙",
    "马"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "鼠",
    "蛇",
    "羊",
    "猴"
  ],
  "goldVotes": {
    "虎": 6,
    "狗": 5,
    "猪": 6,
    "猴": 6,
    "羊": 5,
    "马": 3,
    "鼠": 3,
    "兔": 3,
    "牛": 1,
    "鸡": 3,
    "龙": 2
  },
  "missing": {
    "马": 2,
    "羊": 12,
    "猴": 11,
    "鸡": 21,
    "狗": 4,
    "猪": 0,
    "鼠": 16,
    "牛": 19,
    "虎": 6,
    "兔": 7,
    "龙": 1,
    "蛇": 3
  },
  "fixedKillSet": [
    "鸡",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "鸡",
    "羊",
    "猴",
    "虎",
    "狗",
    "鼠",
    "蛇",
    "猪",
    "兔"
  ],
  "oraclePool": [
    "马",
    "羊",
    "猴",
    "虎",
    "鼠",
    "蛇",
    "龙",
    "牛",
    "兔"
  ],
  "hechongPool": [
    "鸡",
    "羊",
    "猴",
    "虎",
    "蛇",
    "猪",
    "牛",
    "兔"
  ],
  "dynamicRate9": 70.0,
  "dynamicRate6": 60.0
};