var predictionMaxData = {
  "time": "2026-09-07 21:32:32",
  "issue": "2026250",
  "code": "10,6,39,47,37,17,14",
  "zodiac": "鸡,牛,龙,猴,马,虎,蛇",
  "wave": "blue,green,green,blue,blue,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026251",
  "ninePool": [
    "虎",
    "马",
    "牛",
    "羊",
    "鼠",
    "兔",
    "鸡",
    "龙",
    "猪"
  ],
  "sixPool": [
    "虎",
    "马",
    "牛",
    "羊",
    "鼠",
    "兔"
  ],
  "goldVotes": {
    "猴": 4,
    "羊": 4,
    "龙": 8,
    "鼠": 4,
    "猪": 11,
    "狗": 4,
    "鸡": 4,
    "牛": 1
  },
  "missing": {
    "马": 9,
    "羊": 13,
    "猴": 1,
    "鸡": 6,
    "狗": 7,
    "猪": 2,
    "鼠": 17,
    "牛": 4,
    "虎": 11,
    "兔": 3,
    "龙": 10,
    "蛇": 0
  },
  "fixedKillSet": [
    "蛇",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "鼠",
    "兔",
    "龙",
    "蛇",
    "猪",
    "鸡",
    "猴",
    "牛"
  ],
  "oraclePool": [
    "虎",
    "羊",
    "鼠",
    "马",
    "猪",
    "鸡",
    "猴",
    "狗",
    "牛"
  ],
  "hechongPool": [
    "虎",
    "羊",
    "兔",
    "蛇",
    "猪",
    "鸡",
    "猴",
    "牛"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};