var predictionMaxData = {
  "time": "2026-10-29 21:32:32",
  "issue": "2026302",
  "code": "10,2,14,13,11,12,45",
  "zodiac": "鸡,蛇,蛇,马,猴,羊,狗",
  "wave": "blue,red,blue,red,green,red,red",
  "teSx": "狗",
  "teWei": 5,
  "nextIssue": "2026303",
  "ninePool": [
    "龙",
    "鸡",
    "鼠",
    "牛",
    "羊",
    "马",
    "兔",
    "猴",
    "虎"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "鼠",
    "牛",
    "羊",
    "马"
  ],
  "goldVotes": {
    "猴": 3,
    "兔": 4,
    "牛": 4,
    "鸡": 5,
    "蛇": 5,
    "马": 1,
    "狗": 1,
    "羊": 1,
    "猪": 4,
    "鼠": 3,
    "龙": 1
  },
  "missing": {
    "马": 5,
    "羊": 10,
    "猴": 3,
    "鸡": 21,
    "狗": 0,
    "猪": 4,
    "鼠": 17,
    "牛": 19,
    "虎": 1,
    "兔": 8,
    "龙": 22,
    "蛇": 2
  },
  "fixedKillSet": [
    "虎",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "猴",
    "虎",
    "鸡",
    "鼠",
    "蛇",
    "马",
    "狗",
    "龙",
    "羊",
    "牛"
  ],
  "oraclePool": [
    "猪",
    "兔",
    "猴",
    "虎",
    "鸡",
    "鼠",
    "狗",
    "龙",
    "牛"
  ],
  "hechongPool": [
    "兔",
    "猴",
    "虎",
    "鸡",
    "鼠",
    "马",
    "狗",
    "龙"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};