var predictionMaxData = {
  "time": "2026-07-23 21:32:32",
  "issue": "2026204",
  "code": "11,12,17,26,10,7,5",
  "zodiac": "猴,羊,虎,蛇,鸡,鼠,虎",
  "wave": "green,red,green,blue,blue,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026205",
  "ninePool": [
    "鸡",
    "牛",
    "狗",
    "蛇",
    "猴",
    "鼠",
    "兔",
    "龙",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "狗",
    "蛇",
    "猴",
    "鼠"
  ],
  "goldVotes": {
    "马": 4,
    "兔": 2,
    "猪": 4,
    "鸡": 4,
    "猴": 5,
    "牛": 7,
    "鼠": 3,
    "羊": 3,
    "虎": 1,
    "蛇": 2
  },
  "missing": {
    "马": 1,
    "羊": 5,
    "猴": 18,
    "鸡": 28,
    "狗": 11,
    "猪": 3,
    "鼠": 6,
    "牛": 26,
    "虎": 0,
    "兔": 2,
    "龙": 4,
    "蛇": 10
  },
  "fixedKillSet": [
    "虎",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "鸡",
    "蛇",
    "鼠",
    "猪",
    "羊",
    "狗",
    "牛",
    "马",
    "龙",
    "猴"
  ],
  "oraclePool": [
    "虎",
    "鸡",
    "蛇",
    "鼠",
    "猪",
    "狗",
    "牛",
    "兔",
    "龙"
  ],
  "hechongPool": [
    "虎",
    "蛇",
    "鼠",
    "猪",
    "狗",
    "马",
    "龙",
    "猴"
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 57.99999999999999
};