var predictionMaxData = {
  "time": "2026-06-06 21:32:32",
  "issue": "2026157",
  "code": "43,25,11,31,17,10,40",
  "zodiac": "鼠,马,猴,鼠,虎,鸡,兔",
  "wave": "green,blue,green,blue,green,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026158",
  "ninePool": [
    "鸡",
    "蛇",
    "猴",
    "猪",
    "羊",
    "龙",
    "鼠",
    "牛",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "猴",
    "猪",
    "羊",
    "龙"
  ],
  "goldVotes": {
    "羊": 4,
    "虎": 7,
    "蛇": 2,
    "龙": 4,
    "兔": 4,
    "马": 5,
    "牛": 5,
    "鸡": 2,
    "猴": 3,
    "狗": 4,
    "猪": 3,
    "鼠": 1
  },
  "missing": {
    "马": 1,
    "羊": 9,
    "猴": 15,
    "鸡": 34,
    "狗": 5,
    "猪": 14,
    "鼠": 2,
    "牛": 11,
    "虎": 3,
    "兔": 0,
    "龙": 8,
    "蛇": 20
  },
  "fixedKillSet": [
    "兔"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "鸡",
    "马",
    "蛇",
    "牛",
    "兔",
    "猪",
    "虎",
    "龙"
  ],
  "oraclePool": [
    "猴",
    "鸡",
    "羊",
    "马",
    "蛇",
    "狗",
    "兔",
    "虎",
    "龙"
  ],
  "hechongPool": [
    "鸡",
    "羊",
    "蛇",
    "狗",
    "牛",
    "兔",
    "猪",
    "龙"
  ],
  "dynamicRate9": 78.26086956521739,
  "dynamicRate6": 65.21739130434783
};