var predictionMaxData = {
  "time": "2026-08-08 21:32:32",
  "issue": "2026220",
  "code": "27,39,4,12,38,25,48",
  "zodiac": "龙,龙,兔,羊,蛇,马,羊",
  "wave": "green,green,blue,red,green,blue,blue",
  "teSx": "羊",
  "teWei": 8,
  "nextIssue": "2026221",
  "ninePool": [
    "鸡",
    "狗",
    "鼠",
    "猪",
    "兔",
    "牛",
    "龙",
    "马",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "鼠",
    "猪",
    "兔",
    "牛"
  ],
  "goldVotes": {
    "虎": 6,
    "猪": 6,
    "狗": 3,
    "鸡": 2,
    "马": 6,
    "龙": 4,
    "猴": 6,
    "羊": 3,
    "蛇": 4,
    "牛": 2
  },
  "missing": {
    "马": 4,
    "羊": 0,
    "猴": 7,
    "鸡": 44,
    "狗": 27,
    "猪": 11,
    "鼠": 1,
    "牛": 8,
    "虎": 2,
    "兔": 6,
    "龙": 15,
    "蛇": 3
  },
  "fixedKillSet": [
    "牛",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "虎",
    "猴",
    "龙",
    "狗",
    "蛇",
    "兔",
    "鸡",
    "牛",
    "羊"
  ],
  "oraclePool": [
    "马",
    "猴",
    "鼠",
    "狗",
    "蛇",
    "鸡",
    "牛",
    "羊",
    "猪"
  ],
  "hechongPool": [
    "马",
    "鼠",
    "蛇",
    "兔",
    "牛",
    "鸡",
    "羊",
    "猪"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 64.0
};