var predictionMaxData = {
  "time": "2026-08-01 21:32:32",
  "issue": "2026213",
  "code": "9,5,12,22,1,15,35",
  "zodiac": "狗,虎,羊,鸡,马,龙,猴",
  "wave": "blue,green,red,green,red,blue,red",
  "teSx": "猴",
  "teWei": 5,
  "nextIssue": "2026214",
  "ninePool": [
    "鸡",
    "狗",
    "蛇",
    "虎",
    "羊",
    "兔",
    "鼠",
    "牛",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "蛇",
    "虎",
    "羊",
    "兔"
  ],
  "goldVotes": {
    "狗": 5,
    "羊": 3,
    "鸡": 3,
    "猪": 3,
    "蛇": 1,
    "马": 4,
    "虎": 2,
    "龙": 4,
    "牛": 1,
    "鼠": 2
  },
  "missing": {
    "马": 2,
    "羊": 14,
    "猴": 0,
    "鸡": 37,
    "狗": 20,
    "猪": 4,
    "鼠": 5,
    "牛": 1,
    "虎": 9,
    "兔": 11,
    "龙": 8,
    "蛇": 19
  },
  "fixedKillSet": [
    "猪",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "蛇",
    "狗",
    "鼠",
    "兔",
    "羊",
    "龙",
    "猴",
    "鸡",
    "虎",
    "猪"
  ],
  "oraclePool": [
    "马",
    "狗",
    "鼠",
    "羊",
    "牛",
    "猴",
    "鸡",
    "虎",
    "猪"
  ],
  "hechongPool": [
    "马",
    "蛇",
    "狗",
    "鼠",
    "龙",
    "猴",
    "虎",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};