var predictionMaxData = {
  "time": "2026-09-13 21:32:32",
  "issue": "2026256",
  "code": "40,15,9,37,7,3,1",
  "zodiac": "兔,龙,狗,马,鼠,龙,马",
  "wave": "red,blue,blue,blue,red,blue,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026257",
  "ninePool": [
    "鼠",
    "龙",
    "羊",
    "虎",
    "兔",
    "蛇",
    "牛",
    "狗",
    "猴"
  ],
  "sixPool": [
    "鼠",
    "龙",
    "羊",
    "虎",
    "兔",
    "蛇"
  ],
  "goldVotes": {
    "鼠": 6,
    "狗": 4,
    "鸡": 7,
    "羊": 6,
    "兔": 1,
    "虎": 6,
    "猴": 6,
    "猪": 2,
    "马": 3,
    "蛇": 1,
    "龙": 1,
    "牛": 2
  },
  "missing": {
    "马": 0,
    "羊": 19,
    "猴": 7,
    "鸡": 4,
    "狗": 13,
    "猪": 1,
    "鼠": 23,
    "牛": 5,
    "虎": 17,
    "兔": 3,
    "龙": 16,
    "蛇": 2
  },
  "fixedKillSet": [
    "牛",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "猴",
    "鼠",
    "蛇",
    "龙",
    "狗",
    "羊",
    "虎",
    "猪"
  ],
  "oraclePool": [
    "牛",
    "猴",
    "鼠",
    "蛇",
    "龙",
    "兔",
    "羊",
    "虎",
    "马"
  ],
  "hechongPool": [
    "牛",
    "猴",
    "鼠",
    "龙",
    "狗",
    "羊",
    "虎",
    "马"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 66.0
};