var predictionMaxData = {
  "time": "2026-05-25 21:32:32",
  "issue": "2026145",
  "code": "36,43,25,32,37,18,5",
  "zodiac": "羊,鼠,马,猪,马,牛,虎",
  "wave": "blue,green,blue,green,blue,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026146",
  "ninePool": [
    "狗",
    "虎",
    "龙",
    "兔",
    "鸡",
    "猴",
    "蛇",
    "牛",
    "马"
  ],
  "sixPool": [
    "龙",
    "兔",
    "狗",
    "虎",
    "鸡",
    "蛇"
  ],
  "fixedKillSet": [
    "鸡",
    "虎"
  ],
  "dynamicRate9": 91.66666666666666,
  "dynamicRate6": 66.66666666666666,
  "pools": {
    "3": [
      "龙",
      "兔",
      "狗"
    ],
    "4": [
      "龙",
      "兔",
      "狗",
      "虎"
    ],
    "5": [
      "龙",
      "兔",
      "狗",
      "虎",
      "鸡"
    ],
    "6": [
      "龙",
      "兔",
      "狗",
      "虎",
      "鸡",
      "蛇"
    ],
    "7": [
      "龙",
      "兔",
      "狗",
      "虎",
      "鸡",
      "蛇",
      "猴"
    ],
    "8": [
      "龙",
      "兔",
      "狗",
      "虎",
      "鸡",
      "蛇",
      "猴",
      "牛"
    ]
  }
};