var predictionMaxData = {
  "time": "2026-06-04 21:32:32",
  "issue": "2026155",
  "code": "21,37,46,13,40,47,7",
  "zodiac": "狗,马,鸡,马,兔,猴,鼠",
  "wave": "green,blue,red,red,red,blue,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026156",
  "ninePool": [
    "鸡",
    "蛇",
    "牛",
    "羊",
    "兔",
    "马",
    "猴",
    "狗",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "牛",
    "羊",
    "兔",
    "马"
  ],
  "goldVotes": {
    "鸡": 1,
    "猴": 5,
    "马": 3,
    "鼠": 6,
    "猪": 11,
    "狗": 3,
    "龙": 3,
    "兔": 1,
    "虎": 4,
    "蛇": 2,
    "牛": 1,
    "羊": 1
  },
  "missing": {
    "马": 8,
    "羊": 7,
    "猴": 13,
    "鸡": 32,
    "狗": 3,
    "猪": 12,
    "鼠": 0,
    "牛": 9,
    "虎": 1,
    "兔": 15,
    "龙": 6,
    "蛇": 18
  },
  "fixedKillSet": [
    "兔",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "兔",
    "鸡",
    "龙",
    "羊",
    "虎",
    "猪",
    "蛇"
  ],
  "oraclePool": [
    "马",
    "兔",
    "鸡",
    "龙",
    "羊",
    "狗",
    "猪",
    "蛇",
    "猴"
  ],
  "hechongPool": [
    "牛",
    "马",
    "龙",
    "羊",
    "虎",
    "鼠",
    "狗",
    "猴"
  ],
  "dynamicRate9": 80.95238095238095,
  "dynamicRate6": 66.66666666666666
};