var predictionMaxData = {
  "time": "2026-07-31 21:32:32",
  "issue": "2026212",
  "code": "43,32,16,39,19,27,6",
  "zodiac": "鼠,猪,兔,龙,鼠,龙,牛",
  "wave": "green,green,green,green,red,green,green",
  "teSx": "牛",
  "teWei": 6,
  "nextIssue": "2026213",
  "ninePool": [
    "鸡",
    "兔",
    "鼠",
    "蛇",
    "虎",
    "龙",
    "羊",
    "狗",
    "马"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "鼠",
    "蛇",
    "虎",
    "龙"
  ],
  "goldVotes": {
    "猪": 6,
    "马": 2,
    "牛": 10,
    "狗": 4,
    "鸡": 3,
    "羊": 6,
    "蛇": 8,
    "虎": 2,
    "兔": 2
  },
  "missing": {
    "马": 1,
    "羊": 13,
    "猴": 6,
    "鸡": 36,
    "狗": 19,
    "猪": 3,
    "鼠": 4,
    "牛": 0,
    "虎": 8,
    "兔": 10,
    "龙": 7,
    "蛇": 18
  },
  "fixedKillSet": [
    "猴",
    "牛"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "狗",
    "猴",
    "猪",
    "马",
    "牛",
    "龙",
    "鸡",
    "虎",
    "羊"
  ],
  "oraclePool": [
    "蛇",
    "猴",
    "鼠",
    "马",
    "牛",
    "龙",
    "虎",
    "兔",
    "羊"
  ],
  "hechongPool": [
    "蛇",
    "猪",
    "鼠",
    "马",
    "牛",
    "鸡",
    "兔",
    "羊"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};