var predictionMaxData = {
  "time": "2026-07-25 21:32:32",
  "issue": "2026206",
  "code": "9,49,37,3,40,35,47",
  "zodiac": "狗,马,马,龙,兔,猴,猴",
  "wave": "blue,green,blue,blue,red,red,blue",
  "teSx": "猴",
  "teWei": 7,
  "nextIssue": "2026207",
  "ninePool": [
    "鸡",
    "牛",
    "鼠",
    "猪",
    "狗",
    "马",
    "蛇",
    "兔",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "鼠",
    "猪",
    "狗",
    "马"
  ],
  "goldVotes": {
    "狗": 4,
    "羊": 6,
    "鸡": 3,
    "蛇": 4,
    "猴": 2,
    "兔": 2,
    "猪": 1,
    "虎": 3,
    "鼠": 2,
    "马": 2
  },
  "missing": {
    "马": 3,
    "羊": 7,
    "猴": 0,
    "鸡": 30,
    "狗": 13,
    "猪": 5,
    "鼠": 8,
    "牛": 28,
    "虎": 2,
    "兔": 4,
    "龙": 1,
    "蛇": 12
  },
  "fixedKillSet": [
    "龙",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "蛇",
    "龙",
    "虎",
    "鸡",
    "猪",
    "马",
    "兔",
    "牛"
  ],
  "oraclePool": [
    "羊",
    "蛇",
    "猴",
    "龙",
    "鸡",
    "猪",
    "马",
    "兔",
    "狗"
  ],
  "hechongPool": [
    "猴",
    "蛇",
    "龙",
    "鼠",
    "虎",
    "猪",
    "马",
    "狗"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};