var predictionMaxData = {
  "time": "2026-10-15 21:32:32",
  "issue": "2026288",
  "code": "14,48,5,17,46,21,25",
  "zodiac": "蛇,羊,虎,虎,鸡,狗,马",
  "wave": "blue,blue,green,green,red,green,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026289",
  "ninePool": [
    "狗",
    "兔",
    "虎",
    "龙",
    "牛",
    "鼠",
    "羊",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "狗",
    "兔",
    "虎",
    "龙",
    "牛",
    "鼠"
  ],
  "goldVotes": {
    "龙": 2,
    "兔": 5,
    "猴": 4,
    "蛇": 4,
    "马": 5,
    "虎": 2,
    "狗": 1,
    "鸡": 3,
    "羊": 2,
    "猪": 3,
    "鼠": 3
  },
  "missing": {
    "马": 0,
    "羊": 2,
    "猴": 6,
    "鸡": 7,
    "狗": 14,
    "猪": 1,
    "鼠": 3,
    "牛": 5,
    "虎": 13,
    "兔": 20,
    "龙": 8,
    "蛇": 10
  },
  "fixedKillSet": [
    "马",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "鸡",
    "牛",
    "猪",
    "兔",
    "猴",
    "狗",
    "蛇",
    "虎",
    "马"
  ],
  "oraclePool": [
    "龙",
    "鼠",
    "牛",
    "猪",
    "兔",
    "狗",
    "蛇",
    "虎",
    "马"
  ],
  "hechongPool": [
    "龙",
    "鼠",
    "牛",
    "猴",
    "狗",
    "羊",
    "虎",
    "马"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0
};