var predictionMaxData = {
  "time": "2026-08-13 21:32:32",
  "issue": "2026225",
  "code": "7,34,27,10,19,38,1",
  "zodiac": "鼠,鸡,龙,鸡,鼠,蛇,马",
  "wave": "red,red,green,blue,red,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026226",
  "ninePool": [
    "鸡",
    "龙",
    "牛",
    "鼠",
    "虎",
    "羊",
    "猪",
    "兔",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "牛",
    "鼠",
    "虎",
    "羊"
  ],
  "goldVotes": {
    "猪": 7,
    "狗": 1,
    "猴": 5,
    "鼠": 1,
    "兔": 4,
    "鸡": 2,
    "马": 2,
    "蛇": 3,
    "龙": 3,
    "牛": 1
  },
  "missing": {
    "马": 0,
    "羊": 5,
    "猴": 2,
    "鸡": 49,
    "狗": 1,
    "猪": 16,
    "鼠": 6,
    "牛": 13,
    "虎": 7,
    "兔": 11,
    "龙": 20,
    "蛇": 3
  },
  "fixedKillSet": [
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "羊",
    "鸡",
    "狗",
    "虎",
    "兔",
    "牛",
    "猪",
    "龙",
    "马",
    "猴"
  ],
  "oraclePool": [
    "蛇",
    "兔",
    "羊",
    "虎",
    "牛",
    "龙",
    "马",
    "鼠",
    "猴"
  ],
  "hechongPool": [
    "羊",
    "狗",
    "虎",
    "牛",
    "龙",
    "马",
    "鼠",
    "猴"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};