var predictionMaxData = {
  "time": "2026-06-13 21:32:32",
  "issue": "2026164",
  "code": "46,4,38,12,3,2,21",
  "zodiac": "鸡,兔,蛇,羊,龙,蛇,狗",
  "wave": "red,blue,green,red,blue,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026165",
  "ninePool": [
    "鸡",
    "猴",
    "羊",
    "牛",
    "鼠",
    "虎",
    "蛇",
    "兔",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "羊",
    "牛",
    "鼠",
    "虎"
  ],
  "goldVotes": {
    "猴": 6,
    "马": 7,
    "龙": 5,
    "虎": 3,
    "兔": 3,
    "狗": 3,
    "羊": 1,
    "蛇": 2,
    "鸡": 4,
    "牛": 2,
    "猪": 2
  },
  "missing": {
    "马": 1,
    "羊": 16,
    "猴": 22,
    "鸡": 41,
    "狗": 0,
    "猪": 2,
    "鼠": 9,
    "牛": 18,
    "虎": 10,
    "兔": 6,
    "龙": 5,
    "蛇": 4
  },
  "fixedKillSet": [
    "狗",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "牛",
    "鸡",
    "猴",
    "鼠",
    "猪",
    "马",
    "狗",
    "虎",
    "蛇"
  ],
  "oraclePool": [
    "羊",
    "鸡",
    "猴",
    "鼠",
    "猪",
    "马",
    "狗",
    "蛇",
    "龙"
  ],
  "hechongPool": [
    "鸡",
    "猴",
    "鼠",
    "马",
    "狗",
    "兔",
    "虎",
    "龙"
  ],
  "dynamicRate9": 73.33333333333333,
  "dynamicRate6": 56.666666666666664
};