var predictionMaxData = {
  "time": "2026-06-27 21:32:32",
  "issue": "2026178",
  "code": "26,46,22,44,31,17,18",
  "zodiac": "蛇,鸡,鸡,猪,鼠,虎,牛",
  "wave": "blue,red,green,green,blue,green,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026179",
  "ninePool": [
    "猴",
    "鼠",
    "狗",
    "兔",
    "马",
    "羊",
    "猪",
    "虎",
    "鸡"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "狗",
    "兔",
    "马",
    "羊"
  ],
  "goldVotes": {
    "鼠": 3,
    "狗": 2,
    "羊": 10,
    "虎": 2,
    "猪": 2,
    "马": 11,
    "龙": 6,
    "兔": 3,
    "蛇": 5,
    "牛": 5,
    "鸡": 2,
    "猴": 1
  },
  "missing": {
    "马": 15,
    "羊": 9,
    "猴": 36,
    "鸡": 2,
    "狗": 14,
    "猪": 6,
    "鼠": 11,
    "牛": 0,
    "虎": 4,
    "兔": 7,
    "龙": 8,
    "蛇": 1
  },
  "fixedKillSet": [
    "牛",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "兔",
    "猪",
    "猴",
    "羊",
    "龙",
    "狗",
    "蛇",
    "虎",
    "鸡"
  ],
  "oraclePool": [
    "兔",
    "马",
    "牛",
    "猴",
    "羊",
    "鼠",
    "龙",
    "蛇",
    "虎"
  ],
  "hechongPool": [
    "兔",
    "猪",
    "马",
    "牛",
    "羊",
    "鼠",
    "蛇",
    "鸡"
  ],
  "dynamicRate9": 75.0,
  "dynamicRate6": 59.09090909090909
};