var predictionMaxData = {
  "time": "2026-07-09 21:32:32",
  "issue": "2026190",
  "code": "46,14,19,37,48,29,16",
  "zodiac": "鸡,蛇,鼠,马,羊,虎,兔",
  "wave": "red,blue,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026191",
  "ninePool": [
    "猪",
    "狗",
    "牛",
    "鸡",
    "鼠",
    "龙",
    "蛇",
    "马",
    "兔"
  ],
  "sixPool": [
    "猪",
    "狗",
    "牛",
    "鸡",
    "鼠",
    "龙"
  ],
  "goldVotes": {
    "猴": 10,
    "蛇": 5,
    "虎": 8,
    "鸡": 3,
    "羊": 6,
    "兔": 1,
    "牛": 1,
    "鼠": 1
  },
  "missing": {
    "马": 3,
    "羊": 5,
    "猴": 4,
    "鸡": 14,
    "狗": 10,
    "猪": 18,
    "鼠": 9,
    "牛": 12,
    "虎": 8,
    "兔": 0,
    "龙": 1,
    "蛇": 13
  },
  "fixedKillSet": [
    "兔",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "牛",
    "鸡",
    "虎",
    "马",
    "鼠",
    "猪",
    "蛇",
    "羊",
    "猴"
  ],
  "oraclePool": [
    "兔",
    "龙",
    "牛",
    "鸡",
    "虎",
    "鼠",
    "猪",
    "狗",
    "猴"
  ],
  "hechongPool": [
    "兔",
    "龙",
    "牛",
    "鸡",
    "猪",
    "蛇",
    "羊",
    "狗"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};