var predictionMaxData = {
  "time": "2026-10-24 21:32:32",
  "issue": "2026297",
  "code": "27,40,25,26,33,9,13",
  "zodiac": "龙,兔,马,蛇,狗,狗,马",
  "wave": "green,red,blue,blue,green,blue,red",
  "teSx": "马",
  "teWei": 3,
  "nextIssue": "2026298",
  "ninePool": [
    "狗",
    "龙",
    "牛",
    "鸡",
    "猪",
    "虎",
    "鼠",
    "蛇",
    "兔"
  ],
  "sixPool": [
    "狗",
    "龙",
    "牛",
    "鸡",
    "猪",
    "虎"
  ],
  "goldVotes": {
    "兔": 4,
    "牛": 2,
    "龙": 1,
    "猪": 3,
    "猴": 5,
    "羊": 5,
    "鸡": 3,
    "蛇": 9,
    "马": 5,
    "鼠": 6,
    "虎": 2,
    "狗": 1
  },
  "missing": {
    "马": 0,
    "羊": 5,
    "猴": 1,
    "鸡": 16,
    "狗": 23,
    "猪": 10,
    "鼠": 12,
    "牛": 14,
    "虎": 4,
    "兔": 3,
    "龙": 17,
    "蛇": 8
  },
  "fixedKillSet": [
    "马",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "马",
    "狗",
    "羊",
    "虎",
    "鼠",
    "龙",
    "牛",
    "鸡",
    "猴",
    "猪"
  ],
  "oraclePool": [
    "蛇",
    "马",
    "狗",
    "虎",
    "鼠",
    "龙",
    "牛",
    "猪",
    "兔"
  ],
  "hechongPool": [
    "马",
    "狗",
    "羊",
    "虎",
    "鼠",
    "龙",
    "牛",
    "猴"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};