var predictionMaxData = {
  "time": "2026-09-19 21:32:32",
  "issue": "2026262",
  "code": "38,22,33,47,36,7,30",
  "zodiac": "蛇,鸡,狗,猴,羊,鼠,牛",
  "wave": "green,green,green,blue,blue,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026263",
  "ninePool": [
    "虎",
    "龙",
    "狗",
    "猴",
    "兔",
    "猪",
    "鼠",
    "鸡",
    "牛"
  ],
  "sixPool": [
    "虎",
    "龙",
    "狗",
    "猴",
    "兔",
    "猪"
  ],
  "goldVotes": {
    "鼠": 3,
    "狗": 3,
    "羊": 6,
    "虎": 2,
    "猪": 1,
    "马": 5,
    "兔": 3,
    "鸡": 4,
    "蛇": 5,
    "猴": 2,
    "牛": 1
  },
  "missing": {
    "马": 6,
    "羊": 1,
    "猴": 13,
    "鸡": 3,
    "狗": 19,
    "猪": 2,
    "鼠": 5,
    "牛": 0,
    "虎": 23,
    "兔": 9,
    "龙": 22,
    "蛇": 8
  },
  "fixedKillSet": [
    "牛",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "狗",
    "兔",
    "蛇",
    "虎",
    "羊",
    "猪"
  ],
  "oraclePool": [
    "猴",
    "狗",
    "兔",
    "鼠",
    "虎",
    "牛",
    "羊",
    "鸡",
    "猪"
  ],
  "hechongPool": [
    "兔",
    "蛇",
    "鼠",
    "马",
    "牛",
    "鸡",
    "羊",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};