var predictionMaxData = {
  "time": "2026-08-31 21:32:32",
  "issue": "2026243",
  "code": "42,17,12,46,9,24,21",
  "zodiac": "牛,虎,羊,鸡,狗,羊,狗",
  "wave": "blue,green,red,red,blue,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026244",
  "ninePool": [
    "鸡",
    "兔",
    "鼠",
    "虎",
    "马",
    "龙",
    "蛇",
    "牛",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "鼠",
    "虎",
    "马",
    "龙"
  ],
  "goldVotes": {
    "猪": 5,
    "蛇": 6,
    "牛": 4,
    "猴": 4,
    "虎": 1,
    "狗": 3,
    "鸡": 3,
    "鼠": 1,
    "羊": 2,
    "龙": 2,
    "兔": 2
  },
  "missing": {
    "马": 2,
    "羊": 6,
    "猴": 7,
    "鸡": 67,
    "狗": 0,
    "猪": 8,
    "鼠": 10,
    "牛": 11,
    "虎": 4,
    "兔": 13,
    "龙": 3,
    "蛇": 14
  },
  "fixedKillSet": [
    "猪",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "狗",
    "鼠",
    "猴",
    "猪",
    "兔",
    "蛇",
    "羊",
    "马",
    "鸡",
    "龙"
  ],
  "oraclePool": [
    "虎",
    "狗",
    "鼠",
    "牛",
    "猪",
    "兔",
    "蛇",
    "马",
    "龙"
  ],
  "hechongPool": [
    "虎",
    "狗",
    "鼠",
    "猴",
    "兔",
    "马",
    "鸡",
    "龙"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0
};