var predictionMaxData = {
  "time": "2026-06-29 21:32:32",
  "issue": "2026180",
  "code": "14,10,37,30,49,19,21",
  "zodiac": "蛇,鸡,马,牛,马,鼠,狗",
  "wave": "blue,blue,blue,red,green,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026181",
  "ninePool": [
    "猴",
    "鼠",
    "马",
    "羊",
    "牛",
    "兔",
    "龙",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "马",
    "羊",
    "牛",
    "兔"
  ],
  "goldVotes": {
    "兔": 6,
    "猪": 8,
    "狗": 3,
    "羊": 3,
    "牛": 2,
    "猴": 1,
    "鸡": 4,
    "虎": 4,
    "鼠": 2,
    "马": 2,
    "龙": 1,
    "蛇": 2
  },
  "missing": {
    "马": 17,
    "羊": 11,
    "猴": 38,
    "鸡": 4,
    "狗": 0,
    "猪": 8,
    "鼠": 13,
    "牛": 2,
    "虎": 6,
    "兔": 9,
    "龙": 1,
    "蛇": 3
  },
  "fixedKillSet": [
    "马",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "兔",
    "猴",
    "蛇",
    "羊",
    "狗",
    "猪",
    "鼠",
    "龙"
  ],
  "oraclePool": [
    "鸡",
    "牛",
    "虎",
    "兔",
    "猴",
    "羊",
    "猪",
    "狗",
    "鼠"
  ],
  "hechongPool": [
    "鸡",
    "马",
    "虎",
    "兔",
    "猴",
    "狗",
    "鼠",
    "龙"
  ],
  "dynamicRate9": 73.91304347826086,
  "dynamicRate6": 58.69565217391305
};