var predictionMaxData = {
  "time": "2026-09-03 21:32:32",
  "issue": "2026246",
  "code": "22,24,19,10,20,1,30",
  "zodiac": "鸡,羊,鼠,鸡,猪,马,牛",
  "wave": "green,red,red,blue,blue,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026247",
  "ninePool": [
    "兔",
    "猪",
    "鼠",
    "蛇",
    "猴",
    "羊",
    "鸡",
    "狗",
    "马"
  ],
  "sixPool": [
    "兔",
    "猪",
    "鼠",
    "蛇",
    "猴",
    "羊"
  ],
  "goldVotes": {
    "羊": 6,
    "龙": 8,
    "鼠": 3,
    "鸡": 3,
    "马": 4,
    "虎": 4,
    "猴": 2,
    "狗": 2,
    "蛇": 5,
    "牛": 5,
    "兔": 2,
    "猪": 1
  },
  "missing": {
    "马": 5,
    "羊": 9,
    "猴": 10,
    "鸡": 2,
    "狗": 3,
    "猪": 11,
    "鼠": 13,
    "牛": 0,
    "虎": 7,
    "兔": 16,
    "龙": 6,
    "蛇": 17
  },
  "fixedKillSet": [
    "牛",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "兔",
    "虎",
    "猪",
    "狗",
    "蛇",
    "龙",
    "鼠",
    "马",
    "猴"
  ],
  "oraclePool": [
    "羊",
    "兔",
    "虎",
    "猪",
    "牛",
    "蛇",
    "龙",
    "鼠",
    "马"
  ],
  "hechongPool": [
    "羊",
    "兔",
    "猪",
    "鸡",
    "牛",
    "蛇",
    "鼠",
    "马"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};