var predictionMaxData = {
  "time": "2026-08-10 21:32:32",
  "issue": "2026222",
  "code": "49,14,47,27,18,38,26",
  "zodiac": "马,蛇,猴,龙,牛,蛇,蛇",
  "wave": "green,blue,blue,green,red,green,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026223",
  "ninePool": [
    "鸡",
    "狗",
    "龙",
    "牛",
    "虎",
    "猴",
    "猪",
    "兔",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "龙",
    "牛",
    "虎",
    "猴"
  ],
  "goldVotes": {
    "兔": 6,
    "狗": 4,
    "鸡": 6,
    "猴": 4,
    "马": 5,
    "牛": 6,
    "鼠": 2,
    "猪": 4,
    "羊": 5,
    "蛇": 4,
    "龙": 5
  },
  "missing": {
    "马": 1,
    "羊": 2,
    "猴": 9,
    "鸡": 46,
    "狗": 29,
    "猪": 13,
    "鼠": 3,
    "牛": 10,
    "虎": 4,
    "兔": 8,
    "龙": 17,
    "蛇": 0
  },
  "fixedKillSet": [
    "虎",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "龙",
    "牛",
    "猴",
    "羊",
    "鸡",
    "兔",
    "蛇",
    "狗",
    "猪",
    "马"
  ],
  "oraclePool": [
    "虎",
    "龙",
    "牛",
    "猴",
    "羊",
    "鸡",
    "兔",
    "蛇",
    "马"
  ],
  "hechongPool": [
    "虎",
    "猴",
    "牛",
    "羊",
    "鸡",
    "蛇",
    "兔",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};