var predictionMaxData = {
  "time": "2026-06-12 21:32:32",
  "issue": "2026163",
  "code": "39,8,10,33,7,41,37",
  "zodiac": "龙,猪,鸡,狗,鼠,虎,马",
  "wave": "green,red,blue,green,red,blue,blue",
  "teSx": "马",
  "teWei": 7,
  "nextIssue": "2026164",
  "ninePool": [
    "鸡",
    "羊",
    "猴",
    "虎",
    "牛",
    "狗",
    "鼠",
    "龙",
    "马"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "猴",
    "虎",
    "牛",
    "狗"
  ],
  "goldVotes": {
    "兔": 5,
    "牛": 6,
    "龙": 3,
    "猪": 3,
    "猴": 4,
    "羊": 1,
    "鸡": 7,
    "蛇": 8,
    "鼠": 4,
    "马": 2,
    "狗": 3,
    "虎": 1
  },
  "missing": {
    "马": 0,
    "羊": 15,
    "猴": 21,
    "鸡": 40,
    "狗": 11,
    "猪": 1,
    "鼠": 8,
    "牛": 17,
    "虎": 9,
    "兔": 5,
    "龙": 4,
    "蛇": 3
  },
  "fixedKillSet": [
    "马",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "猴",
    "蛇",
    "羊",
    "龙",
    "狗",
    "猪",
    "虎",
    "牛",
    "兔"
  ],
  "oraclePool": [
    "猴",
    "蛇",
    "羊",
    "龙",
    "鼠",
    "马",
    "虎",
    "牛",
    "兔"
  ],
  "hechongPool": [
    "猴",
    "羊",
    "龙",
    "鼠",
    "狗",
    "马",
    "虎",
    "牛"
  ],
  "dynamicRate9": 75.86206896551724,
  "dynamicRate6": 58.620689655172406
};