var predictionMaxData = {
  "time": "2026-06-11 21:32:32",
  "issue": "2026162",
  "code": "23,41,24,26,33,7,32",
  "zodiac": "猴,虎,羊,蛇,狗,鼠,猪",
  "wave": "red,blue,red,blue,green,red,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026163",
  "ninePool": [
    "鸡",
    "猴",
    "牛",
    "羊",
    "虎",
    "蛇",
    "鼠",
    "兔",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "牛",
    "羊",
    "虎",
    "蛇"
  ],
  "goldVotes": {
    "猪": 9,
    "狗": 7,
    "鸡": 5,
    "龙": 4,
    "虎": 3,
    "马": 4,
    "羊": 3,
    "鼠": 1,
    "猴": 2,
    "蛇": 1,
    "兔": 2
  },
  "missing": {
    "马": 6,
    "羊": 14,
    "猴": 20,
    "鸡": 39,
    "狗": 10,
    "猪": 0,
    "鼠": 7,
    "牛": 16,
    "虎": 8,
    "兔": 4,
    "龙": 3,
    "蛇": 2
  },
  "fixedKillSet": [
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "蛇",
    "鼠",
    "狗",
    "龙",
    "马",
    "兔",
    "猴",
    "虎",
    "鸡"
  ],
  "oraclePool": [
    "猪",
    "鼠",
    "蛇",
    "狗",
    "龙",
    "马",
    "牛",
    "兔",
    "虎"
  ],
  "hechongPool": [
    "猪",
    "蛇",
    "兔",
    "牛",
    "猴",
    "虎",
    "羊",
    "鸡"
  ],
  "dynamicRate9": 78.57142857142857,
  "dynamicRate6": 60.71428571428571
};