var predictionMaxData = {
  "time": "2026-10-28 21:32:32",
  "issue": "2026301",
  "code": "27,41,23,11,2,43,17",
  "zodiac": "龙,虎,猴,猴,蛇,鼠,虎",
  "wave": "green,blue,red,green,red,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026302",
  "ninePool": [
    "狗",
    "鸡",
    "龙",
    "羊",
    "鼠",
    "牛",
    "蛇",
    "猴",
    "兔"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "龙",
    "羊",
    "鼠",
    "牛"
  ],
  "goldVotes": {
    "牛": 11,
    "鼠": 4,
    "猴": 3,
    "兔": 2,
    "虎": 3,
    "猪": 5,
    "鸡": 4,
    "龙": 4,
    "马": 4
  },
  "missing": {
    "马": 4,
    "羊": 9,
    "猴": 2,
    "鸡": 20,
    "狗": 27,
    "猪": 3,
    "鼠": 16,
    "牛": 18,
    "虎": 0,
    "兔": 7,
    "龙": 21,
    "蛇": 1
  },
  "fixedKillSet": [
    "虎",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "龙",
    "牛",
    "狗",
    "蛇",
    "兔",
    "马",
    "猴",
    "猪",
    "羊"
  ],
  "oraclePool": [
    "牛",
    "狗",
    "鼠",
    "蛇",
    "马",
    "猴",
    "羊",
    "猪",
    "鸡"
  ],
  "hechongPool": [
    "虎",
    "龙",
    "狗",
    "鼠",
    "蛇",
    "马",
    "猴",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};