var predictionMaxData = {
  "time": "2026-09-30 21:32:32",
  "issue": "2026273",
  "code": "30,3,25,28,6,17,5",
  "zodiac": "牛,龙,马,兔,牛,虎,虎",
  "wave": "red,blue,blue,green,green,green,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026274",
  "ninePool": [
    "龙",
    "马",
    "狗",
    "兔",
    "猪",
    "牛",
    "鸡",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "龙",
    "马",
    "狗",
    "兔",
    "猪",
    "牛"
  ],
  "goldVotes": {
    "鼠": 4,
    "龙": 2,
    "虎": 2,
    "猴": 6,
    "羊": 7,
    "牛": 3,
    "鸡": 2,
    "蛇": 2,
    "狗": 1,
    "猪": 1,
    "马": 1
  },
  "missing": {
    "马": 8,
    "羊": 12,
    "猴": 2,
    "鸡": 4,
    "狗": 9,
    "猪": 7,
    "鼠": 3,
    "牛": 11,
    "虎": 0,
    "兔": 5,
    "龙": 33,
    "蛇": 1
  },
  "fixedKillSet": [
    "虎",
    "牛"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "兔",
    "鸡",
    "猴",
    "虎",
    "龙",
    "狗",
    "猪",
    "蛇",
    "羊"
  ],
  "oraclePool": [
    "马",
    "兔",
    "鸡",
    "猴",
    "虎",
    "龙",
    "牛",
    "蛇",
    "羊"
  ],
  "hechongPool": [
    "鼠",
    "马",
    "猴",
    "虎",
    "猪",
    "狗",
    "龙",
    "蛇"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.0
};