var predictionMaxData = {
  "time": "2026-09-24 21:32:32",
  "issue": "2026267",
  "code": "16,20,25,22,9,41,40",
  "zodiac": "兔,猪,马,鸡,狗,虎,兔",
  "wave": "green,blue,blue,green,blue,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026268",
  "ninePool": [
    "龙",
    "虎",
    "蛇",
    "牛",
    "鼠",
    "狗",
    "鸡",
    "猪",
    "马"
  ],
  "sixPool": [
    "龙",
    "虎",
    "蛇",
    "牛",
    "鼠",
    "狗"
  ],
  "goldVotes": {
    "鼠": 2,
    "羊": 7,
    "兔": 4,
    "虎": 8,
    "猴": 4,
    "马": 3,
    "龙": 6,
    "狗": 3,
    "猪": 2,
    "鸡": 3,
    "蛇": 1
  },
  "missing": {
    "马": 2,
    "羊": 6,
    "猴": 18,
    "鸡": 8,
    "狗": 3,
    "猪": 1,
    "鼠": 10,
    "牛": 5,
    "虎": 28,
    "兔": 0,
    "龙": 27,
    "蛇": 13
  },
  "fixedKillSet": [
    "猴",
    "兔"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "虎",
    "龙",
    "猪",
    "猴",
    "鸡",
    "羊"
  ],
  "oraclePool": [
    "狗",
    "兔",
    "蛇",
    "虎",
    "马",
    "牛",
    "鼠",
    "龙",
    "猪"
  ],
  "hechongPool": [
    "狗",
    "兔",
    "蛇",
    "牛",
    "龙",
    "猪",
    "鸡",
    "羊"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 62.0
};