var predictionMaxData = {
  "time": "2026-09-12 21:32:32",
  "issue": "2026255",
  "code": "36,22,6,47,39,11,44",
  "zodiac": "羊,鸡,牛,猴,龙,猴,猪",
  "wave": "blue,green,green,blue,green,green,green",
  "teSx": "猪",
  "teWei": 4,
  "nextIssue": "2026256",
  "ninePool": [
    "鼠",
    "虎",
    "羊",
    "狗",
    "牛",
    "猴",
    "蛇",
    "马",
    "龙"
  ],
  "sixPool": [
    "鼠",
    "虎",
    "羊",
    "狗",
    "牛",
    "猴"
  ],
  "goldVotes": {
    "羊": 4,
    "狗": 3,
    "龙": 5,
    "兔": 6,
    "猴": 2,
    "鸡": 4,
    "虎": 2,
    "马": 2,
    "鼠": 1,
    "蛇": 1
  },
  "missing": {
    "马": 14,
    "羊": 18,
    "猴": 6,
    "鸡": 3,
    "狗": 12,
    "猪": 0,
    "鼠": 22,
    "牛": 4,
    "虎": 16,
    "兔": 2,
    "龙": 15,
    "蛇": 1
  },
  "fixedKillSet": [
    "马",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "兔",
    "马",
    "虎",
    "狗",
    "羊",
    "猴",
    "龙",
    "鸡",
    "鼠"
  ],
  "oraclePool": [
    "猪",
    "狗",
    "羊",
    "蛇",
    "鼠",
    "猴",
    "龙",
    "鸡",
    "马"
  ],
  "hechongPool": [
    "猪",
    "兔",
    "虎",
    "羊",
    "蛇",
    "牛",
    "猴",
    "鸡"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 66.0
};