var predictionMaxData = {
  "time": "2026-07-27 21:32:32",
  "issue": "2026208",
  "code": "7,48,40,35,23,28,19",
  "zodiac": "鼠,羊,兔,猴,猴,兔,鼠",
  "wave": "red,blue,red,red,red,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026209",
  "ninePool": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "猪",
    "虎",
    "兔",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "猪",
    "虎"
  ],
  "goldVotes": {
    "牛": 2,
    "狗": 5,
    "鸡": 2,
    "马": 2,
    "龙": 2,
    "猴": 3,
    "兔": 2,
    "虎": 2,
    "鼠": 1,
    "羊": 1
  },
  "missing": {
    "马": 5,
    "羊": 9,
    "猴": 2,
    "鸡": 32,
    "狗": 15,
    "猪": 7,
    "鼠": 0,
    "牛": 30,
    "虎": 4,
    "兔": 6,
    "龙": 3,
    "蛇": 14
  },
  "fixedKillSet": [
    "鼠",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "马",
    "蛇",
    "猴",
    "猪",
    "狗",
    "鸡",
    "虎",
    "羊"
  ],
  "oraclePool": [
    "鼠",
    "牛",
    "龙",
    "猴",
    "猪",
    "鸡",
    "狗",
    "兔",
    "虎"
  ],
  "hechongPool": [
    "鼠",
    "龙",
    "牛",
    "猴",
    "狗",
    "虎",
    "马",
    "羊"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};