var predictionMaxData = {
  "time": "2026-09-11 21:32:32",
  "issue": "2026254",
  "code": "26,44,35,6,16,10,2",
  "zodiac": "蛇,猪,猴,牛,兔,鸡,蛇",
  "wave": "blue,green,red,green,green,blue,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026255",
  "ninePool": [
    "鼠",
    "虎",
    "马",
    "狗",
    "羊",
    "猪",
    "鸡",
    "龙",
    "兔"
  ],
  "sixPool": [
    "鼠",
    "虎",
    "马",
    "狗",
    "羊",
    "猪"
  ],
  "goldVotes": {
    "龙": 7,
    "狗": 2,
    "羊": 4,
    "猴": 1,
    "蛇": 3,
    "鼠": 2,
    "马": 2,
    "兔": 2,
    "猪": 1,
    "牛": 2
  },
  "missing": {
    "马": 13,
    "羊": 17,
    "猴": 5,
    "鸡": 2,
    "狗": 11,
    "猪": 6,
    "鼠": 21,
    "牛": 3,
    "虎": 15,
    "兔": 1,
    "龙": 14,
    "蛇": 0
  },
  "fixedKillSet": [
    "蛇",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "猪",
    "龙",
    "牛",
    "狗",
    "蛇",
    "鸡",
    "羊",
    "虎",
    "兔"
  ],
  "oraclePool": [
    "猴",
    "猪",
    "龙",
    "蛇",
    "狗",
    "鸡",
    "羊",
    "兔",
    "马"
  ],
  "hechongPool": [
    "猴",
    "猪",
    "牛",
    "蛇",
    "鸡",
    "羊",
    "虎",
    "兔"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};