var predictionMaxData = {
  "time": "2026-08-04 21:32:32",
  "issue": "2026216",
  "code": "18,41,32,44,36,45,37",
  "zodiac": "牛,虎,猪,猪,羊,狗,马",
  "wave": "red,blue,green,green,blue,red,blue",
  "teSx": "马",
  "teWei": 7,
  "nextIssue": "2026217",
  "ninePool": [
    "鸡",
    "狗",
    "羊",
    "龙",
    "鼠",
    "猴",
    "牛",
    "虎",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "羊",
    "龙",
    "鼠",
    "猴"
  ],
  "goldVotes": {
    "鼠": 3,
    "蛇": 7,
    "猴": 1,
    "鸡": 2,
    "马": 5,
    "虎": 4,
    "龙": 2,
    "猪": 3,
    "兔": 2,
    "牛": 2
  },
  "missing": {
    "马": 0,
    "羊": 17,
    "猴": 3,
    "鸡": 40,
    "狗": 23,
    "猪": 7,
    "鼠": 8,
    "牛": 4,
    "虎": 12,
    "兔": 2,
    "龙": 11,
    "蛇": 1
  },
  "fixedKillSet": [
    "马",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "狗",
    "龙",
    "虎",
    "羊",
    "兔",
    "猴",
    "猪",
    "蛇",
    "牛",
    "鼠"
  ],
  "oraclePool": [
    "狗",
    "虎",
    "羊",
    "兔",
    "猴",
    "猪",
    "鸡",
    "牛",
    "鼠"
  ],
  "hechongPool": [
    "马",
    "狗",
    "龙",
    "虎",
    "羊",
    "猴",
    "牛",
    "鼠"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};