var predictionMaxData = {
  "time": "2026-10-16 21:32:32",
  "issue": "2026289",
  "code": "12,29,19,28,47,34,38",
  "zodiac": "羊,虎,鼠,兔,猴,鸡,蛇",
  "wave": "red,red,red,green,blue,red,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026290",
  "ninePool": [
    "兔",
    "虎",
    "狗",
    "鸡",
    "牛",
    "鼠",
    "猴",
    "龙",
    "马"
  ],
  "sixPool": [
    "兔",
    "虎",
    "狗",
    "鸡",
    "牛",
    "鼠"
  ],
  "goldVotes": {
    "羊": 4,
    "蛇": 6,
    "龙": 6,
    "虎": 1,
    "猪": 6,
    "鸡": 1,
    "猴": 2,
    "马": 1,
    "兔": 4,
    "狗": 2,
    "牛": 2
  },
  "missing": {
    "马": 1,
    "羊": 3,
    "猴": 7,
    "鸡": 8,
    "狗": 15,
    "猪": 2,
    "鼠": 4,
    "牛": 6,
    "虎": 14,
    "兔": 21,
    "龙": 9,
    "蛇": 0
  },
  "fixedKillSet": [
    "蛇",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "龙",
    "蛇",
    "鸡",
    "虎",
    "马",
    "鼠",
    "羊",
    "猴"
  ],
  "oraclePool": [
    "猪",
    "龙",
    "狗",
    "蛇",
    "牛",
    "虎",
    "兔",
    "鼠",
    "鸡"
  ],
  "hechongPool": [
    "猪",
    "蛇",
    "牛",
    "鸡",
    "虎",
    "兔",
    "羊",
    "猴"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};