var predictionMaxData = {
  "time": "2026-06-30 21:32:32",
  "issue": "2026181",
  "code": "17,29,6,34,47,15,19",
  "zodiac": "虎,虎,牛,鸡,猴,龙,鼠",
  "wave": "green,red,green,red,blue,blue,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026182",
  "ninePool": [
    "猴",
    "马",
    "兔",
    "虎",
    "羊",
    "牛",
    "龙",
    "鸡",
    "蛇"
  ],
  "sixPool": [
    "猴",
    "马",
    "兔",
    "虎",
    "羊",
    "牛"
  ],
  "goldVotes": {
    "狗": 7,
    "羊": 2,
    "兔": 2,
    "猪": 3,
    "鼠": 7,
    "猴": 4,
    "鸡": 2,
    "马": 2,
    "龙": 1,
    "蛇": 2
  },
  "missing": {
    "马": 18,
    "羊": 12,
    "猴": 39,
    "鸡": 5,
    "狗": 1,
    "猪": 9,
    "鼠": 0,
    "牛": 3,
    "虎": 7,
    "兔": 10,
    "龙": 2,
    "蛇": 4
  },
  "fixedKillSet": [
    "猪",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "猴",
    "马",
    "鸡",
    "牛",
    "蛇",
    "羊",
    "龙",
    "虎"
  ],
  "oraclePool": [
    "猪",
    "鸡",
    "牛",
    "兔",
    "蛇",
    "狗",
    "龙",
    "鼠",
    "虎"
  ],
  "hechongPool": [
    "猴",
    "马",
    "羊",
    "牛",
    "狗",
    "龙",
    "鼠",
    "虎"
  ],
  "dynamicRate9": 74.46808510638297,
  "dynamicRate6": 59.57446808510638
};