var predictionMaxData = {
  "time": "2026-05-25 21:32:32",
  "issue": "2026145",
  "code": "36,43,25,32,37,18,5",
  "zodiac": "羊,鼠,马,猪,马,牛,虎",
  "wave": "blue,green,blue,green,blue,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026146",
  "ninePool": [
    "鸡",
    "龙",
    "狗",
    "蛇",
    "牛",
    "兔",
    "马",
    "猴",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "狗",
    "蛇",
    "牛",
    "兔"
  ],
  "goldVotes": {
    "虎": 4,
    "牛": 6,
    "鼠": 6,
    "猪": 5,
    "猴": 8,
    "马": 6,
    "蛇": 2,
    "羊": 6,
    "龙": 6,
    "鸡": 1
  },
  "missing": {
    "马": 7,
    "羊": 6,
    "猴": 3,
    "鸡": 22,
    "狗": 4,
    "猪": 2,
    "鼠": 1,
    "牛": 10,
    "虎": 0,
    "兔": 5,
    "龙": 21,
    "蛇": 8
  },
  "fixedKillSet": [
    "鸡",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "猴",
    "狗",
    "虎",
    "羊",
    "龙",
    "兔",
    "猪",
    "鸡",
    "鼠",
    "蛇"
  ],
  "oraclePool": [
    "牛",
    "马",
    "猴",
    "狗",
    "虎",
    "羊",
    "猪",
    "鸡",
    "鼠"
  ],
  "hechongPool": [
    "马",
    "猴",
    "狗",
    "虎",
    "龙",
    "猪",
    "鼠",
    "蛇"
  ],
  "dynamicRate9": 91.66666666666666,
  "dynamicRate6": 66.66666666666666
};