var predictionMaxData = {
  "time": "2026-09-20 21:32:32",
  "issue": "2026263",
  "code": "44,28,3,2,24,13,9",
  "zodiac": "猪,兔,龙,蛇,羊,马,狗",
  "wave": "green,green,blue,red,red,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026264",
  "ninePool": [
    "虎",
    "龙",
    "猴",
    "蛇",
    "鸡",
    "兔",
    "猪",
    "羊",
    "狗"
  ],
  "sixPool": [
    "虎",
    "龙",
    "猴",
    "蛇",
    "鸡",
    "兔"
  ],
  "goldVotes": {
    "猴": 3,
    "兔": 7,
    "虎": 3,
    "马": 6,
    "牛": 4,
    "羊": 2,
    "龙": 4,
    "鼠": 4,
    "猪": 2,
    "鸡": 2,
    "蛇": 1
  },
  "missing": {
    "马": 7,
    "羊": 2,
    "猴": 14,
    "鸡": 4,
    "狗": 0,
    "猪": 3,
    "鼠": 6,
    "牛": 1,
    "虎": 24,
    "兔": 10,
    "龙": 23,
    "蛇": 9
  },
  "fixedKillSet": [
    "鼠",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "兔",
    "马",
    "蛇",
    "虎",
    "鼠",
    "猪",
    "猴",
    "牛",
    "龙",
    "鸡",
    "羊"
  ],
  "oraclePool": [
    "兔",
    "虎",
    "鼠",
    "猪",
    "猴",
    "牛",
    "狗",
    "鸡",
    "羊"
  ],
  "hechongPool": [
    "兔",
    "马",
    "虎",
    "鼠",
    "猴",
    "龙",
    "狗",
    "鸡"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0
};