var predictionMaxData = {
  "time": "2026-08-19 21:32:32",
  "issue": "2026231",
  "code": "39,46,23,11,8,13,20",
  "zodiac": "龙,鸡,猴,猴,猪,马,猪",
  "wave": "green,red,red,green,red,red,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026232",
  "ninePool": [
    "鸡",
    "龙",
    "牛",
    "猴",
    "羊",
    "虎",
    "鼠",
    "马",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "牛",
    "猴",
    "羊",
    "虎"
  ],
  "goldVotes": {
    "虎": 3,
    "鼠": 4,
    "猪": 5,
    "狗": 8,
    "鸡": 6,
    "蛇": 4,
    "龙": 8,
    "马": 1,
    "羊": 6,
    "兔": 5
  },
  "missing": {
    "马": 6,
    "羊": 11,
    "猴": 3,
    "鸡": 55,
    "狗": 7,
    "猪": 0,
    "鼠": 12,
    "牛": 19,
    "虎": 5,
    "兔": 1,
    "龙": 26,
    "蛇": 2
  },
  "fixedKillSet": [
    "猪",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "羊",
    "鼠",
    "猴",
    "狗",
    "兔",
    "龙",
    "牛",
    "鸡",
    "虎"
  ],
  "oraclePool": [
    "蛇",
    "猪",
    "鼠",
    "羊",
    "马",
    "兔",
    "龙",
    "牛",
    "虎"
  ],
  "hechongPool": [
    "蛇",
    "猪",
    "羊",
    "猴",
    "兔",
    "牛",
    "鸡",
    "虎"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};