var predictionMaxData = {
  "time": "2026-06-28 21:32:32",
  "issue": "2026179",
  "code": "10,11,26,6,31,9,15",
  "zodiac": "鸡,猴,蛇,牛,鼠,狗,龙",
  "wave": "blue,green,blue,green,blue,blue,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026180",
  "ninePool": [
    "猴",
    "马",
    "鼠",
    "兔",
    "羊",
    "狗",
    "猪",
    "虎",
    "鸡"
  ],
  "sixPool": [
    "猴",
    "马",
    "鼠",
    "兔",
    "羊",
    "狗"
  ],
  "goldVotes": {
    "牛": 4,
    "狗": 8,
    "鸡": 7,
    "虎": 6,
    "鼠": 2,
    "猪": 2,
    "蛇": 4,
    "龙": 3,
    "羊": 2,
    "猴": 2,
    "马": 2,
    "兔": 2
  },
  "missing": {
    "马": 16,
    "羊": 10,
    "猴": 37,
    "鸡": 3,
    "狗": 15,
    "猪": 7,
    "鼠": 12,
    "牛": 1,
    "虎": 5,
    "兔": 8,
    "龙": 0,
    "蛇": 2
  },
  "fixedKillSet": [
    "蛇",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "狗",
    "马",
    "蛇",
    "猴",
    "羊",
    "龙",
    "虎",
    "鼠",
    "鸡",
    "牛"
  ],
  "oraclePool": [
    "马",
    "蛇",
    "羊",
    "猴",
    "龙",
    "虎",
    "兔",
    "鼠",
    "牛"
  ],
  "hechongPool": [
    "狗",
    "马",
    "猴",
    "龙",
    "虎",
    "兔",
    "鼠",
    "鸡"
  ],
  "dynamicRate9": 75.55555555555556,
  "dynamicRate6": 60.0
};