var predictionMaxData = {
  "time": "2026-07-02 21:32:32",
  "issue": "2026183",
  "code": "23,9,46,37,42,3,24",
  "zodiac": "猴,狗,鸡,马,牛,龙,羊",
  "wave": "red,blue,red,blue,blue,blue,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026184",
  "ninePool": [
    "猴",
    "马",
    "猪",
    "兔",
    "鸡",
    "狗",
    "龙",
    "鼠",
    "牛"
  ],
  "sixPool": [
    "猴",
    "马",
    "猪",
    "兔",
    "鸡",
    "狗"
  ],
  "goldVotes": {
    "虎": 8,
    "牛": 1,
    "蛇": 7,
    "龙": 1,
    "兔": 3,
    "鼠": 1,
    "鸡": 1,
    "猴": 2,
    "羊": 2
  },
  "missing": {
    "马": 20,
    "羊": 0,
    "猴": 41,
    "鸡": 7,
    "狗": 3,
    "猪": 11,
    "鼠": 2,
    "牛": 5,
    "虎": 1,
    "兔": 12,
    "龙": 4,
    "蛇": 6
  },
  "fixedKillSet": [
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "兔",
    "狗",
    "蛇",
    "虎",
    "鸡",
    "猪",
    "羊",
    "牛",
    "龙"
  ],
  "oraclePool": [
    "狗",
    "蛇",
    "猴",
    "马",
    "虎",
    "鸡",
    "兔",
    "羊",
    "龙"
  ],
  "hechongPool": [
    "兔",
    "蛇",
    "马",
    "鸡",
    "猪",
    "羊",
    "牛",
    "鼠"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};