var predictionMaxData = {
  "time": "2026-07-28 21:32:32",
  "issue": "2026209",
  "code": "44,5,39,14,21,22,8",
  "zodiac": "猪,虎,龙,蛇,狗,鸡,猪",
  "wave": "green,green,green,blue,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026210",
  "ninePool": [
    "牛",
    "鸡",
    "蛇",
    "兔",
    "马",
    "狗",
    "羊",
    "龙",
    "猴"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "蛇",
    "兔",
    "马",
    "狗"
  ],
  "goldVotes": {
    "狗": 7,
    "鸡": 4,
    "猴": 3,
    "羊": 4,
    "蛇": 2,
    "猪": 5,
    "龙": 3,
    "虎": 5,
    "鼠": 5,
    "马": 1,
    "牛": 2
  },
  "missing": {
    "马": 6,
    "羊": 10,
    "猴": 3,
    "鸡": 33,
    "狗": 16,
    "猪": 0,
    "鼠": 1,
    "牛": 31,
    "虎": 5,
    "兔": 7,
    "龙": 4,
    "蛇": 15
  },
  "fixedKillSet": [
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "鸡",
    "猴",
    "牛",
    "猪",
    "虎",
    "蛇",
    "鼠"
  ],
  "oraclePool": [
    "龙",
    "马",
    "牛",
    "猪",
    "兔",
    "虎",
    "蛇",
    "鼠",
    "狗"
  ],
  "hechongPool": [
    "鸡",
    "猴",
    "兔",
    "猪",
    "牛",
    "虎",
    "蛇",
    "羊"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};