var predictionMaxData = {
  "time": "2026-09-04 21:32:32",
  "issue": "2026247",
  "code": "3,9,43,29,46,4,40",
  "zodiac": "龙,狗,鼠,虎,鸡,兔,兔",
  "wave": "blue,blue,green,red,red,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026248",
  "ninePool": [
    "鼠",
    "猪",
    "蛇",
    "狗",
    "龙",
    "虎",
    "马",
    "牛",
    "鸡"
  ],
  "sixPool": [
    "鼠",
    "猪",
    "蛇",
    "狗",
    "龙",
    "虎"
  ],
  "goldVotes": {
    "虎": 3,
    "牛": 3,
    "猴": 5,
    "蛇": 8,
    "鸡": 3,
    "羊": 5,
    "鼠": 1,
    "兔": 1,
    "猪": 3,
    "马": 3,
    "龙": 2
  },
  "missing": {
    "马": 6,
    "羊": 10,
    "猴": 11,
    "鸡": 3,
    "狗": 4,
    "猪": 12,
    "鼠": 14,
    "牛": 1,
    "虎": 8,
    "兔": 0,
    "龙": 7,
    "蛇": 18
  },
  "fixedKillSet": [
    "兔",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "兔",
    "虎",
    "鸡",
    "蛇",
    "龙",
    "牛",
    "羊",
    "狗",
    "猴"
  ],
  "oraclePool": [
    "猪",
    "马",
    "兔",
    "虎",
    "蛇",
    "鼠",
    "龙",
    "牛",
    "狗"
  ],
  "hechongPool": [
    "猪",
    "兔",
    "鸡",
    "蛇",
    "龙",
    "羊",
    "牛",
    "狗"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};