var predictionMaxData = {
  "time": "2026-06-02 21:32:32",
  "issue": "2026153",
  "code": "1,38,33,28,6,40,41",
  "zodiac": "马,蛇,狗,兔,牛,兔,虎",
  "wave": "red,green,green,green,green,red,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026154",
  "ninePool": [
    "鸡",
    "蛇",
    "兔",
    "猪",
    "马",
    "龙",
    "猴",
    "鼠",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "兔",
    "猪",
    "马",
    "龙"
  ],
  "goldVotes": {
    "牛": 4,
    "猴": 6,
    "羊": 6,
    "狗": 2,
    "龙": 2,
    "虎": 2,
    "鼠": 2,
    "鸡": 2,
    "蛇": 2
  },
  "missing": {
    "马": 6,
    "羊": 5,
    "猴": 11,
    "鸡": 30,
    "狗": 1,
    "猪": 10,
    "鼠": 2,
    "牛": 7,
    "虎": 0,
    "兔": 13,
    "龙": 4,
    "蛇": 16
  },
  "fixedKillSet": [
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "猪",
    "马",
    "虎",
    "狗",
    "羊",
    "鼠",
    "兔",
    "猴",
    "蛇",
    "鸡"
  ],
  "oraclePool": [
    "蛇",
    "龙",
    "牛",
    "马",
    "羊",
    "兔",
    "猴",
    "虎",
    "鸡"
  ],
  "hechongPool": [
    "蛇",
    "龙",
    "猪",
    "马",
    "狗",
    "鼠",
    "猴",
    "虎"
  ],
  "dynamicRate9": 84.21052631578947,
  "dynamicRate6": 68.42105263157895
};