var predictionMaxData = {
  "time": "2026-07-07 21:32:32",
  "issue": "2026188",
  "code": "38,5,19,10,14,1,16",
  "zodiac": "蛇,虎,鼠,鸡,蛇,马,兔",
  "wave": "green,green,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026189",
  "ninePool": [
    "鸡",
    "牛",
    "蛇",
    "鼠",
    "猪",
    "狗",
    "马",
    "龙",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "蛇",
    "鼠",
    "猪",
    "狗"
  ],
  "goldVotes": {
    "龙": 5,
    "猪": 4,
    "猴": 4,
    "马": 2,
    "虎": 8,
    "羊": 4,
    "兔": 6,
    "鸡": 1,
    "狗": 4
  },
  "missing": {
    "马": 1,
    "羊": 3,
    "猴": 2,
    "鸡": 12,
    "狗": 8,
    "猪": 16,
    "鼠": 7,
    "牛": 10,
    "虎": 6,
    "兔": 0,
    "龙": 9,
    "蛇": 11
  },
  "fixedKillSet": [
    "猪",
    "兔"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "狗",
    "鼠",
    "马",
    "兔",
    "猴",
    "虎",
    "蛇",
    "猪",
    "羊"
  ],
  "oraclePool": [
    "狗",
    "鼠",
    "马",
    "牛",
    "猴",
    "蛇",
    "猪",
    "鸡",
    "羊"
  ],
  "hechongPool": [
    "龙",
    "羊",
    "狗",
    "牛",
    "兔",
    "蛇",
    "鸡",
    "猪"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 64.0
};