var predictionMaxData = {
  "time": "2026-08-23 21:32:32",
  "issue": "2026235",
  "code": "27,26,35,17,44,21,32",
  "zodiac": "龙,蛇,猴,虎,猪,狗,猪",
  "wave": "green,blue,red,green,green,green,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026236",
  "ninePool": [
    "鸡",
    "羊",
    "蛇",
    "兔",
    "马",
    "猴",
    "狗",
    "牛",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "蛇",
    "兔",
    "马",
    "猴"
  ],
  "goldVotes": {
    "虎": 5,
    "鼠": 4,
    "猪": 5,
    "狗": 7,
    "鸡": 4,
    "蛇": 2,
    "龙": 5,
    "马": 7,
    "猴": 5,
    "羊": 8,
    "兔": 3,
    "牛": 4
  },
  "missing": {
    "马": 10,
    "羊": 15,
    "猴": 7,
    "鸡": 59,
    "狗": 11,
    "猪": 0,
    "鼠": 2,
    "牛": 3,
    "虎": 9,
    "兔": 5,
    "龙": 1,
    "蛇": 6
  },
  "fixedKillSet": [
    "虎",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "牛",
    "虎",
    "狗",
    "马",
    "鸡",
    "蛇",
    "兔",
    "龙"
  ],
  "oraclePool": [
    "鼠",
    "牛",
    "虎",
    "羊",
    "马",
    "兔",
    "蛇",
    "猴",
    "龙"
  ],
  "hechongPool": [
    "牛",
    "虎",
    "羊",
    "猪",
    "鸡",
    "兔",
    "蛇",
    "猴"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};