var predictionMaxData = {
  "time": "2026-07-12 21:32:32",
  "issue": "2026193",
  "code": "2,49,25,11,45,29,9",
  "zodiac": "蛇,马,马,猴,狗,虎,狗",
  "wave": "red,green,blue,green,red,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026194",
  "ninePool": [
    "猪",
    "鼠",
    "牛",
    "鸡",
    "蛇",
    "猴",
    "马",
    "羊",
    "龙"
  ],
  "sixPool": [
    "猪",
    "鼠",
    "牛",
    "鸡",
    "蛇",
    "猴"
  ],
  "goldVotes": {
    "兔": 6,
    "猪": 3,
    "狗": 5,
    "羊": 5,
    "牛": 3,
    "鸡": 5,
    "猴": 2,
    "蛇": 4,
    "虎": 4,
    "马": 3,
    "龙": 3
  },
  "missing": {
    "马": 1,
    "羊": 8,
    "猴": 7,
    "鸡": 17,
    "狗": 0,
    "猪": 21,
    "鼠": 12,
    "牛": 15,
    "虎": 2,
    "兔": 3,
    "龙": 4,
    "蛇": 16
  },
  "fixedKillSet": [
    "狗",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "兔",
    "猪",
    "龙",
    "鸡",
    "虎",
    "狗",
    "猴",
    "羊",
    "蛇"
  ],
  "oraclePool": [
    "兔",
    "鼠",
    "猪",
    "龙",
    "马",
    "虎",
    "羊",
    "蛇",
    "牛"
  ],
  "hechongPool": [
    "兔",
    "鼠",
    "龙",
    "马",
    "鸡",
    "狗",
    "虎",
    "猴"
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 62.0
};