var predictionMaxData = {
  "time": "2026-07-20 21:32:32",
  "issue": "2026201",
  "code": "46,28,19,38,31,25,32",
  "zodiac": "鸡,兔,鼠,蛇,鼠,马,猪",
  "wave": "red,green,red,green,blue,blue,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026202",
  "ninePool": [
    "牛",
    "鸡",
    "猴",
    "兔",
    "蛇",
    "虎",
    "鼠",
    "羊",
    "马"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "猴",
    "兔",
    "蛇",
    "虎"
  ],
  "goldVotes": {
    "马": 6,
    "龙": 6,
    "虎": 4,
    "猪": 8,
    "牛": 2,
    "狗": 6,
    "羊": 5,
    "鸡": 2,
    "蛇": 2,
    "兔": 2,
    "鼠": 2
  },
  "missing": {
    "马": 6,
    "羊": 2,
    "猴": 15,
    "鸡": 25,
    "狗": 8,
    "猪": 0,
    "鼠": 3,
    "牛": 23,
    "虎": 10,
    "兔": 11,
    "龙": 1,
    "蛇": 7
  },
  "fixedKillSet": [
    "猪",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "马",
    "虎",
    "狗",
    "鼠",
    "龙",
    "羊",
    "蛇",
    "猴",
    "兔",
    "鸡"
  ],
  "oraclePool": [
    "马",
    "牛",
    "虎",
    "鼠",
    "龙",
    "羊",
    "蛇",
    "猴",
    "兔"
  ],
  "hechongPool": [
    "猪",
    "虎",
    "牛",
    "羊",
    "蛇",
    "猴",
    "兔",
    "鸡"
  ],
  "dynamicRate9": 70.0,
  "dynamicRate6": 57.99999999999999
};