var predictionMaxData = {
  "time": "2026-07-01 21:32:32",
  "issue": "2026182",
  "code": "15,23,9,45,24,39,41",
  "zodiac": "龙,猴,狗,狗,羊,龙,虎",
  "wave": "blue,red,blue,red,red,green,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026183",
  "ninePool": [
    "猴",
    "兔",
    "马",
    "狗",
    "猪",
    "羊",
    "鸡",
    "龙",
    "鼠"
  ],
  "sixPool": [
    "猴",
    "兔",
    "马",
    "狗",
    "猪",
    "羊"
  ],
  "goldVotes": {
    "牛": 6,
    "鼠": 4,
    "羊": 5,
    "猴": 5,
    "马": 5,
    "蛇": 4,
    "鸡": 3,
    "龙": 4,
    "猪": 4,
    "虎": 3
  },
  "missing": {
    "马": 19,
    "羊": 13,
    "猴": 40,
    "鸡": 6,
    "狗": 2,
    "猪": 10,
    "鼠": 1,
    "牛": 4,
    "虎": 0,
    "兔": 11,
    "龙": 3,
    "蛇": 5
  },
  "fixedKillSet": [
    "蛇",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "鸡",
    "牛",
    "羊",
    "猪",
    "鼠",
    "狗",
    "虎",
    "兔"
  ],
  "oraclePool": [
    "鸡",
    "牛",
    "羊",
    "猪",
    "鼠",
    "狗",
    "虎",
    "猴",
    "兔"
  ],
  "hechongPool": [
    "蛇",
    "猪",
    "鼠",
    "马",
    "狗",
    "虎",
    "猴",
    "龙"
  ],
  "dynamicRate9": 75.0,
  "dynamicRate6": 60.416666666666664
};