var predictionMaxData = {
  "time": "2026-08-28 21:32:32",
  "issue": "2026240",
  "code": "2,34,22,26,28,37,27",
  "zodiac": "蛇,鸡,鸡,蛇,兔,马,龙",
  "wave": "red,red,green,blue,green,blue,green",
  "teSx": "龙",
  "teWei": 7,
  "nextIssue": "2026241",
  "ninePool": [
    "鸡",
    "兔",
    "马",
    "狗",
    "蛇",
    "猴",
    "牛",
    "鼠",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "马",
    "狗",
    "蛇",
    "猴"
  ],
  "goldVotes": {
    "狗": 5,
    "蛇": 3,
    "猪": 3,
    "虎": 7,
    "鸡": 3,
    "牛": 2,
    "猴": 2,
    "羊": 2,
    "马": 2,
    "鼠": 2
  },
  "missing": {
    "马": 15,
    "羊": 3,
    "猴": 4,
    "鸡": 64,
    "狗": 16,
    "猪": 5,
    "鼠": 7,
    "牛": 8,
    "虎": 1,
    "兔": 10,
    "龙": 0,
    "蛇": 11
  },
  "fixedKillSet": [
    "龙",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "狗",
    "龙",
    "猴",
    "蛇",
    "虎",
    "鼠",
    "羊",
    "猪",
    "兔"
  ],
  "oraclePool": [
    "狗",
    "龙",
    "猪",
    "猴",
    "蛇",
    "马",
    "羊",
    "鸡",
    "兔"
  ],
  "hechongPool": [
    "龙",
    "猴",
    "虎",
    "马",
    "鼠",
    "狗",
    "鸡",
    "兔"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999
};