var predictionMaxData = {
  "time": "2026-07-06 21:32:32",
  "issue": "2026187",
  "code": "23,12,36,38,27,22,1",
  "zodiac": "猴,羊,羊,蛇,龙,鸡,马",
  "wave": "red,red,blue,green,green,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026188",
  "ninePool": [
    "猪",
    "牛",
    "鸡",
    "兔",
    "羊",
    "狗",
    "蛇",
    "鼠",
    "龙"
  ],
  "sixPool": [
    "猪",
    "牛",
    "鸡",
    "兔",
    "羊",
    "狗"
  ],
  "goldVotes": {
    "马": 8,
    "虎": 4,
    "狗": 3,
    "蛇": 7,
    "龙": 4,
    "兔": 2,
    "鼠": 6,
    "猴": 4,
    "羊": 2,
    "鸡": 2,
    "猪": 1
  },
  "missing": {
    "马": 0,
    "羊": 2,
    "猴": 1,
    "鸡": 11,
    "狗": 7,
    "猪": 15,
    "鼠": 6,
    "牛": 9,
    "虎": 5,
    "兔": 16,
    "龙": 8,
    "蛇": 10
  },
  "fixedKillSet": [
    "龙",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "虎",
    "鸡",
    "龙",
    "鼠",
    "兔",
    "猪",
    "猴",
    "蛇",
    "狗"
  ],
  "oraclePool": [
    "马",
    "羊",
    "龙",
    "鼠",
    "鸡",
    "猪",
    "猴",
    "蛇",
    "狗"
  ],
  "hechongPool": [
    "马",
    "虎",
    "羊",
    "龙",
    "鼠",
    "牛",
    "猴",
    "狗"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};