var predictionMaxData = {
  "time": "2026-10-09 21:32:32",
  "issue": "2026282",
  "code": "44,3,37,46,29,20,23",
  "zodiac": "猪,龙,马,鸡,虎,猪,猴",
  "wave": "green,blue,blue,red,red,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026283",
  "ninePool": [
    "羊",
    "牛",
    "猪",
    "兔",
    "狗",
    "马",
    "鼠",
    "虎",
    "蛇"
  ],
  "sixPool": [
    "羊",
    "牛",
    "猪",
    "兔",
    "狗",
    "马"
  ],
  "goldVotes": {
    "鼠": 3,
    "猪": 1,
    "马": 4,
    "蛇": 3,
    "龙": 4,
    "牛": 2,
    "狗": 2,
    "鸡": 4,
    "兔": 2,
    "猴": 2,
    "羊": 1,
    "虎": 2
  },
  "missing": {
    "马": 17,
    "羊": 21,
    "猴": 0,
    "鸡": 1,
    "狗": 8,
    "猪": 16,
    "鼠": 12,
    "牛": 20,
    "虎": 7,
    "兔": 14,
    "龙": 2,
    "蛇": 4
  },
  "fixedKillSet": [
    "牛",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "羊",
    "虎",
    "鸡",
    "马",
    "兔",
    "龙",
    "狗",
    "猴",
    "蛇"
  ],
  "oraclePool": [
    "羊",
    "虎",
    "马",
    "鸡",
    "兔",
    "龙",
    "狗",
    "猴",
    "蛇"
  ],
  "hechongPool": [
    "猪",
    "虎",
    "马",
    "鼠",
    "龙",
    "狗",
    "猴",
    "蛇"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0
};