var predictionMaxData = {
  "time": "2026-05-29 21:32:32",
  "issue": "2026149",
  "code": "28,30,44,45,4,20,27",
  "zodiac": "兔,牛,猪,狗,兔,猪,龙",
  "wave": "green,red,green,red,blue,blue,green",
  "teSx": "龙",
  "teWei": 7,
  "nextIssue": "2026150",
  "ninePool": [
    "鸡",
    "蛇",
    "猪",
    "猴",
    "狗",
    "虎",
    "兔",
    "牛",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "猪",
    "猴",
    "狗",
    "虎"
  ],
  "goldVotes": {
    "狗": 3,
    "龙": 3,
    "马": 5,
    "蛇": 2,
    "羊": 6,
    "猪": 1,
    "鼠": 3,
    "兔": 4,
    "牛": 2,
    "猴": 3,
    "鸡": 2,
    "虎": 1
  },
  "missing": {
    "马": 2,
    "羊": 1,
    "猴": 7,
    "鸡": 26,
    "狗": 8,
    "猪": 6,
    "鼠": 5,
    "牛": 3,
    "虎": 4,
    "兔": 9,
    "龙": 0,
    "蛇": 12
  },
  "fixedKillSet": [
    "狗",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "羊",
    "猪",
    "鼠",
    "马",
    "兔",
    "虎",
    "龙",
    "猴"
  ],
  "oraclePool": [
    "狗",
    "蛇",
    "羊",
    "猪",
    "马",
    "兔",
    "鸡",
    "龙",
    "猴"
  ],
  "hechongPool": [
    "狗",
    "鼠",
    "马",
    "兔",
    "鸡",
    "虎",
    "龙",
    "猴"
  ],
  "dynamicRate9": 93.33333333333333,
  "dynamicRate6": 73.33333333333333
};