var predictionMaxData = {
  "time": "2026-06-15 21:32:32",
  "issue": "2026166",
  "code": "20,15,1,4,21,28,6",
  "zodiac": "猪,龙,马,兔,狗,兔,牛",
  "wave": "blue,blue,red,blue,green,green,green",
  "teSx": "牛",
  "teWei": 6,
  "nextIssue": "2026167",
  "ninePool": [
    "鸡",
    "猴",
    "鼠",
    "兔",
    "马",
    "羊",
    "虎",
    "狗",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "鼠",
    "兔",
    "马",
    "羊"
  ],
  "goldVotes": {
    "鸡": 8,
    "马": 1,
    "龙": 4,
    "鼠": 1,
    "虎": 6,
    "牛": 5,
    "猴": 6,
    "狗": 2,
    "蛇": 5,
    "猪": 4,
    "羊": 5,
    "兔": 2
  },
  "missing": {
    "马": 3,
    "羊": 18,
    "猴": 24,
    "鸡": 43,
    "狗": 2,
    "猪": 4,
    "鼠": 11,
    "牛": 0,
    "虎": 12,
    "兔": 8,
    "龙": 1,
    "蛇": 6
  },
  "fixedKillSet": [
    "牛"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "鸡",
    "虎",
    "蛇",
    "猪",
    "猴",
    "羊",
    "龙"
  ],
  "oraclePool": [
    "狗",
    "马",
    "虎",
    "蛇",
    "猪",
    "牛",
    "鼠",
    "兔",
    "龙"
  ],
  "hechongPool": [
    "马",
    "鸡",
    "蛇",
    "猪",
    "牛",
    "鼠",
    "兔",
    "羊"
  ],
  "dynamicRate9": 71.875,
  "dynamicRate6": 56.25
};