var predictionMaxData = {
  "time": "2026-09-02 21:32:32",
  "issue": "2026245",
  "code": "22,23,14,2,13,38,18",
  "zodiac": "鸡,猴,蛇,蛇,马,蛇,牛",
  "wave": "green,red,blue,red,red,green,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026246",
  "ninePool": [
    "猪",
    "猴",
    "鼠",
    "虎",
    "兔",
    "羊",
    "狗",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "猪",
    "猴",
    "鼠",
    "虎",
    "兔",
    "羊"
  ],
  "goldVotes": {
    "羊": 6,
    "龙": 3,
    "鼠": 6,
    "蛇": 5,
    "猪": 3,
    "马": 5,
    "兔": 6,
    "狗": 3,
    "猴": 2,
    "虎": 2,
    "牛": 4,
    "鸡": 5
  },
  "missing": {
    "马": 4,
    "羊": 8,
    "猴": 9,
    "鸡": 1,
    "狗": 2,
    "猪": 10,
    "鼠": 12,
    "牛": 0,
    "虎": 6,
    "兔": 15,
    "龙": 5,
    "蛇": 16
  },
  "fixedKillSet": [
    "蛇",
    "牛"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "猪",
    "狗",
    "羊",
    "牛",
    "鸡",
    "猴",
    "虎",
    "兔",
    "蛇",
    "鼠"
  ],
  "oraclePool": [
    "马",
    "猪",
    "狗",
    "羊",
    "牛",
    "猴",
    "鸡",
    "虎",
    "鼠"
  ],
  "hechongPool": [
    "马",
    "猪",
    "羊",
    "牛",
    "鸡",
    "兔",
    "蛇",
    "鼠"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};