var predictionMaxData = {
  "time": "2026-10-05 21:32:32",
  "issue": "2026278",
  "code": "6,40,24,29,44,1,2",
  "zodiac": "牛,兔,羊,虎,猪,马,蛇",
  "wave": "green,red,red,red,green,red,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026279",
  "ninePool": [
    "龙",
    "牛",
    "马",
    "猪",
    "羊",
    "虎",
    "兔",
    "狗",
    "猴"
  ],
  "sixPool": [
    "龙",
    "牛",
    "马",
    "猪",
    "羊",
    "虎"
  ],
  "goldVotes": {
    "鼠": 7,
    "鸡": 5,
    "猴": 3,
    "羊": 5,
    "马": 2,
    "猪": 2,
    "兔": 4,
    "蛇": 1
  },
  "missing": {
    "马": 13,
    "羊": 17,
    "猴": 1,
    "鸡": 9,
    "狗": 4,
    "猪": 12,
    "鼠": 8,
    "牛": 16,
    "虎": 3,
    "兔": 10,
    "龙": 38,
    "蛇": 0
  },
  "fixedKillSet": [
    "鼠",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "蛇",
    "鸡",
    "猪",
    "鼠",
    "虎",
    "兔",
    "猴",
    "羊",
    "狗",
    "马"
  ],
  "oraclePool": [
    "龙",
    "蛇",
    "鼠",
    "虎",
    "兔",
    "猴",
    "羊",
    "牛",
    "马"
  ],
  "hechongPool": [
    "蛇",
    "鸡",
    "猪",
    "虎",
    "兔",
    "猴",
    "羊",
    "牛"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.0
};