var predictionMaxData = {
  "time": "2026-10-13 21:32:32",
  "issue": "2026286",
  "code": "37,49,28,8,29,1,24",
  "zodiac": "马,马,兔,猪,虎,马,羊",
  "wave": "blue,green,green,red,red,red,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026287",
  "ninePool": [
    "马",
    "兔",
    "狗",
    "鸡",
    "牛",
    "猪",
    "蛇",
    "虎",
    "鼠"
  ],
  "sixPool": [
    "马",
    "兔",
    "狗",
    "鸡",
    "牛",
    "猪"
  ],
  "goldVotes": {
    "羊": 5,
    "鸡": 1,
    "马": 3,
    "虎": 4,
    "牛": 2,
    "蛇": 6,
    "猪": 2,
    "猴": 4,
    "鼠": 2,
    "兔": 2
  },
  "missing": {
    "马": 21,
    "羊": 0,
    "猴": 4,
    "鸡": 5,
    "狗": 12,
    "猪": 2,
    "鼠": 1,
    "牛": 3,
    "虎": 11,
    "兔": 18,
    "龙": 6,
    "蛇": 8
  },
  "fixedKillSet": [
    "龙",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "羊",
    "兔",
    "猴",
    "鸡",
    "蛇",
    "龙",
    "马",
    "虎"
  ],
  "oraclePool": [
    "狗",
    "羊",
    "兔",
    "猴",
    "鸡",
    "龙",
    "蛇",
    "马",
    "虎"
  ],
  "hechongPool": [
    "羊",
    "兔",
    "猪",
    "鸡",
    "牛",
    "蛇",
    "马",
    "鼠"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 64.0
};