var predictionMaxData = {
  "time": "2026-07-24 21:32:32",
  "issue": "2026205",
  "code": "30,17,39,12,11,28,3",
  "zodiac": "牛,虎,龙,羊,猴,兔,龙",
  "wave": "red,green,green,red,green,green,blue",
  "teSx": "龙",
  "teWei": 3,
  "nextIssue": "2026206",
  "ninePool": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "兔",
    "鼠",
    "虎",
    "羊",
    "马"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "兔",
    "鼠"
  ],
  "goldVotes": {
    "鼠": 2,
    "猪": 2,
    "马": 2,
    "蛇": 5,
    "狗": 3,
    "鸡": 1,
    "龙": 1,
    "牛": 1
  },
  "missing": {
    "马": 2,
    "羊": 6,
    "猴": 19,
    "鸡": 29,
    "狗": 12,
    "猪": 4,
    "鼠": 7,
    "牛": 27,
    "虎": 1,
    "兔": 3,
    "龙": 0,
    "蛇": 11
  },
  "fixedKillSet": [
    "猪",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "兔",
    "蛇",
    "龙",
    "虎",
    "牛",
    "鸡",
    "羊",
    "狗",
    "鼠",
    "猪",
    "猴"
  ],
  "oraclePool": [
    "兔",
    "龙",
    "虎",
    "牛",
    "鸡",
    "鼠",
    "狗",
    "猪",
    "猴"
  ],
  "hechongPool": [
    "兔",
    "龙",
    "虎",
    "鸡",
    "马",
    "鼠",
    "狗",
    "猴"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0
};