var predictionMaxData = {
  "time": "2026-10-19 21:32:32",
  "issue": "2026292",
  "code": "39,10,18,23,16,4,36",
  "zodiac": "龙,鸡,牛,猴,兔,兔,羊",
  "wave": "green,blue,red,red,green,blue,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026293",
  "ninePool": [
    "鸡",
    "猴",
    "牛",
    "鼠",
    "龙",
    "狗",
    "兔",
    "马",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "牛",
    "鼠",
    "龙",
    "狗"
  ],
  "goldVotes": {
    "虎": 10,
    "猪": 4,
    "狗": 8,
    "鸡": 2,
    "龙": 3,
    "猴": 1,
    "兔": 2,
    "牛": 1,
    "羊": 1,
    "马": 2,
    "蛇": 4
  },
  "missing": {
    "马": 4,
    "羊": 0,
    "猴": 10,
    "鸡": 11,
    "狗": 18,
    "猪": 5,
    "鼠": 7,
    "牛": 9,
    "虎": 1,
    "兔": 2,
    "龙": 12,
    "蛇": 3
  },
  "fixedKillSet": [
    "羊",
    "马"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "兔",
    "牛",
    "猪",
    "狗",
    "猴",
    "马",
    "羊",
    "鸡",
    "虎"
  ],
  "oraclePool": [
    "龙",
    "兔",
    "蛇",
    "狗",
    "猴",
    "马",
    "羊",
    "鸡",
    "猪"
  ],
  "hechongPool": [
    "鼠",
    "兔",
    "牛",
    "蛇",
    "马",
    "羊",
    "鸡",
    "猪"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};