var predictionMaxData = {
  "time": "2026-06-14 21:32:32",
  "issue": "2026165",
  "code": "11,47,9,49,2,1,3",
  "zodiac": "猴,猴,狗,马,蛇,马,龙",
  "wave": "green,blue,blue,green,red,red,blue",
  "teSx": "龙",
  "teWei": 3,
  "nextIssue": "2026166",
  "ninePool": [
    "鸡",
    "猴",
    "羊",
    "鼠",
    "牛",
    "虎",
    "蛇",
    "马",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "羊",
    "鼠",
    "牛",
    "虎"
  ],
  "goldVotes": {
    "马": 3,
    "虎": 6,
    "狗": 8,
    "鼠": 2,
    "猪": 6,
    "鸡": 4,
    "蛇": 3,
    "牛": 4,
    "龙": 2,
    "兔": 4
  },
  "missing": {
    "马": 2,
    "羊": 17,
    "猴": 23,
    "鸡": 42,
    "狗": 1,
    "猪": 3,
    "鼠": 10,
    "牛": 19,
    "虎": 11,
    "兔": 7,
    "龙": 0,
    "蛇": 5
  },
  "fixedKillSet": [
    "马",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "兔",
    "羊",
    "鼠",
    "虎",
    "龙",
    "鸡",
    "马",
    "狗",
    "蛇",
    "猪"
  ],
  "oraclePool": [
    "羊",
    "猴",
    "鼠",
    "牛",
    "鸡",
    "马",
    "狗",
    "蛇",
    "猪"
  ],
  "hechongPool": [
    "兔",
    "猴",
    "鼠",
    "虎",
    "龙",
    "鸡",
    "马",
    "狗"
  ],
  "dynamicRate9": 74.19354838709677,
  "dynamicRate6": 58.06451612903226
};