var predictionMaxData = {
  "time": "2026-06-19 21:32:32",
  "issue": "2026170",
  "code": "27,46,6,38,20,34,3",
  "zodiac": "龙,鸡,牛,蛇,猪,鸡,龙",
  "wave": "green,red,green,green,blue,red,blue",
  "teSx": "龙",
  "teWei": 3,
  "nextIssue": "2026171",
  "ninePool": [
    "鸡",
    "猴",
    "兔",
    "虎",
    "鼠",
    "狗",
    "牛",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "兔",
    "虎",
    "鼠",
    "狗"
  ],
  "goldVotes": {
    "牛": 2,
    "鼠": 1,
    "猪": 7,
    "猴": 1,
    "龙": 1,
    "蛇": 4,
    "虎": 5,
    "鸡": 3,
    "狗": 2,
    "兔": 2,
    "马": 3,
    "羊": 2
  },
  "missing": {
    "马": 7,
    "羊": 1,
    "猴": 28,
    "鸡": 47,
    "狗": 6,
    "猪": 8,
    "鼠": 3,
    "牛": 4,
    "虎": 16,
    "兔": 12,
    "龙": 0,
    "蛇": 10
  },
  "fixedKillSet": [
    "马",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "狗",
    "猴",
    "鼠",
    "虎",
    "猪",
    "羊",
    "牛",
    "马",
    "鸡",
    "蛇",
    "兔"
  ],
  "oraclePool": [
    "龙",
    "鼠",
    "虎",
    "猪",
    "羊",
    "牛",
    "马",
    "蛇",
    "兔"
  ],
  "hechongPool": [
    "龙",
    "狗",
    "猴",
    "鼠",
    "虎",
    "马",
    "鸡",
    "兔"
  ],
  "dynamicRate9": 75.0,
  "dynamicRate6": 58.333333333333336
};