var predictionMaxData = {
  "time": "2026-10-27 21:32:32",
  "issue": "2026300",
  "code": "1,29,23,17,18,42,38",
  "zodiac": "马,虎,猴,虎,牛,牛,蛇",
  "wave": "red,red,red,green,red,blue,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026301",
  "ninePool": [
    "牛",
    "狗",
    "龙",
    "鼠",
    "虎",
    "鸡",
    "羊",
    "猴",
    "兔"
  ],
  "sixPool": [
    "牛",
    "狗",
    "龙",
    "鼠",
    "虎",
    "鸡"
  ],
  "goldVotes": {
    "兔": 5,
    "狗": 4,
    "鸡": 4,
    "马": 4,
    "羊": 3,
    "蛇": 7,
    "龙": 8,
    "虎": 1,
    "鼠": 1,
    "猴": 3,
    "猪": 2
  },
  "missing": {
    "马": 3,
    "羊": 8,
    "猴": 1,
    "鸡": 19,
    "狗": 26,
    "猪": 2,
    "鼠": 15,
    "牛": 17,
    "虎": 7,
    "兔": 6,
    "龙": 20,
    "蛇": 0
  },
  "fixedKillSet": [
    "猪",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "猪",
    "狗",
    "蛇",
    "龙",
    "鸡",
    "牛",
    "羊",
    "马",
    "兔",
    "猴"
  ],
  "oraclePool": [
    "虎",
    "猴",
    "蛇",
    "龙",
    "鸡",
    "羊",
    "马",
    "兔",
    "牛"
  ],
  "hechongPool": [
    "虎",
    "猪",
    "蛇",
    "鸡",
    "牛",
    "羊",
    "兔",
    "猴"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};