var predictionMaxData = {
  "time": "2026-07-13 21:32:32",
  "issue": "2026194",
  "code": "30,21,22,15,4,34,26",
  "zodiac": "牛,狗,鸡,龙,兔,鸡,蛇",
  "wave": "red,green,green,blue,blue,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026195",
  "ninePool": [
    "猪",
    "鸡",
    "猴",
    "兔",
    "鼠",
    "牛",
    "狗",
    "龙",
    "虎"
  ],
  "sixPool": [
    "猪",
    "鸡",
    "猴",
    "兔",
    "鼠",
    "牛"
  ],
  "goldVotes": {
    "鼠": 3,
    "鸡": 2,
    "猴": 3,
    "羊": 7,
    "马": 7,
    "蛇": 2,
    "虎": 2,
    "猪": 2,
    "狗": 1,
    "牛": 4,
    "龙": 3,
    "兔": 1
  },
  "missing": {
    "马": 2,
    "羊": 9,
    "猴": 8,
    "鸡": 18,
    "狗": 1,
    "猪": 22,
    "鼠": 13,
    "牛": 16,
    "虎": 3,
    "兔": 4,
    "龙": 5,
    "蛇": 0
  },
  "fixedKillSet": [
    "羊",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猪",
    "猴",
    "鸡",
    "鼠",
    "羊",
    "虎",
    "牛",
    "兔",
    "蛇",
    "马"
  ],
  "oraclePool": [
    "猪",
    "猴",
    "鸡",
    "狗",
    "羊",
    "龙",
    "兔",
    "蛇",
    "马"
  ],
  "hechongPool": [
    "猪",
    "猴",
    "鸡",
    "羊",
    "虎",
    "牛",
    "兔",
    "蛇"
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 62.0
};