var predictionMaxData = {
  "time": "2026-06-24 21:32:32",
  "issue": "2026175",
  "code": "7,19,30,29,28,25,26",
  "zodiac": "鼠,鼠,牛,虎,兔,马,蛇",
  "wave": "red,red,red,red,green,blue,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026176",
  "ninePool": [
    "鸡",
    "猴",
    "狗",
    "龙",
    "牛",
    "羊",
    "鼠",
    "马",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "狗",
    "龙",
    "牛",
    "羊"
  ],
  "goldVotes": {
    "猪": 5,
    "鸡": 8,
    "蛇": 5,
    "兔": 7,
    "鼠": 2,
    "羊": 2,
    "马": 5,
    "牛": 2,
    "狗": 1,
    "猴": 2
  },
  "missing": {
    "马": 12,
    "羊": 6,
    "猴": 33,
    "鸡": 52,
    "狗": 11,
    "猪": 3,
    "鼠": 8,
    "牛": 9,
    "虎": 1,
    "兔": 4,
    "龙": 5,
    "蛇": 0
  },
  "fixedKillSet": [
    "蛇",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "鼠",
    "马",
    "蛇",
    "鸡",
    "猪",
    "牛",
    "兔",
    "狗",
    "羊",
    "猴"
  ],
  "oraclePool": [
    "马",
    "蛇",
    "鸡",
    "龙",
    "猪",
    "兔",
    "狗",
    "羊",
    "猴"
  ],
  "hechongPool": [
    "虎",
    "蛇",
    "鸡",
    "猪",
    "牛",
    "兔",
    "羊",
    "猴"
  ],
  "dynamicRate9": 75.60975609756098,
  "dynamicRate6": 60.97560975609756
};