var predictionMaxData = {
  "time": "2026-08-18 21:32:32",
  "issue": "2026230",
  "code": "28,26,47,14,49,10,16",
  "zodiac": "兔,蛇,猴,蛇,马,鸡,兔",
  "wave": "green,blue,blue,blue,green,blue,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026231",
  "ninePool": [
    "鸡",
    "猪",
    "龙",
    "狗",
    "牛",
    "鼠",
    "羊",
    "马",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "龙",
    "狗",
    "牛",
    "鼠"
  ],
  "goldVotes": {
    "鼠": 3,
    "羊": 8,
    "兔": 1,
    "虎": 8,
    "猴": 5,
    "鸡": 3,
    "马": 2,
    "龙": 4,
    "牛": 4,
    "蛇": 2,
    "猪": 2
  },
  "missing": {
    "马": 5,
    "羊": 10,
    "猴": 2,
    "鸡": 54,
    "狗": 6,
    "猪": 21,
    "鼠": 11,
    "牛": 18,
    "虎": 4,
    "兔": 0,
    "龙": 25,
    "蛇": 1
  },
  "fixedKillSet": [
    "兔",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "鸡",
    "蛇",
    "猪",
    "龙",
    "兔",
    "虎",
    "鼠",
    "牛",
    "猴"
  ],
  "oraclePool": [
    "羊",
    "鸡",
    "猪",
    "兔",
    "虎",
    "鼠",
    "狗",
    "牛",
    "猴"
  ],
  "hechongPool": [
    "羊",
    "鸡",
    "蛇",
    "猪",
    "龙",
    "兔",
    "狗",
    "牛"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};