var predictionMaxData = {
  "time": "2026-09-09 21:32:32",
  "issue": "2026252",
  "code": "33,41,43,13,6,48,22",
  "zodiac": "狗,虎,鼠,马,牛,羊,鸡",
  "wave": "green,blue,green,red,green,blue,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026253",
  "ninePool": [
    "羊",
    "兔",
    "牛",
    "狗",
    "龙",
    "鼠",
    "虎",
    "马",
    "猪"
  ],
  "sixPool": [
    "羊",
    "兔",
    "牛",
    "狗",
    "龙",
    "鼠"
  ],
  "goldVotes": {
    "鸡": 6,
    "鼠": 8,
    "蛇": 5,
    "龙": 5,
    "虎": 5,
    "猪": 2,
    "猴": 5,
    "羊": 1,
    "狗": 2,
    "马": 4
  },
  "missing": {
    "马": 11,
    "羊": 15,
    "猴": 3,
    "鸡": 0,
    "狗": 9,
    "猪": 4,
    "鼠": 19,
    "牛": 1,
    "虎": 13,
    "兔": 5,
    "龙": 12,
    "蛇": 2
  },
  "fixedKillSet": [
    "猪",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "马",
    "虎",
    "鼠",
    "猪",
    "狗",
    "鸡",
    "蛇",
    "龙",
    "羊"
  ],
  "oraclePool": [
    "猴",
    "马",
    "虎",
    "蛇",
    "牛",
    "鸡",
    "兔",
    "龙",
    "羊"
  ],
  "hechongPool": [
    "蛇",
    "猪",
    "牛",
    "狗",
    "鸡",
    "兔",
    "龙",
    "羊"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};