var predictionMaxData = {
  "time": "2026-10-23 21:32:32",
  "issue": "2026296",
  "code": "14,43,26,45,3,31,23",
  "zodiac": "蛇,鼠,蛇,狗,龙,鼠,猴",
  "wave": "blue,green,blue,red,blue,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026297",
  "ninePool": [
    "狗",
    "龙",
    "蛇",
    "鼠",
    "牛",
    "羊",
    "猪",
    "鸡",
    "马"
  ],
  "sixPool": [
    "狗",
    "龙",
    "蛇",
    "鼠",
    "牛",
    "羊"
  ],
  "goldVotes": {
    "龙": 4,
    "兔": 4,
    "虎": 6,
    "猪": 4,
    "猴": 4,
    "马": 5,
    "鼠": 4,
    "牛": 3,
    "狗": 4,
    "鸡": 6,
    "羊": 2,
    "蛇": 1
  },
  "missing": {
    "马": 1,
    "羊": 4,
    "猴": 0,
    "鸡": 15,
    "狗": 22,
    "猪": 9,
    "鼠": 11,
    "牛": 13,
    "虎": 3,
    "兔": 2,
    "龙": 16,
    "蛇": 7
  },
  "fixedKillSet": [
    "猴",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "猴",
    "蛇",
    "牛",
    "狗",
    "猪",
    "兔",
    "虎",
    "鸡"
  ],
  "oraclePool": [
    "羊",
    "猴",
    "蛇",
    "狗",
    "龙",
    "鸡",
    "猪",
    "鼠",
    "马"
  ],
  "hechongPool": [
    "猴",
    "蛇",
    "狗",
    "龙",
    "猪",
    "鼠",
    "虎",
    "马"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0
};