var predictionMaxData = {
  "time": "2026-10-21 21:32:32",
  "issue": "2026294",
  "code": "29,43,10,2,34,27,28",
  "zodiac": "虎,鼠,鸡,蛇,鸡,龙,兔",
  "wave": "red,green,blue,red,red,green,green",
  "teSx": "兔",
  "teWei": 8,
  "nextIssue": "2026295",
  "ninePool": [
    "狗",
    "龙",
    "牛",
    "鼠",
    "猴",
    "蛇",
    "猪",
    "马",
    "鸡"
  ],
  "sixPool": [
    "狗",
    "龙",
    "牛",
    "鼠",
    "猴",
    "蛇"
  ],
  "goldVotes": {
    "猪": 3,
    "狗": 2,
    "鸡": 6,
    "羊": 3,
    "兔": 2,
    "龙": 2,
    "虎": 3,
    "马": 1,
    "猴": 2,
    "蛇": 2
  },
  "missing": {
    "马": 6,
    "羊": 2,
    "猴": 12,
    "鸡": 13,
    "狗": 20,
    "猪": 7,
    "鼠": 9,
    "牛": 11,
    "虎": 1,
    "兔": 0,
    "龙": 14,
    "蛇": 5
  },
  "fixedKillSet": [
    "鸡",
    "兔"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "鸡",
    "羊",
    "马",
    "猪",
    "蛇",
    "狗",
    "虎",
    "牛",
    "鼠"
  ],
  "oraclePool": [
    "鸡",
    "兔",
    "龙",
    "猪",
    "蛇",
    "狗",
    "虎",
    "牛",
    "鼠"
  ],
  "hechongPool": [
    "鸡",
    "兔",
    "羊",
    "龙",
    "猪",
    "蛇",
    "狗",
    "牛"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};