var predictionMaxData = {
  "time": "2026-10-06 21:32:32",
  "issue": "2026279",
  "code": "29,32,47,38,6,26,10",
  "zodiac": "虎,猪,猴,蛇,牛,蛇,鸡",
  "wave": "red,green,blue,green,green,blue,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026280",
  "ninePool": [
    "龙",
    "兔",
    "牛",
    "羊",
    "猪",
    "马",
    "虎",
    "鼠",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "兔",
    "牛",
    "羊",
    "猪",
    "马"
  ],
  "goldVotes": {
    "牛": 2,
    "蛇": 4,
    "马": 5,
    "鼠": 4,
    "鸡": 3,
    "龙": 1,
    "猴": 7,
    "羊": 3,
    "狗": 4,
    "虎": 2,
    "猪": 1
  },
  "missing": {
    "马": 14,
    "羊": 18,
    "猴": 2,
    "鸡": 0,
    "狗": 5,
    "猪": 13,
    "鼠": 9,
    "牛": 17,
    "虎": 4,
    "兔": 11,
    "龙": 39,
    "蛇": 1
  },
  "fixedKillSet": [
    "猴",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "虎",
    "马",
    "鼠",
    "龙",
    "鸡",
    "狗",
    "猪",
    "蛇",
    "羊",
    "猴"
  ],
  "oraclePool": [
    "牛",
    "虎",
    "龙",
    "马",
    "鸡",
    "兔",
    "蛇",
    "羊",
    "猴"
  ],
  "hechongPool": [
    "牛",
    "龙",
    "狗",
    "鸡",
    "猪",
    "兔",
    "蛇",
    "羊"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 66.0
};