var predictionMaxData = {
  "time": "2026-05-24 21:32:32",
  "issue": "2026144",
  "code": "47,31,29,33,22,26,43",
  "zodiac": "猴,鼠,虎,狗,鸡,蛇,鼠",
  "wave": "blue,blue,red,green,green,blue,green",
  "teSx": "鼠",
  "teWei": 3,
  "nextIssue": "2026145",
  "ninePool": [
    "龙",
    "鸡",
    "牛",
    "虎",
    "羊",
    "马",
    "蛇",
    "猴",
    "狗"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "牛",
    "虎",
    "羊",
    "马"
  ],
  "goldVotes": {
    "猪": 10,
    "马": 2,
    "蛇": 3,
    "龙": 6,
    "虎": 3,
    "狗": 5,
    "兔": 4,
    "猴": 3,
    "鸡": 3,
    "鼠": 2,
    "羊": 1
  },
  "missing": {
    "马": 6,
    "羊": 5,
    "猴": 2,
    "鸡": 21,
    "狗": 3,
    "猪": 1,
    "鼠": 0,
    "牛": 9,
    "虎": 14,
    "兔": 4,
    "龙": 20,
    "蛇": 7
  },
  "fixedKillSet": [
    "鼠",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "猪",
    "狗",
    "猴",
    "马",
    "兔",
    "鸡",
    "羊",
    "蛇",
    "龙",
    "虎"
  ],
  "oraclePool": [
    "牛",
    "狗",
    "猪",
    "兔",
    "鸡",
    "鼠",
    "蛇",
    "龙",
    "虎"
  ],
  "hechongPool": [
    "牛",
    "狗",
    "猴",
    "马",
    "鼠",
    "龙",
    "羊",
    "虎"
  ],
  "dynamicRate9": 90.9090909090909,
  "dynamicRate6": 63.63636363636363
};