var predictionMaxData = {
  "time": "2026-07-26 21:32:32",
  "issue": "2026207",
  "code": "9,40,26,23,44,13,31",
  "zodiac": "狗,兔,蛇,猴,猪,马,鼠",
  "wave": "blue,red,blue,red,green,red,blue",
  "teSx": "鼠",
  "teWei": 1,
  "nextIssue": "2026208",
  "ninePool": [
    "牛",
    "鸡",
    "狗",
    "蛇",
    "马",
    "龙",
    "虎",
    "羊",
    "兔"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "狗",
    "蛇",
    "马",
    "龙"
  ],
  "goldVotes": {
    "鸡": 2,
    "猴": 7,
    "鼠": 6,
    "猪": 7,
    "狗": 1,
    "龙": 1,
    "虎": 2,
    "羊": 4,
    "牛": 2,
    "蛇": 1,
    "兔": 5
  },
  "missing": {
    "马": 4,
    "羊": 8,
    "猴": 1,
    "鸡": 31,
    "狗": 14,
    "猪": 6,
    "鼠": 0,
    "牛": 29,
    "虎": 3,
    "兔": 5,
    "龙": 2,
    "蛇": 13
  },
  "fixedKillSet": [
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "猴",
    "虎",
    "蛇",
    "牛",
    "羊",
    "猪",
    "马",
    "鼠",
    "龙",
    "兔",
    "狗",
    "鸡"
  ],
  "oraclePool": [
    "猴",
    "虎",
    "鼠",
    "蛇",
    "牛",
    "羊",
    "马",
    "兔",
    "龙"
  ],
  "hechongPool": [
    "猴",
    "虎",
    "牛",
    "羊",
    "马",
    "鼠",
    "龙",
    "狗"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};