var predictionMaxData = {
  "time": "2026-08-17 21:32:32",
  "issue": "2026229",
  "code": "11,7,15,13,33,16,38",
  "zodiac": "猴,鼠,龙,马,狗,兔,蛇",
  "wave": "green,red,blue,red,green,green,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026230",
  "ninePool": [
    "鸡",
    "龙",
    "猪",
    "牛",
    "鼠",
    "虎",
    "羊",
    "狗",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "猪",
    "牛",
    "鼠",
    "虎"
  ],
  "goldVotes": {
    "蛇": 9,
    "牛": 6,
    "猪": 3,
    "羊": 3,
    "马": 4,
    "狗": 2,
    "龙": 2,
    "兔": 5,
    "鼠": 3,
    "鸡": 3,
    "虎": 1
  },
  "missing": {
    "马": 4,
    "羊": 9,
    "猴": 1,
    "鸡": 53,
    "狗": 5,
    "猪": 20,
    "鼠": 10,
    "牛": 17,
    "虎": 3,
    "兔": 2,
    "龙": 24,
    "蛇": 0
  },
  "fixedKillSet": [
    "鸡",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "鸡",
    "猴",
    "蛇",
    "狗",
    "兔",
    "龙",
    "牛",
    "羊",
    "猪"
  ],
  "oraclePool": [
    "虎",
    "蛇",
    "狗",
    "兔",
    "龙",
    "牛",
    "马",
    "猪",
    "鼠"
  ],
  "hechongPool": [
    "虎",
    "鸡",
    "猴",
    "蛇",
    "兔",
    "牛",
    "羊",
    "猪"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};