var predictionMaxData = {
  "time": "2026-06-20 21:32:32",
  "issue": "2026171",
  "code": "24,38,40,31,42,46,28",
  "zodiac": "羊,蛇,兔,鼠,牛,鸡,兔",
  "wave": "red,green,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": 8,
  "nextIssue": "2026172",
  "ninePool": [
    "鸡",
    "猴",
    "马",
    "猪",
    "龙",
    "蛇",
    "牛",
    "鼠",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "马",
    "猪",
    "龙",
    "蛇"
  ],
  "goldVotes": {
    "狗": 4,
    "猪": 2,
    "虎": 6,
    "鸡": 3,
    "羊": 6,
    "猴": 6,
    "马": 2,
    "蛇": 4,
    "龙": 2,
    "牛": 2,
    "鼠": 1
  },
  "missing": {
    "马": 8,
    "羊": 2,
    "猴": 29,
    "鸡": 48,
    "狗": 7,
    "猪": 9,
    "鼠": 4,
    "牛": 5,
    "虎": 17,
    "兔": 0,
    "龙": 1,
    "蛇": 11
  },
  "fixedKillSet": [
    "兔",
    "虎"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "蛇",
    "狗",
    "牛",
    "猪",
    "虎",
    "鸡",
    "马",
    "猴"
  ],
  "oraclePool": [
    "蛇",
    "羊",
    "狗",
    "兔",
    "龙",
    "虎",
    "鸡",
    "马",
    "猴"
  ],
  "hechongPool": [
    "羊",
    "狗",
    "蛇",
    "牛",
    "猪",
    "兔",
    "龙",
    "鸡"
  ],
  "dynamicRate9": 73.68421052631578,
  "dynamicRate6": 57.89473684210527
};