var predictionMaxData = {
  "time": "2026-06-10 21:32:32",
  "issue": "2026161",
  "code": "36,40,42,19,34,46,8",
  "zodiac": "羊,兔,牛,鼠,鸡,鸡,猪",
  "wave": "blue,red,blue,red,red,red,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026162",
  "ninePool": [
    "鸡",
    "狗",
    "牛",
    "猴",
    "龙",
    "羊",
    "蛇",
    "兔",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "牛",
    "猴",
    "龙",
    "羊"
  ],
  "goldVotes": {
    "猪": 8,
    "羊": 4,
    "牛": 4,
    "狗": 2,
    "马": 6,
    "猴": 5,
    "蛇": 3,
    "兔": 4,
    "鸡": 3,
    "虎": 4,
    "鼠": 5
  },
  "missing": {
    "马": 5,
    "羊": 13,
    "猴": 19,
    "鸡": 38,
    "狗": 9,
    "猪": 0,
    "鼠": 6,
    "牛": 15,
    "虎": 7,
    "兔": 3,
    "龙": 2,
    "蛇": 1
  },
  "fixedKillSet": [
    "鼠",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "鼠",
    "羊",
    "蛇",
    "猪",
    "鸡",
    "龙",
    "猴",
    "牛",
    "马"
  ],
  "oraclePool": [
    "虎",
    "鼠",
    "兔",
    "蛇",
    "猪",
    "鸡",
    "狗",
    "龙",
    "牛"
  ],
  "hechongPool": [
    "虎",
    "兔",
    "羊",
    "蛇",
    "猪",
    "鸡",
    "猴",
    "牛"
  ],
  "dynamicRate9": 77.77777777777779,
  "dynamicRate6": 62.96296296296296
};