var predictionMaxData = {
  "time": "2026-07-14 21:32:32",
  "issue": "2026195",
  "code": "46,23,39,4,9,19,25",
  "zodiac": "鸡,猴,龙,兔,狗,鼠,马",
  "wave": "red,red,green,blue,blue,red,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026196",
  "ninePool": [
    "猪",
    "牛",
    "鼠",
    "鸡",
    "龙",
    "虎",
    "兔",
    "狗",
    "羊"
  ],
  "sixPool": [
    "猪",
    "牛",
    "鼠",
    "鸡",
    "龙",
    "虎"
  ],
  "goldVotes": {
    "羊": 4,
    "马": 4,
    "蛇": 6,
    "狗": 3,
    "猪": 6,
    "猴": 5,
    "兔": 3,
    "牛": 1,
    "鸡": 2
  },
  "missing": {
    "马": 0,
    "羊": 10,
    "猴": 9,
    "鸡": 19,
    "狗": 2,
    "猪": 23,
    "鼠": 14,
    "牛": 17,
    "虎": 4,
    "兔": 5,
    "龙": 6,
    "蛇": 1
  },
  "fixedKillSet": [
    "马",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "狗",
    "猪",
    "鼠",
    "牛",
    "虎",
    "羊",
    "鸡",
    "猴",
    "龙"
  ],
  "oraclePool": [
    "蛇",
    "狗",
    "猪",
    "虎",
    "兔",
    "马",
    "鼠",
    "牛",
    "龙"
  ],
  "hechongPool": [
    "狗",
    "牛",
    "虎",
    "羊",
    "马",
    "鼠",
    "猴",
    "龙"
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 62.0
};