var predictionMaxData = {
  "time": "2026-10-02 21:32:32",
  "issue": "2026275",
  "code": "42,49,4,47,14,43,17",
  "zodiac": "牛,马,兔,猴,蛇,鼠,虎",
  "wave": "blue,green,blue,blue,blue,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026276",
  "ninePool": [
    "龙",
    "羊",
    "猪",
    "蛇",
    "猴",
    "狗",
    "牛",
    "马",
    "兔"
  ],
  "sixPool": [
    "龙",
    "羊",
    "猪",
    "蛇",
    "猴",
    "狗"
  ],
  "goldVotes": {
    "鼠": 4,
    "兔": 2,
    "虎": 4,
    "鸡": 4,
    "羊": 1,
    "牛": 7,
    "马": 5,
    "龙": 3,
    "猪": 2,
    "猴": 1
  },
  "missing": {
    "马": 10,
    "羊": 14,
    "猴": 4,
    "鸡": 6,
    "狗": 1,
    "猪": 9,
    "鼠": 5,
    "牛": 13,
    "虎": 0,
    "兔": 7,
    "龙": 35,
    "蛇": 3
  },
  "fixedKillSet": [
    "虎",
    "龙"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "羊",
    "猪",
    "狗",
    "蛇",
    "虎",
    "鸡",
    "猴",
    "兔",
    "马",
    "鼠"
  ],
  "oraclePool": [
    "羊",
    "猪",
    "狗",
    "蛇",
    "鸡",
    "牛",
    "猴",
    "马",
    "鼠"
  ],
  "hechongPool": [
    "龙",
    "猪",
    "狗",
    "蛇",
    "虎",
    "猴",
    "马",
    "鼠"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.0
};