var predictionMaxData = {
  "time": "2026-09-26 21:32:32",
  "issue": "2026269",
  "code": "19,40,36,5,38,16,22",
  "zodiac": "鼠,兔,羊,虎,蛇,兔,鸡",
  "wave": "red,red,blue,green,green,green,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026270",
  "ninePool": [
    "猴",
    "龙",
    "虎",
    "牛",
    "狗",
    "羊",
    "蛇",
    "猪",
    "马"
  ],
  "sixPool": [
    "猴",
    "龙",
    "虎",
    "牛",
    "狗",
    "羊"
  ],
  "goldVotes": {
    "猴": 2,
    "蛇": 6,
    "虎": 6,
    "鼠": 4,
    "龙": 4,
    "兔": 3,
    "鸡": 2,
    "羊": 3,
    "马": 2,
    "猪": 2
  },
  "missing": {
    "马": 4,
    "羊": 8,
    "猴": 20,
    "鸡": 0,
    "狗": 5,
    "猪": 3,
    "鼠": 12,
    "牛": 7,
    "虎": 30,
    "兔": 1,
    "龙": 29,
    "蛇": 15
  },
  "fixedKillSet": [
    "鸡",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "鸡",
    "马",
    "蛇",
    "兔",
    "虎",
    "鼠",
    "羊",
    "猪",
    "狗"
  ],
  "oraclePool": [
    "鸡",
    "牛",
    "马",
    "蛇",
    "猴",
    "鼠",
    "羊",
    "猪",
    "狗"
  ],
  "hechongPool": [
    "龙",
    "鸡",
    "牛",
    "蛇",
    "兔",
    "羊",
    "猪",
    "狗"
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 64.0
};