var predictionMaxData = {
  "time": "2026-09-18 21:32:32",
  "issue": "2026261",
  "code": "6,25,43,46,29,47,24",
  "zodiac": "牛,马,鼠,鸡,虎,猴,羊",
  "wave": "green,blue,green,red,red,blue,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026262",
  "ninePool": [
    "龙",
    "虎",
    "猴",
    "狗",
    "鼠",
    "鸡",
    "兔",
    "牛",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "虎",
    "猴",
    "狗",
    "鼠",
    "鸡"
  ],
  "goldVotes": {
    "牛": 6,
    "马": 7,
    "蛇": 6,
    "猪": 4,
    "兔": 3,
    "虎": 4,
    "狗": 4,
    "鸡": 2,
    "猴": 2,
    "龙": 2
  },
  "missing": {
    "马": 5,
    "羊": 0,
    "猴": 12,
    "鸡": 2,
    "狗": 18,
    "猪": 1,
    "鼠": 4,
    "牛": 10,
    "虎": 22,
    "兔": 8,
    "龙": 21,
    "蛇": 7
  },
  "fixedKillSet": [
    "兔",
    "羊"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "虎",
    "鼠",
    "龙",
    "猴",
    "蛇",
    "猪",
    "兔",
    "鸡",
    "牛",
    "羊"
  ],
  "oraclePool": [
    "马",
    "虎",
    "狗",
    "龙",
    "猴",
    "蛇",
    "兔",
    "鸡",
    "羊"
  ],
  "hechongPool": [
    "马",
    "鼠",
    "猪",
    "蛇",
    "兔",
    "鸡",
    "牛",
    "羊"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};