var predictionMaxData = {
  "time": "2026-10-22 21:32:32",
  "issue": "2026295",
  "code": "22,28,33,17,13,47,25",
  "zodiac": "鸡,兔,狗,虎,马,猴,马",
  "wave": "green,green,green,green,red,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026296",
  "ninePool": [
    "狗",
    "牛",
    "龙",
    "鸡",
    "猴",
    "鼠",
    "羊",
    "虎",
    "猪"
  ],
  "sixPool": [
    "狗",
    "牛",
    "龙",
    "鸡",
    "猴",
    "鼠"
  ],
  "goldVotes": {
    "羊": 2,
    "马": 4,
    "蛇": 6,
    "狗": 4,
    "鼠": 1,
    "猴": 3,
    "虎": 2,
    "猪": 5,
    "鸡": 2,
    "兔": 2,
    "牛": 2
  },
  "missing": {
    "马": 0,
    "羊": 3,
    "猴": 13,
    "鸡": 14,
    "狗": 21,
    "猪": 8,
    "鼠": 10,
    "牛": 12,
    "虎": 2,
    "兔": 1,
    "龙": 15,
    "蛇": 6
  },
  "fixedKillSet": [
    "马",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "鸡",
    "虎",
    "猪",
    "猴",
    "羊",
    "马",
    "兔",
    "狗",
    "龙",
    "鼠"
  ],
  "oraclePool": [
    "鸡",
    "虎",
    "猪",
    "猴",
    "羊",
    "鼠",
    "狗",
    "牛",
    "马"
  ],
  "hechongPool": [
    "虎",
    "猴",
    "羊",
    "马",
    "狗",
    "牛",
    "龙",
    "鼠"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 62.0
};