var predictionMaxData = {
  "time": "2026-06-08 21:32:32",
  "issue": "2026159",
  "code": "12,4,28,17,20,46,39",
  "zodiac": "羊,兔,兔,虎,猪,鸡,龙",
  "wave": "red,blue,green,green,blue,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026160",
  "ninePool": [
    "鸡",
    "蛇",
    "猴",
    "牛",
    "马",
    "羊",
    "猪",
    "兔",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "猴",
    "牛",
    "马",
    "羊"
  ],
  "goldVotes": {
    "虎": 3,
    "鼠": 2,
    "猪": 4,
    "羊": 3,
    "牛": 2,
    "狗": 2,
    "鸡": 2,
    "蛇": 6,
    "兔": 1,
    "龙": 2,
    "马": 1
  },
  "missing": {
    "马": 3,
    "羊": 11,
    "猴": 17,
    "鸡": 36,
    "狗": 7,
    "猪": 16,
    "鼠": 4,
    "牛": 13,
    "虎": 5,
    "兔": 1,
    "龙": 0,
    "蛇": 22
  },
  "fixedKillSet": [
    "龙",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "马",
    "蛇",
    "猪",
    "羊",
    "鼠",
    "猴",
    "虎",
    "狗",
    "兔",
    "鸡"
  ],
  "oraclePool": [
    "马",
    "蛇",
    "龙",
    "牛",
    "猪",
    "羊",
    "鼠",
    "虎",
    "兔"
  ],
  "hechongPool": [
    "马",
    "龙",
    "猴",
    "狗",
    "鼠",
    "虎",
    "兔",
    "鸡"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 64.0
};