var predictionMaxData = {
  "time": "2026-09-01 21:32:32",
  "issue": "2026244",
  "code": "9,14,3,17,33,40,46",
  "zodiac": "狗,蛇,龙,虎,狗,兔,鸡",
  "wave": "blue,blue,blue,green,green,red,red",
  "teSx": "鸡",
  "teWei": 6,
  "nextIssue": "2026245",
  "ninePool": [
    "兔",
    "蛇",
    "猪",
    "鼠",
    "龙",
    "牛",
    "狗",
    "马",
    "猴"
  ],
  "sixPool": [
    "兔",
    "蛇",
    "猪",
    "鼠",
    "龙",
    "牛"
  ],
  "goldVotes": {
    "鸡": 4,
    "鼠": 3,
    "虎": 2,
    "猴": 3,
    "羊": 6,
    "蛇": 3,
    "兔": 2,
    "牛": 4,
    "狗": 1,
    "马": 2,
    "猪": 2
  },
  "missing": {
    "马": 3,
    "羊": 7,
    "猴": 8,
    "鸡": 0,
    "狗": 1,
    "猪": 9,
    "鼠": 11,
    "牛": 12,
    "虎": 5,
    "兔": 14,
    "龙": 4,
    "蛇": 15
  },
  "fixedKillSet": [
    "虎",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "猴",
    "虎",
    "兔",
    "牛",
    "马",
    "龙",
    "猪",
    "羊",
    "狗",
    "鸡"
  ],
  "oraclePool": [
    "蛇",
    "鼠",
    "虎",
    "兔",
    "牛",
    "龙",
    "马",
    "猪",
    "狗"
  ],
  "hechongPool": [
    "蛇",
    "兔",
    "牛",
    "龙",
    "猪",
    "羊",
    "狗",
    "鸡"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};