var predictionMaxData = {
  "time": "2026-09-28 21:32:32",
  "issue": "2026271",
  "code": "25,2,5,22,20,31,35",
  "zodiac": "马,蛇,虎,鸡,猪,鼠,猴",
  "wave": "blue,red,green,green,blue,blue,red",
  "teSx": "猴",
  "teWei": 5,
  "nextIssue": "2026272",
  "ninePool": [
    "龙",
    "虎",
    "蛇",
    "牛",
    "羊",
    "马",
    "狗",
    "鼠",
    "猪"
  ],
  "sixPool": [
    "龙",
    "虎",
    "蛇",
    "牛",
    "羊",
    "马"
  ],
  "goldVotes": {
    "兔": 4,
    "虎": 7,
    "猪": 7,
    "猴": 6,
    "龙": 5,
    "蛇": 3,
    "马": 3,
    "鼠": 2,
    "羊": 2,
    "狗": 1,
    "鸡": 3
  },
  "missing": {
    "马": 6,
    "羊": 10,
    "猴": 0,
    "鸡": 2,
    "狗": 7,
    "猪": 5,
    "鼠": 1,
    "牛": 9,
    "虎": 32,
    "兔": 3,
    "龙": 31,
    "蛇": 17
  },
  "fixedKillSet": [
    "虎",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "虎",
    "鸡",
    "狗",
    "羊",
    "兔",
    "蛇",
    "猪",
    "牛",
    "龙",
    "猴"
  ],
  "oraclePool": [
    "马",
    "虎",
    "羊",
    "兔",
    "蛇",
    "猪",
    "牛",
    "龙",
    "鼠"
  ],
  "hechongPool": [
    "马",
    "鼠",
    "虎",
    "狗",
    "蛇",
    "猪",
    "龙",
    "猴"
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 62.0
};