var predictionMaxData = {
  "time": "2026-08-14 21:32:32",
  "issue": "2026226",
  "code": "1,11,29,38,4,33,17",
  "zodiac": "马,猴,虎,蛇,兔,狗,虎",
  "wave": "red,green,red,green,blue,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026227",
  "ninePool": [
    "鸡",
    "龙",
    "兔",
    "狗",
    "猪",
    "马",
    "鼠",
    "蛇",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "兔",
    "狗",
    "猪",
    "马"
  ],
  "goldVotes": {
    "牛": 10,
    "猴": 4,
    "羊": 5,
    "马": 2,
    "蛇": 2,
    "鸡": 2,
    "鼠": 3,
    "虎": 2,
    "猪": 4
  },
  "missing": {
    "马": 1,
    "羊": 6,
    "猴": 3,
    "鸡": 50,
    "狗": 2,
    "猪": 17,
    "鼠": 7,
    "牛": 14,
    "虎": 0,
    "兔": 12,
    "龙": 21,
    "蛇": 4
  },
  "fixedKillSet": [
    "虎",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "兔",
    "虎",
    "马",
    "猴",
    "鸡",
    "鼠",
    "龙",
    "羊",
    "蛇",
    "猪"
  ],
  "oraclePool": [
    "兔",
    "马",
    "猴",
    "鸡",
    "狗",
    "龙",
    "羊",
    "蛇",
    "猪"
  ],
  "hechongPool": [
    "虎",
    "马",
    "猴",
    "狗",
    "鼠",
    "龙",
    "蛇",
    "猪"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0
};