var predictionMaxData = {
  "time": "2026-08-24 21:32:32",
  "issue": "2026236",
  "code": "26,35,42,9,14,17,11",
  "zodiac": "蛇,猴,牛,狗,蛇,虎,猴",
  "wave": "blue,red,blue,blue,blue,green,green",
  "teSx": "猴",
  "teWei": 1,
  "nextIssue": "2026237",
  "ninePool": [
    "鸡",
    "羊",
    "狗",
    "牛",
    "马",
    "蛇",
    "虎",
    "鼠",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "狗",
    "牛",
    "马",
    "蛇"
  ],
  "goldVotes": {
    "龙": 8,
    "兔": 7,
    "虎": 7,
    "猪": 4,
    "猴": 3,
    "马": 7,
    "蛇": 2,
    "鼠": 6,
    "狗": 2,
    "鸡": 5,
    "牛": 2,
    "羊": 1
  },
  "missing": {
    "马": 11,
    "羊": 16,
    "猴": 0,
    "鸡": 60,
    "狗": 12,
    "猪": 1,
    "鼠": 3,
    "牛": 4,
    "虎": 10,
    "兔": 6,
    "龙": 2,
    "蛇": 7
  },
  "fixedKillSet": [
    "蛇",
    "猴"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "蛇",
    "狗",
    "羊",
    "马",
    "兔",
    "虎",
    "猴",
    "龙",
    "猪"
  ],
  "oraclePool": [
    "鸡",
    "蛇",
    "狗",
    "羊",
    "牛",
    "马",
    "猴",
    "鼠",
    "猪"
  ],
  "hechongPool": [
    "蛇",
    "狗",
    "猪",
    "马",
    "虎",
    "猴",
    "鼠",
    "龙"
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 60.0
};