var predictionMaxData = {
  "time": "2026-10-25 21:32:32",
  "issue": "2026298",
  "code": "31,36,40,34,37,43,8",
  "zodiac": "鼠,羊,兔,鸡,马,鼠,猪",
  "wave": "blue,blue,red,red,blue,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026299",
  "ninePool": [
    "狗",
    "牛",
    "蛇",
    "鸡",
    "鼠",
    "猴",
    "马",
    "龙",
    "羊"
  ],
  "sixPool": [
    "狗",
    "牛",
    "蛇",
    "鸡",
    "鼠",
    "猴"
  ],
  "goldVotes": {
    "狗": 6,
    "鸡": 6,
    "虎": 4,
    "牛": 3,
    "兔": 7,
    "鼠": 3,
    "猪": 5,
    "羊": 5,
    "龙": 3,
    "猴": 1
  },
  "missing": {
    "马": 1,
    "羊": 6,
    "猴": 2,
    "鸡": 17,
    "狗": 24,
    "猪": 0,
    "鼠": 13,
    "牛": 15,
    "虎": 5,
    "兔": 4,
    "龙": 18,
    "蛇": 9
  },
  "fixedKillSet": [
    "龙",
    "猪"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "狗",
    "猪",
    "鸡",
    "龙",
    "羊",
    "鼠",
    "猴",
    "马",
    "蛇"
  ],
  "oraclePool": [
    "虎",
    "狗",
    "猪",
    "牛",
    "鸡",
    "羊",
    "鼠",
    "猴",
    "马"
  ],
  "hechongPool": [
    "虎",
    "猪",
    "兔",
    "鸡",
    "牛",
    "羊",
    "猴",
    "蛇"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 60.0
};