var predictionMaxData = {
  "time": "2026-08-22 21:32:32",
  "issue": "2026234",
  "code": "25,30,37,19,7,17,39",
  "zodiac": "马,牛,马,鼠,鼠,虎,龙",
  "wave": "blue,red,blue,red,red,green,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026235",
  "ninePool": [
    "鸡",
    "虎",
    "兔",
    "猴",
    "鼠",
    "狗",
    "羊",
    "牛",
    "马"
  ],
  "sixPool": [
    "鸡",
    "虎",
    "兔",
    "猴",
    "鼠",
    "狗"
  ],
  "goldVotes": {
    "羊": 6,
    "马": 4,
    "蛇": 3,
    "龙": 3,
    "牛": 2,
    "鸡": 2,
    "虎": 1,
    "狗": 1,
    "猴": 1
  },
  "missing": {
    "马": 9,
    "羊": 14,
    "猴": 6,
    "鸡": 58,
    "狗": 10,
    "猪": 3,
    "鼠": 1,
    "牛": 2,
    "虎": 8,
    "兔": 4,
    "龙": 0,
    "蛇": 5
  },
  "fixedKillSet": [
    "龙",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "龙",
    "兔",
    "蛇",
    "猴",
    "鸡",
    "虎",
    "马",
    "猪",
    "狗",
    "羊"
  ],
  "oraclePool": [
    "鼠",
    "龙",
    "兔",
    "蛇",
    "猴",
    "虎",
    "马",
    "牛",
    "羊"
  ],
  "hechongPool": [
    "龙",
    "鼠",
    "兔",
    "猴",
    "鸡",
    "虎",
    "马",
    "狗"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 62.0
};