var predictionMaxData = {
  "time": "2026-06-09 21:32:32",
  "issue": "2026160",
  "code": "8,16,26,1,29,30,2",
  "zodiac": "猪,兔,蛇,马,虎,牛,蛇",
  "wave": "red,green,blue,red,red,red,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026161",
  "ninePool": [
    "鸡",
    "猴",
    "虎",
    "牛",
    "兔",
    "羊",
    "猪",
    "狗",
    "马"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "虎",
    "牛",
    "兔",
    "羊"
  ],
  "goldVotes": {
    "狗": 6,
    "鸡": 9,
    "猴": 4,
    "羊": 4,
    "马": 8,
    "龙": 7,
    "鼠": 5,
    "蛇": 5,
    "猪": 4,
    "兔": 2,
    "牛": 3
  },
  "missing": {
    "马": 4,
    "羊": 12,
    "猴": 18,
    "鸡": 37,
    "狗": 8,
    "猪": 17,
    "鼠": 5,
    "牛": 14,
    "虎": 6,
    "兔": 2,
    "龙": 1,
    "蛇": 0
  },
  "fixedKillSet": [
    "鼠",
    "蛇"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "龙",
    "马",
    "猪",
    "羊",
    "鼠",
    "蛇",
    "虎"
  ],
  "oraclePool": [
    "兔",
    "鸡",
    "猴",
    "狗",
    "龙",
    "马",
    "羊",
    "蛇",
    "虎"
  ],
  "hechongPool": [
    "兔",
    "鸡",
    "猴",
    "牛",
    "猪",
    "羊",
    "蛇",
    "虎"
  ],
  "dynamicRate9": 77.77777777777779,
  "dynamicRate6": 62.96296296296296
};