var predictionMaxData = {
  "time": "2026-06-03 21:32:32",
  "issue": "2026154",
  "code": "46,28,42,31,23,34,41",
  "zodiac": "鸡,兔,牛,鼠,猴,鸡,虎",
  "wave": "red,green,blue,blue,red,red,blue",
  "teSx": "虎",
  "teWei": 1,
  "nextIssue": "2026155",
  "ninePool": [
    "鸡",
    "猪",
    "兔",
    "蛇",
    "狗",
    "马",
    "猴",
    "牛",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "兔",
    "蛇",
    "狗",
    "马"
  ],
  "goldVotes": {
    "猴": 7,
    "蛇": 3,
    "龙": 5,
    "牛": 7,
    "鼠": 4,
    "鸡": 5,
    "羊": 2,
    "虎": 4,
    "兔": 3
  },
  "missing": {
    "马": 7,
    "羊": 6,
    "猴": 12,
    "鸡": 31,
    "狗": 2,
    "猪": 11,
    "鼠": 3,
    "牛": 8,
    "虎": 0,
    "兔": 14,
    "龙": 5,
    "蛇": 17
  },
  "fixedKillSet": [
    "虎",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "虎",
    "鸡",
    "马",
    "蛇",
    "龙",
    "鼠",
    "猴",
    "羊",
    "猪"
  ],
  "oraclePool": [
    "狗",
    "虎",
    "鸡",
    "兔",
    "龙",
    "鼠",
    "猴",
    "牛",
    "猪"
  ],
  "hechongPool": [
    "狗",
    "虎",
    "马",
    "蛇",
    "龙",
    "鼠",
    "猴",
    "猪"
  ],
  "dynamicRate9": 85.0,
  "dynamicRate6": 70.0
};