var predictionMaxData = {
  "time": "2026-05-27 21:32:32",
  "issue": "2026147",
  "code": "29,40,6,18,31,10,13",
  "zodiac": "虎,兔,牛,牛,鼠,鸡,马",
  "wave": "red,red,green,red,blue,blue,red",
  "teSx": "马",
  "teWei": 3,
  "nextIssue": "2026148",
  "ninePool": [
    "龙",
    "鸡",
    "羊",
    "虎",
    "猴",
    "牛",
    "蛇",
    "狗",
    "兔"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "羊",
    "虎",
    "猴",
    "牛"
  ],
  "goldVotes": {
    "牛": 2,
    "鼠": 5,
    "猪": 3,
    "马": 6,
    "猴": 3,
    "兔": 5,
    "蛇": 8,
    "鸡": 3,
    "狗": 3,
    "羊": 3,
    "龙": 3
  },
  "missing": {
    "马": 0,
    "羊": 8,
    "猴": 5,
    "鸡": 24,
    "狗": 6,
    "猪": 4,
    "鼠": 3,
    "牛": 1,
    "虎": 2,
    "兔": 7,
    "龙": 23,
    "蛇": 10
  },
  "fixedKillSet": [
    "马",
    "鼠"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "鼠",
    "猴",
    "虎",
    "鸡",
    "牛",
    "马",
    "龙",
    "蛇",
    "猪",
    "羊",
    "狗"
  ],
  "oraclePool": [
    "鼠",
    "猴",
    "虎",
    "龙",
    "牛",
    "马",
    "兔",
    "蛇",
    "羊"
  ],
  "hechongPool": [
    "鼠",
    "猴",
    "虎",
    "龙",
    "牛",
    "马",
    "羊",
    "狗"
  ],
  "dynamicRate9": 92.3076923076923,
  "dynamicRate6": 69.23076923076923
};