var predictionMaxData = {
  "time": "2026-09-15 21:32:32",
  "issue": "2026258",
  "code": "3,23,21,35,5,19,46",
  "zodiac": "龙,猴,狗,猴,虎,鼠,鸡",
  "wave": "blue,red,green,red,green,red,red",
  "teSx": "鸡",
  "teWei": 6,
  "nextIssue": "2026259",
  "ninePool": [
    "龙",
    "羊",
    "虎",
    "狗",
    "猴",
    "猪",
    "牛",
    "马",
    "兔"
  ],
  "sixPool": [
    "龙",
    "羊",
    "虎",
    "狗",
    "猴",
    "猪"
  ],
  "goldVotes": {
    "狗": 2,
    "羊": 6,
    "牛": 2,
    "蛇": 5,
    "兔": 5,
    "马": 2,
    "鼠": 3,
    "鸡": 1,
    "猴": 1,
    "猪": 1
  },
  "missing": {
    "马": 2,
    "羊": 21,
    "猴": 9,
    "鸡": 0,
    "狗": 15,
    "猪": 3,
    "鼠": 1,
    "牛": 7,
    "虎": 19,
    "兔": 5,
    "龙": 18,
    "蛇": 4
  },
  "fixedKillSet": [
    "蛇",
    "鸡"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "牛",
    "猴",
    "羊",
    "鸡",
    "兔",
    "马",
    "虎",
    "蛇",
    "猪",
    "狗"
  ],
  "oraclePool": [
    "猴",
    "兔",
    "羊",
    "鸡",
    "马",
    "龙",
    "虎",
    "蛇",
    "狗"
  ],
  "hechongPool": [
    "牛",
    "兔",
    "鸡",
    "羊",
    "龙",
    "蛇",
    "猪",
    "狗"
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 66.0
};